{
  "www_bbc_com_food_recipes_leekandpotatosoupwit_81984": {
    "ingredients": [
      "4 chickens, cut into portions ",
      "1 leek, roughly chopped",
      "1 celery stick, roughly chopped",
      "1 onion, roughly chopped",
      "1 head of garlic, cut in half crossways",
      "sprig of thyme",
      "1 bay leaf",
      "25g/1oz butter",
      "1 tbsp olive oil",
      "1 small onion, finely chopped",
      "4 large leeks, finely sliced",
      "2 large potatoes, peeled and cut into cubes",
      "1 bouquet garni",
      "8 small rock oysters ",
      "250ml/9fl oz fish stock",
      "snipped chives, to garnish"
    ],
    "method": [
      "First make the chicken stock. Place the chickens, chopped vegetables, garlic and herbs in a large pan. Cover with cold water and bring to the boil. Skim off any fat that rises to the surface, then leave to simmer for 1½-2 hours. ",
      "Strain the stock through a colander set in a bowl, then pass through a sieve. You need 700ml/1¼ pints of stock for the soup; keep the remainder for another use. ",
      "Remove the 'oysters' (the small oyster-shaped piece of meat above the thigh) from the chicken back portions and leave to one side for use later as a garnish. Discard all the remaining contents of the colander.",
      "For the soup, melt the butter with the olive oil in a saucepan. Add the onion and slowly cook without colouring. After a couple of minutes add the leeks, then cover and sweat for about five minutes over a low heat. Do not allow the vegetables to colour.",
      "Add the potatoes and bouquet garni and cook uncovered for two minutes, then pour in the hot stock. Bring to the boil and cook until the potatoes are soft.",
      "Remove the bouquet garni, then carefully blitz the soup in a food processor or blender. Pour into a bowl and set over ice to cool. Chill in the fridge until ready to serve.",
      "Remove the rock oysters from their shells and lightly poach in the fish stock. Drain and allow to cool. ",
      "To serve, place the sea oysters and chicken 'oysters' in large soup bowls and ladle the soup on top. Finish with a sprinkling of chives."
    ],
    "url": "www_bbc_com_food_recipes_leekandpotatosoupwit_81984",
    "title": "Leek and potato soup with poached oysters recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "over 2 hoursover 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "44",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leekandpotatosoupwit_93783": {
    "ingredients": [
      "1 onion, peeled, diced",
      "1 carrot, peeled, diced",
      "4 stalks celery, diced",
      "2 leeks, diced",
      "1 bunch fresh parsley, stalks only",
      "1 head garlic, broken into cloves",
      "1 bouquet garni",
      "2kg/4lb 6½oz ox tongue",
      "1 tsp vegetable oil",
      "150g/5¼oz unsalted butter",
      "2 onions, peeled, finely sliced",
      "4 leeks, finely sliced",
      "3 medium potatoes, peeled, finely sliced",
      "4 free-range eggs, poached",
      "100g/3½oz leeks, white part only, finely sliced",
      "knob of butter",
      "100g/3½oz potato, peeled, cut into 2cm/1in cubes, boiled until tender, drained"
    ],
    "method": [
      "For the ox tongue, place the vegetables, parsley stalks, garlic and bouquet garni into a large saucepan. Cover with water and bring to the boil. ",
      "Add the ox tongue, reduce the heat and simmer for 4 hours, or until the meat is very tender.",
      "Carefully remove the tongue from the pan. Remove the skin and any glands or excess fat and gristle. Set aside to rest in the fridge for at least 30 minutes, then, cut the tongue into cubes.",
      "Heat a frying pan until hot, add the tongue cubes and fry until golden-brown and crisp on all sides.",
      "Meanwhile, for the leek and potato soup, melt the butter in a saucepan over a gentle heat, until foaming. Fry the onions for 4-5 minutes, or until softened. ",
      "Add the leeks and fry for a further 2-3 minutes. Stir in the potatoes and cover with 1 litre/1pint 15¼fl oz water. Bring the mixture to the boil and cook for 10-15 minutes, or until the potatoes are tender.",
      "Remove the pan from the heat and blend the mixture in a blender until smooth. Season, to taste, with salt and freshly ground black pepper.",
      "To serve,  heat the butter in a frying pan and fry the leeks  for 4-5 minutes, or until softened. Season, to taste with salt and freshly ground black pepper.",
      "Spoon some fried leeks and cooked potato into each of 4 serving bowls and top with a poached egg. Ladle the soup around the egg and top with the crisp ox tongue."
    ],
    "url": "www_bbc_com_food_recipes_leekandpotatosoupwit_93783",
    "title": "Leek and potato soup with crisp ox tongue and poached egg recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "over 2 hoursover 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "Serves 4Serves 4",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leekandpotatosoup_79045": {
    "ingredients": [
      "1 tbsp olive oil",
      "½ potato, peeled and diced",
      "1 garlic clove, peeled and diced",
      "1 leek, diced",
      "55ml/2fl oz white wine",
      "150ml/5fl oz vegetable stock",
      "55ml/2fl oz double cream ",
      "salt and freshly ground black pepper",
      "1 slice of bread",
      "35g/1½oz blue cheese"
    ],
    "method": [
      "Heat the oil in a saucepan and fry the potato and garlic for 3-4 minutes, to soften. ",
      "Add the leeks and cook for a further few minutes.",
      "Stir in the wine with the stock and cream then reduce the heat and simmer gently for 10-12 minutes, or until the potatoes are tender.",
      "Using a hand blender, blend the soup until smooth and season to taste. ",
      "To serve, toast the bread on one side, under a hot grill, until golden. Turn over and lay the blue cheese on top. Return to the grill and cook until melted and golden.",
      "Serve the cheese toast on top of the soup."
    ],
    "url": "www_bbc_com_food_recipes_leekandpotatosoup_79045",
    "title": "Quick leek and potato soup recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 1Serves 1",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leekandpotatosoup_85929": {
    "ingredients": [
      "50g/2oz unsalted butter",
      "½ onion, finely sliced",
      "1 garlic clove, chopped ",
      "1 leek, trimmed and chopped ",
      "1 potato, peeled and chopped",
      "150ml/4½fl oz hot vegetable stock",
      "50g/2oz bacon lardons, or chopped smoked bacon ",
      "1 garlic clove, chopped",
      "1 tsp smoked paprika",
      "salt and freshly ground black pepper",
      "sprig fresh chervil, to garnish"
    ],
    "method": [
      "For the leek and potato soup, heat the butter in a pan and sauté the onion, garlic and leek until softened.",
      "Add the potato and stock and bring to the boil. Reduce the heat and simmer for ten minutes, or until the potato is tender. Remove from the heat and allow to cool slightly.",
      "Pour the soup into a blender and blend until smooth.",
      "For the spicy pork fat, heat the pork fat in a pan with the garlic and paprika. Season with salt and freshly ground black pepper and fry gently until the fat has rendered and the texture is crisp. Remove the fat pieces with a slotted spoon and drain on kitchen paper.",
      "To serve, pour the soup into a bowl, top with the spicy pork fat and garnish with chervil."
    ],
    "url": "www_bbc_com_food_recipes_leekandpotatosoup_85929",
    "title": "Leek and potato soup with spicy bacon  recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 1Serves 1",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leekandpotatosoup_85731": {
    "ingredients": [
      "1 tbsp olive oil",
      "½ leek, finely chopped",
      "1 garlic clove, finely chopped",
      "sprig fresh thyme, leaves only",
      "½ vegetable stock cube, crumbled",
      "150ml/¼ pint milk",
      "1 small potato, peeled and chopped",
      "1 tbsp double cream",
      "salt and freshly ground black pepper",
      "1 tbsp chopped fresh chives, to serve"
    ],
    "method": [
      "Heat the olive oil in a small pan, add the leek and sauté for 3-4 minutes, until softened. Add the garlic and thyme and fry for a further minute.",
      "Add the half stock cube, the milk and potato. Bring to the boil, reduce the heat and simmer for 6-8 minutes, or until the potato is tender.",
      "Stir in the cream, season, to taste, with salt and freshly ground black pepper and allow to cool slightly.",
      "Pour the soup into a food processor and blend until smooth. If necessary, gently reheat the soup before serving.",
      "To serve, pour the soup into a bowl or cappuccino cup and sprinkle with chives."
    ],
    "url": "www_bbc_com_food_recipes_leekandpotatosoup_85731",
    "title": "Creamy leek and potato soup recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 1Serves 1",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leekandsmokedsalmont_89896": {
    "ingredients": [
      "225g/8oz ready-made shortcrust pastry",
      "50g/2oz butter",
      "750g/1lb 10½oz trimmed leeks, finely sliced",
      "5 sprigs fresh thyme, leaves only",
      "200ml/7fl oz double cream",
      "1 free-range egg",
      "1 free-range egg yolk",
      "salt and freshly ground black pepper",
      "200g/7oz smoked salmon",
      "75g/3oz gruyère cheese, grated",
      "1 tbsp wholegrain mustard",
      "1 tbsp white wine vinegar",
      "3 tbsp extra virgin olive oil",
      "2 Little Gem lettuces, leaves trimmedseparated",
      "50g/2oz watercress"
    ],
    "method": [
      "For the tart, preheat the oven to 200C/400F/Gas 6.",
      "On a lightly floured surface, roll out the pastry to line a 20cm/8in diameter, 2.5cm/1in deep loose-bottomed tart tin. Line the inside of the tin with the pastry, then cover and chill in the fridge for 30 minutes.",
      "Remove the tart case from the fridge. Line the pastry tart case with greaseproof paper and fill with baking beans or uncooked rice. Bake blind in the oven for 15 minutes.",
      "Remove the baking beans or rice and greaseproof paper and return the tart case to the oven to bake for a further 5-6 minutes, or until it is just cooked and becoming golden-brown.",
      "Reduce the oven temperature to 180C/360F/Gas 4.",
      "Meanwhile, melt the butter in a large frying pan over a low heat. Add the leeks and fry until just softened. Remove from the heat and leave to cool.",
      "Place the cream, egg and egg yolk into a bowl and whisk to combine.",
      "Add the egg and cream mixture to the cold leeks and mix together well. Season well with salt and freshly ground black pepper.",
      "Pour the leek mixture into the cooked pastry case.",
      "Place the smoked salmon over the top of the leek mixture filling, to cover the filling completely.",
      "Sprinkle the grated gruyère over the top of the smoked salmon layer. Bake in the oven for 20 minutes, or until the filling is just set and the top is golden-brown.",
      "For the salad, whisk the mustard, vinegar and olive oil together in a bowl. Add the Little Gems and watercress and mix well.",
      "To serve, place a slice of tart onto each plate and place a portion of salad alongside."
    ],
    "url": "www_bbc_com_food_recipes_leekandsmokedsalmont_89896",
    "title": "Leek and smoked salmon tart with salad recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Serves 6Serves 6",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leekandsmokedcheesep_91738": {
    "ingredients": [
      "200g/7oz plain flour, sifted, plus extra for dredging",
      "pinch salt",
      "4 free-range eggs",
      "400ml/14fl oz milk",
      "150ml/5½fl oz water",
      "100g/3½oz butter, melted",
      "vegetable oil, for frying",
      "2 free-range eggs, beaten ",
      "125g/4½oz polenta (cornmeal)",
      "50g/2oz butter",
      "250g/9oz leeks, sliced into rounds ",
      "150g/5½oz smoked cheese, grated",
      "1 tbsp chopped fresh thyme",
      "1 tbsp chopped fresh sage",
      "100g/3½oz frozen peas",
      "100g/3½oz ricotta ",
      "1 red onion, peeled, chopped ",
      "1 cucumber, chopped",
      "12 cherry tomatoes, chopped",
      "200ml/7fl oz tomato passata ",
      "1 red chilli, finely chopped ",
      "50ml/2fl oz sherry vinegar"
    ],
    "method": [
      "For the pancakes, sift the flour and salt into a large bowl and make a well in the centre. Break the eggs into the well, then gradually mix the eggs into the flour with a fork. Gradually add the milk and water to the mixture, whisking continuously, until the mixture is smooth and has the texture of double cream. Finally, whisk in the butter. ",
      "Heat a drizzle of the oil in a 18cm/7in non-stick frying pan over a high heat until smoking, then turn the heat down to medium. Spoon in about two tablespoons of the pancake batter into the pan, swirling it around to evenly coat the bottom of the pan.",
      "Cook for about 30 seconds, then flip the pancake over and cook for a further 15-20 seconds, or until cooked through. Place the pancake onto a plate lined with greaseproof paper, then place another layer of greaseproof paper on top. Repeat the cooking process with the remaining pancake batter, adding more oil to the pan if necessary, and making sure each pancake sits between two layers of greaseproof paper to prevent them from sticking to each other. Set aside. ",
      "Preheat the oven to 180C/350F/Gas 4.",
      "For the filling, melt the butter in a pan until foaming, then gently fry the leeks for 4-5 minutes, or until softened. Drain well, then place into a bowl. ",
      "Add the smoked cheese, thyme, sage, peas and ricotta to the bowl of leeks and mix together until well combined. ",
      "Spread about three tablespoons of the filling over one pancake. Roll up the bottom, then the two sides; roll the pancake upwards to form a cylindrical shape like a spring roll. Repeat with the remaining filling and pancakes.",
      "Dredge each pancake roll in flour, then dip into the beaten egg and roll in the polenta to coat. ",
      "Heat a drizzle of oil in a frying pan and fry the pancake rolls for 3-4 minutes on each side, or until golden-brown all over. Place the pancakes into the oven to cook for 10-12 minutes, or until heated through. Set aside.",
      "For the salsa, mix together all of the salsa ingredients in a bowl. ",
      "To serve, arrange the pancake rolls on serving plates with the salsa in small bowls alongside for dipping."
    ],
    "url": "www_bbc_com_food_recipes_leekandsmokedcheesep_91738",
    "title": "Leek and smoked cheese pancakes recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 6Serves 6",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leekandspringonionte_86658": {
    "ingredients": [
      "3 medium leeks, trimmed",
      "12 spring onions, trimmed",
      "750ml/1 pint 6fl oz vegetable stock",
      "1 bay leaf",
      "3 leaves gelatine",
      "salt and freshly ground black pepper",
      "2 tbsp roughly chopped fresh chervil",
      "1 tsp English mustard",
      "2 tsp white wine vinegar",
      "½ lemon, juice only",
      "250ml/9fl oz rapeseed oil",
      "salt and freshly ground black pepper ",
      "750g/1lb 10oz cooked ham, sliced, to serve"
    ],
    "method": [
      "For the terrine, place the leeks and spring onions into a wide shallow pan with the vegetable stock and bay leaf. Bring to the boil, then reduce the heat and simmer for 8-10 minutes, or until the vegetables are tender. Remove the vegetables from the pan and set aside.",
      "Return the pan to the heat and boil to reduce the volume of the stock by two thirds.",
      "Meanwhile, soak the gelatine leaves in cold water until softened. Strain, then add to the reduced stock. Whisk to combine, then strain into a bowl. Allow to cool, then season with salt and freshly ground black pepper and stir in the chervil.",
      "Place into the fridge and chill for 30 minutes, or until just setting, but still with a good wobble.",
      "On a work surface, place three large sheets of cling film one on top of the other. Lay the leeks in a row on the cling film, then top with the spring onions.",
      "Spoon over the jelly, then roll the cling film up into a large cigar shape, twisting firmly to enclose at both ends. Place in the fridge for at least an hour until fully set.",
      "For the dressing, whisk the mustard, vinegar and lemon juice together in a bowl. Slowly whisk in the rapeseed oil and season, to taste, with salt and freshly ground black pepper.",
      "To serve, slice the terrine into wedges and place onto serving plates with some slices of ham and a drizzle of dressing."
    ],
    "url": "www_bbc_com_food_recipes_leekandspringonionte_86658",
    "title": "Leek and spring onion terrine with roasted ham and mustard dressing recipe - BBC Food",
    "time": {
      "preparation": "1-2 hours1-2 hours",
      "preparationMins": 120,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 150
    },
    "serves": "Serves 4-6Serves 4-6",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leekandstiltontart_85730": {
    "ingredients": [
      "1 sheet ready-made filo pastry",
      "25g/1oz butter, melted",
      "1 tbsp olive oil",
      "¼ leek, finely sliced",
      "2 free-range egg yolks",
      "2 tbsp double cream",
      "1 tbsp chopped fresh chives, plus extra to serve ",
      "salt and freshly ground black pepper",
      "30g/1oz Stilton, crumbled"
    ],
    "method": [
      "Preheat the oven to 200C/400F/Gas 6.",
      "Brush the filo pastry with butter, fold in half and press into a chefs' ring on a baking sheet. Brush with more butter, then transfer to the oven and bake for eight minutes, or until golden-brown.",
      "Meanwhile, heat the olive oil in a small pan, add the leek and sauté for 3-4 minutes, until softened. Leave to cool slightly.",
      "Place the eggs, cream and chives into a bowl, season with salt and freshly ground black pepper and mix well. Add the leeks to the bowl and stir to combine.",
      "Remove the filo pastry case from the oven, pour in the egg mixture and top with the Stilton. Return to the oven and bake for 8-10 minutes, or until the filling has set.",
      "To serve, place the tart onto a plate, remove the chefs' ring and sprinkle with chopped chives."
    ],
    "url": "www_bbc_com_food_recipes_leekandstiltontart_85730",
    "title": "Leek and Stilton tart recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 1Serves 1",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leekandsweetpotatogr_89400": {
    "ingredients": [
      "1 tbsp olive oil",
      "25g/1oz butter",
      "½ onion, chopped",
      "½ leek, white part only, sliced",
      "½ sweet potato, peeled and sliced",
      "2 tbsp white wine",
      "200ml/7fl oz double cream",
      "salt and freshly ground black pepper"
    ],
    "method": [
      "Preheat the oven to 180C/350F/Gas 4.",
      "Heat the oil and butter in an ovenproof frying pan over a medium heat. Fry the onion and leek for 3-4 minutes, or until softened. Add the sweet potato and fry for a further two minutes.",
      "Add the wine and simmer for 1-2 minutes until the liquid has reduced. Add the cream, season to taste with salt and freshly ground black pepper, and stir well.",
      "Transfer the pan to the oven and cook for 10-12 minutes, or until the potatoes are cooked through and the cream is bubbling.",
      "To serve, spoon onto a serving plate and serve immediately as a side dish."
    ],
    "url": "www_bbc_com_food_recipes_leekandsweetpotatogr_89400",
    "title": "Leek and sweet potato gratin recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 1Serves 1",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leekbluecheeseandpot_88555": {
    "ingredients": [
      "1 tbsp olive oil",
      "25g/1oz butter",
      "½ onion, chopped",
      "1 garlic clove, finely chopped",
      "200g/7oz new potatoes, chopped",
      "85g/3oz baby leeks, sliced",
      "300ml/10fl oz hot chicken or vegetable stock",
      "85g/3oz Lanark Blue cheese, or other blue cheese, to serve"
    ],
    "method": [
      "Heat the oil and butter in a pan and gently fry the onion and garlic for a couple of minutes, until softened.",
      "Add the potatoes and leeks and continue to fry for another 3-4 minutes.",
      "Add the stock and bring to a simmer. Simmer for 10-12 minutes, or until the potatoes are tender.",
      "Serve in a bowl, with the blue cheese crumbled over the top."
    ],
    "url": "www_bbc_com_food_recipes_leekbluecheeseandpot_88555",
    "title": "Leek, blue cheese and potato soup recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 1Serves 1",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leekonionandgarlicso_86202": {
    "ingredients": [
      "1 tbsp olive oil",
      "½ leek, finely sliced",
      "1 garlic clove, finely chopped",
      "¼ onion, finely chopped",
      "150ml/¼ pint hot vegetable stock",
      "1 tbsp double cream",
      "salt and freshly ground black pepper",
      "1 slice ciabatta, griddled",
      "olive oil, to drizzle"
    ],
    "method": [
      "Heat the oil in a small saucepan, add the leek, garlic and onion and sauté gently for 3-4 minutes. Add the stock and simmer for five minutes. Remove from the heat and allow to cool slightly.",
      "Pour into a blender, add the cream and season well with salt and freshly ground black pepper. Blend until smooth. ",
      "To serve, pour into a bowl and top with the griddled ciabatta and a drizzle of olive oil."
    ],
    "url": "www_bbc_com_food_recipes_leekonionandgarlicso_86202",
    "title": "Leek, onion and garlic soup recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 1Serves 1",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leekrisottowithparme_92285": {
    "ingredients": [
      "2 medium leeks, sliced",
      "thick slice of butter",
      "3-4 tarragon stalks, leaves only ",
      "2 good spilling handfuls of arborio rice (about 200g/7oz)",
      "175ml/6fl oz wineglass dry white wine",
      "1 litre/1 pint 15fl oz hot homemade chicken stock (the stock can be made from leftover roast chicken)",
      "salt and freshly ground black pepper",
      "2 heaped tablespoons finely grated parmesan cheese"
    ],
    "method": [
      "Scatter the chopped leeks into a large shallow pan, add the butter and some tarragon leaves and cook over a gentle heat, stirring from time to time, until the leeks soften and become translucent but not coloured, about 12-15 minutes.",
      "Stir in the rice to coat in the butter, then add the wine and let it bubble until the liquid has pretty much disappeared. Little by little add the hot stock, a couple of ladlefuls at a time at the most. When the rice absorbs the liquid and starts to diminish in the pan, you can add another ladle or so, stirring the rice often. Continue cooking until the rice has become plump and creamy but still has a little bite left in it, about 20 minutes. Season, to taste, with salt and freshly ground black pepper. ",
      "The parmesan crisps can be made about ten minutes before the serving the risotto. Place each spoonful of finely grated parmesan into a non-stick pan over a low heat and flatten slightly with the back of a spoon so it looks like a biscuit. Leave it to cook gently, so that the parmesan melts and forms a little crust. Once it is crisp on the bottom, very carefully flip it over using a palette knife. Cook for a minute or two on the other side and then remove from the pan. Serve the risotto in two bowls, both topped with a parmesan crisp."
    ],
    "url": "www_bbc_com_food_recipes_leekrisottowithparme_92285",
    "title": "Leek risotto with parmesan crisps recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Serves 2Serves 2",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leekrisottowithparme_92285_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leeksoupwithchillian_90087": {
    "ingredients": [
      "2 tbsp olive oil",
      "½ onion, chopped",
      "1 garlic clove, finely chopped",
      "½ leek, green part only, chopped",
      "400ml/14fl oz vegetable stock",
      "3 tbsp double cream",
      "salt and freshly ground black pepper",
      "3 slices French stick",
      "85g/3oz mature cheddar, grated",
      "1 red chilli, de-seeded and finely chopped"
    ],
    "method": [
      "Preheat the oven to 180C/350F/Gas 4.",
      "For the soup, heat the oil in a pan and gently fry the onion, garlic and leek for about 3-4 minutes, or until softened. Add the stock and simmer for 4-5 minutes, then stir in the cream. Season, to taste, with salt and freshly ground black pepper then blend until smooth with a stick blender. ",
      "For the croûtes, arrange the slices of bread on a tray and bake in the oven for 2-3 minutes, or until crisp. Remove from the oven, sprinkle over the cheese and chilli and return to the oven for a further 3-4 minutes, or until the cheese is melted.",
      "Serve the soup in a bowl with the croûtes on the side."
    ],
    "url": "www_bbc_com_food_recipes_leeksoupwithchillian_90087",
    "title": "Leek soup with chilli and cheese croutes recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "",
      "cookingMins": null,
      "totalMins": 30
    },
    "serves": "Serves 1Serves 1",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leeksoup_87413": {
    "ingredients": [
      "dash olive oil",
      "½ onion, chopped",
      "1 garlic clove, peeled and finely chopped",
      "½ large leek, chopped",
      "150ml/5¼fl oz hot vegetable stock",
      "150ml/5¼fl oz whole milk",
      "salt and freshly ground black pepper",
      "1 tbsp double cream, to serve",
      "1 tsp chopped fresh chives, to serve"
    ],
    "method": [
      "Heat the olive oil in a small saucepan, add the onion, garlic and leek and sauté for 4-5 minutes, or until softened but not coloured. ",
      "Add the vegetable stock, milk and seasoning and bring to the boil. Simmer for six minutes, then remove from the heat and allow to cool slightly. Pour into a food processor and blend until smooth. ",
      "To serve, pour into a bowl and garnish with a swirl of double cream and chopped chives."
    ],
    "url": "www_bbc_com_food_recipes_leeksoup_87413",
    "title": "Creamy leek soup recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 1Serves 1",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leekswiththreemustar_8917": {
    "ingredients": [
      "3lb (1kg 350g) small leeks, trimmed and washed and cut in half",
      "salt and pepper",
      "2oz (50g) butter",
      "3oz (50g) plain flour",
      "¾ pint (425ml) milk",
      "6oz (175g) cheddar cheese, grated ",
      "1oz (25g) parmesan, or similar vegetarian hard cheese, grated",
      "1 tbsp (15g) wholegrain mustard",
      "1 tbsp (15g) Dijon mustard",
      "1 tsp (5g)  English mustard",
      "2 tbsp  fresh white breadcurmbs",
      "1oz (25g) grated cheddar cheese"
    ],
    "method": [
      "Preheat oven to 200C/400F/Gas 6/180C fan oven.",
      "Place the leeks in a pan of cold salted water, bring to the boil and simmer for 3 minutes until just tender. Drain and put under cold water immediately to refresh and stop the cooking process.",
      "Place the butter, flour and milk in a saucepan and slowly bring up to the boil and whisk all the time. Once it is up to the boil, reduce the heat and let it just simmer for 2 minutes.",
      "Add the grated cheddar and parmesan and then the mustards. Season with salt and pepper.",
      "Put your leeks into a shallow serving dish and pour over the sauce.",
      "Mix the breadcrumbs and the cheese together and scatter over the top of the leeks.",
      "Bake in the oven for 20 minutes until the top is golden brown."
    ],
    "url": "www_bbc_com_food_recipes_leekswiththreemustar_8917",
    "title": "Leeks with three mustard and cheese sauce recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "88",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leek_and_potato_strudel_70345": {
    "ingredients": [
      "1 tsp vegetable oil, plus extra for greasing ",
      "285g/10¼oz plain flour, plus extra for dusting",
      "pinch salt",
      "½ tsp hot, smoked paprika",
      "1 medium free-range egg",
      "100g/3½oz butter",
      "450g/1lb potatoes, peeled and diced",
      "olive oil for frying",
      "1 medium onion, finely chopped",
      "3 leeks, washed and finely chopped",
      "¾ tsp ground turmeric",
      "1 large chilli, finely chopped ",
      "1 tsp harissa ",
      "50g/1¾oz whole pistachios",
      "75ml/5 tbsp whipping or double cream ",
      "100g/3½oz Gruyère, grated",
      "50g/1¾oz breadcrumbs (approximately two slices of bread) ",
      "1½ tsp sea salt",
      "freshly ground black pepper",
      "1 tsp hot, smoked paprika",
      "1 tbsp nigella seeds (available from large supermarkets)",
      "large handful fresh coriander ",
      "75ml/2½fl oz olive oil ",
      "100g/3½oz cherry tomatoes on the vine",
      "large handful fresh rocket ",
      "1 radicchio head, trimmed"
    ],
    "method": [
      "For the filo pastry, lightly oil a large bowl.  Sift the flour, paprika and salt into a clean bowl and make a well in the centre. Add the egg and oil then gradually stir in 150ml/5fl oz water, or enough to make a soft dough.",
      "Lightly flour the work surface, turn out the dough and knead for 15 minutes (this dough is best kneaded by pulling it up from the counter and throwing it down - don’t leave it in contact with the counter for too long or it will stick). The dough is ready when it loses its stickiness and is elastic enough to be stretched by approximately 50cm. Place the dough in the oiled bowl, cover with cling film and leave to relax for an hour.",
      "For the leek and potato filling, steam the diced potatoes for approximately five minutes, or until they are cooked through but still hold their shape. Remove from the heat and set aside to cool. ",
      "In a frying pan, cook the onions and leeks in a little olive oil until they are soft and the onions are translucent. Add the turmeric, chilli, harissa, potatoes, pistachios and cream to the pan. Remove from the heat, stir in the cheese and breadcrumbs, then season to taste with salt and freshly ground black pepper.",
      "Preheat the oven to 200C/400F/Gas 6, line a baking tray with parchment paper and cover the work surface with a table cloth generously dusted with flour. ",
      "Melt the butter and use a rolling pin to roll out the dough to a thickness of 1cm/½in. Stretch the dough by hand taking care not to tear it, pull the dough gently by running your hands under the dough from the centre outwards. The finished dough should be very thin, transparent enough to read through and at least 50cm wide.",
      "Trim the dough edges with scissors to make a neat rectangle then scatter the dough liberally with melted butter from a flicked pastry brush.",
      "Place the cooled filling at one of the narrow ends of the pastry and, using the table cloth to help, gently roll up the strudel. Fold the pastry edges under the strudel and place on the lined baking tray. Curve into a horseshoe shape if it is too big for the tray.",
      "Sprinkle with melted butter and scatter over the paprika and nigella seeds. Bake on the top shelf of the oven for 30-40 minutes or until golden brown.",
      "To serve, blend the coriander with 50ml warmed olive oil in a food processor. Transfer the strudel to a serving plate. Place the cherry tomatoes on a baking tray and brush with oil. Use a blowtorch to char the tomato skin then arrange around the strudel with the rocket, radicchio and coriander oil blend. "
    ],
    "url": "www_bbc_com_food_recipes_leek_and_potato_strudel_70345",
    "title": "Leek and potato strudel recipe - BBC Food",
    "time": {
      "preparation": "30 mins to 1 hour30 mins to 1 hour",
      "preparationMins": 60,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 120
    },
    "serves": "Serves 4Serves 4",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leek_and_stilton_quiche_08524": {
    "ingredients": [
      "225g/8oz plain flour",
      "125g/4½oz butter",
      "1 free-range egg",
      "1 tbsp water",
      "1 tbsp olive oil",
      "2 leeks, thinly sliced",
      "2 sticks celery, thinly sliced",
      "4 free-range eggs",
      "450ml/16fl oz double cream",
      "150g/5½oz Stilton cheese, coarsely grated",
      "2 tbsp chopped parsley",
      "salt and freshly ground black pepper"
    ],
    "method": [
      "Preheat the oven to 200C/180 Fan/Gas 6.  ",
      "To make the pastry, measure the flour and butter into a food processor and blend until the mixture resembles breadcrumbs. Add the egg and water and blend again until it forms a smooth dough ball. Roll on a lightly floured work surface and use the pastry to line a 28cm/11in loose-bottomed, deep quiche tin. Form a little lip around the top and prick the base with a fork. Place in the fridge for 15 minutes.",
      "Line with baking paper and baking beans and bake for 15 minutes. Remove the beans and paper and return to the oven for a further 5–10 minutes, or until just cooked and pale golden-brown. Reduce the oven temperature to 180C/160 Fan/Gas 4.",
      "To make the filling, heat the oil in a wide-based frying pan, add leeks and celery and fry over a high heat for few minutes.  ",
      "Lower the heat, cover and simmer for about 25 minutes, or until the vegetables are completely tender. Remove the lid, increase the heat and fry for a minute to cook off any excess water.    ",
      "Beat the eggs and cream together in a jug and season with salt and pepper.",
      "Spoon the soft leeks and celery into the pastry case, scatter with cheese and parsley and season with salt and pepper. Pour over the cream.  ",
      "Bake for about 35–40 minutes, or until golden-brown and just set on top. Leave to sit for about 5–10 minutes before turning out."
    ],
    "url": "www_bbc_com_food_recipes_leek_and_stilton_quiche_08524",
    "title": "Leek and Stilton quiche recipe - BBC Food",
    "time": {
      "preparation": "30 mins to 1 hour30 mins to 1 hour",
      "preparationMins": 60,
      "cooking": "1 to 2 hours1 to 2 hours",
      "cookingMins": 120,
      "totalMins": 180
    },
    "serves": "Serves 6-8Serves 6-8",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leek_and_stilton_quiche_08524_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leek_soup_66968": {
    "ingredients": [
      "1 carrot, grated",
      "1 onion, grated",
      "2 sticks celery, grated",
      "2 garlic cloves, roughly chopped",
      "salt and pepper",
      "stalks from a small bunch of parsley",
      "olive oil",
      "1 onion, finely chopped",
      "200g/7oz floury potatoes, peeled and chopped into cubes",
      "350g/12oz celeriac, peeled and chopped",
      "1 sprig thyme, leaves only",
      "4 leeks, finely sliced",
      "sea salt and freshly ground black pepper",
      "1 small bunch chives, finely chopped"
    ],
    "method": [
      "To make the stock, put the grated carrot, onion, celery and garlic into a large heatproof bowl. Add a pinch of salt and pepper and pour over 1 litre/1¾ pints of boiling water. Set aside to steep for 10-15 minutes while you prepare the soup.",
      "Heat a large heavy-based saucepan or casserole dish over a medium heat. Add a dash of oil and, once hot, add the onion, potatoes, celeriac and thyme leaves. Cook over a medium heat for 10 minutes, or until the vegetables have softened.",
      "Strain the stock through a sieve into the pan of celeriac. Simmer gently for 10-15 minutes until the celeriac is nearly tender. ",
      "Add the leeks, cover the pan and cook for a further 5-7 minutes, or until the leeks are wilted and tender but still bright green.",
      "Remove from the heat and blend in batches until really smooth. (Blend for a minute or longer for a really velvety texture.) The soup can be stored in the fridge or frozen at this stage.",
      "Transfer the blended soup to a clean pan. Reheat the soup if necessary, taste and season with salt and pepper to taste.To serve, spoon into bowls and garnish with chopped chives. "
    ],
    "url": "www_bbc_com_food_recipes_leek_soup_66968",
    "title": "Leek soup recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 6-8Serves 6-8",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leek_soup_66968_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leelikolminicurrygre_12734": {
    "ingredients": [
      "2 tbsp oil",
      "1 onion, finely sliced",
      "6 garlic cloves, crushed",
      "4cm/1½in piece of fresh ginger, crushed",
      "2 hot green chillies, seeds removed, finely chopped",
      "½ tsp ground turmeric",
      "450ml/14fl oz can coconut milk",
      "4 green cardamom pods, lightly crushed",
      "4 cloves",
      "5-6 curry leaves (available from Asian grocers)",
      "2cm/¾in piece cinnamon stick",
      "2 tbsp chopped fresh coriander",
      "500g/1lb 2oz tiger prawns, cleaned and de-veined, shells removed but tail intact"
    ],
    "method": [
      "Heat the oil in a large heavy-based pan with a lid. Add the onion and cook until translucent.",
      "Add the garlic, ginger and green chillies and cook for two minutes, taking care not to let them brown. ",
      "Add the turmeric and cook for a few seconds, then pour in the coconut milk. Bring slowly to the boil, stirring right from the bottom of the mixture. ",
      "Season with salt, then add the cardamom, cloves, curry leaves and cinnamon. Simmer for a couple of minutes, until the mixture has thickened slightly, then add the coriander and cook for another minute or two. ",
      "Add the prawns and cook for 2-4 minutes, depending on their size. Cover the pan, remove from the heat and set aside for about five minutes. The prawns will continue to cook in the residual heat of the curry (more cooking on the stove will spoil the prawns by overcooking).",
      "Serve with steamed jasmine rice and a fresh onion salad."
    ],
    "url": "www_bbc_com_food_recipes_leelikolminicurrygre_12734",
    "title": "Thai green prawn curry recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 4Serves 4",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leelikolminicurrygre_12734_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leftoverroastchicken_92286": {
    "ingredients": [
      "leftover roast chicken",
      "vegetables, such as onions, carrots and celery"
    ],
    "method": [
      "Place the bones of the leftover roast chicken in a large pan or stockpot with any vegetables you have, such as onions, carrots and celery, and cover with cold water. Bring to a simmer and cook gently for 2-6 hours depending what time allows, but as a general rule the longer it can simmer, the better the flavour will be. Strain and either store for 3-4 days in the fridge or freeze and use from frozen when needed."
    ],
    "url": "www_bbc_com_food_recipes_leftoverroastchicken_92286",
    "title": "Leftover roast chicken stock recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "over 2 hoursover 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "Makes 1-2 litresMakes 1-2 litres",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leesbrownbagfriedchi_91744": {
    "ingredients": [
      "2 chicken breasts (wing bone attached), skin on, cut in two diagonally",
      "2 chicken legs, skin on",
      "2 chicken thighs, skin on",
      "1 litre/1¾ pints sunflower oil, for deep frying",
      "7 tbsp plain white flour",
      "1 tbsp dried oregano, crumbled",
      "1 tbsp dried thyme leaves",
      "1 tbsp dried rosemary leaves, crumbled",
      "2 tsp cayenne pepper",
      "2 tsp ground white pepper",
      "1 tbsp sea salt flakes",
      "100ml/3½fl oz evaporated milk",
      "2 free-range eggs, beaten ",
      "French fries",
      "ready-made tomato ketchup, mayonnaise or barbecue sauce (optional)"
    ],
    "method": [
      "Rinse the chicken pieces in cold water, then pat dry with kitchen paper. ",
      "For the coating, tip the flour, dried herbs, cayenne pepper, white pepper and a pinch of salt into a large, strong polythene bag. Shake until well combined. ",
      "In a bowl, beat together the evaporated milk and eggs until well combined. Set aside. ",
      "Half-fill a large, heavy-based pan with the oil and heat to 180C/350F (use a kitchen thermometer to check the temperature). ",
      "Dip a chicken piece into the milk and egg mixture until completely coated, then place it into the polythene bag containing the flour and herb mixture. Twist the bag closed, trapping in air so that it resembles a balloon, and shake vigorously until the chicken piece is completely coated. Remove the chicken piece from the bag and set aside on a plate. Repeat the process with the remaining chicken pieces.",
      "Carefully lower the coated chicken pieces into the hot oil, one at a time, using tongs. When all of the chicken pieces have been added, the oil should be just bubbling. Cook the chicken in the oil for 18-20 minutes, turning regularly, until crisp and deep golden-brown and completely cooked through. Remove the cooked chicken from the pan using a slotted spoon and set aside to drain on kitchen paper. ",
      "To serve, divide the chicken pieces equally among four serving plates. Serve with French fries and dollops of tomato ketchup, mayonnaise or barbecue sauce, if using."
    ],
    "url": "www_bbc_com_food_recipes_leesbrownbagfriedchi_91744",
    "title": "Easy fried chicken recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 4Serves 4",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leesbrownbagfriedchi_91744_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leftover_waffles_with_59419": {
    "ingredients": [
      "260g/9½oz plain flour",
      "1 tbsp baking powder ",
      "1 tsp sea salt flakes",
      "1 tbsp granulated sugar",
      "3 large free-range eggs, lightly beaten",
      "425ml/15fl oz full-fat milk",
      "110g/3¾oz unsalted butter, melted",
      "150g/5½oz leftover smoked salmon, torn into small pieces",
      "2 tbsp finely chopped chives",
      "12 thin slices pancetta",
      "maple syrup, to taste",
      "vanilla ice cream, to taste"
    ],
    "method": [
      "Preheat the waffle maker and preheat the oven to 140C/120C Fan/Gas 1. Put a large wire rack on a baking tray and keep it warm in the oven. ",
      "In a large mixing bowl, combine the flour, baking powder, salt and sugar. Whisk in the eggs, milk and butter and combine thoroughly. Mix in the smoked salmon and chives.",
      "Ladle the batter into each well of the waffle maker and close the lid. Cook the waffles for 5 minutes, then lift the lid and check the waffle – it should be golden-brown and crisp. Transfer to the wire rack in the oven and repeat the process with the remaining batter.",
      "For the pancetta, preheat the grill to high. Place the pancetta on a lined tray and grill for 6-7 minutes until crisp, turning once. ",
      "Serve the waffles with the pancetta, maple syrup and ice cream. "
    ],
    "url": "www_bbc_com_food_recipes_leftover_waffles_with_59419",
    "title": "Leftover waffles with pancetta, maple syrup and ice cream  recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 4Serves 4",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leftover_turkey_and_ham_95969": {
    "ingredients": [
      "400g/14oz plain flour, plus extra for dusting ",
      "pinch of salt",
      "65g/2¼oz chilled butter\t",
      "160g/5¾oz frozen butter\t",
      "45g/1½oz butter",
      "2 large leeks, washed and roughly sliced",
      "1 orange, juice and finely grated zest only",
      "50ml/2fl oz medium sherry",
      "3 tbsp plain flour",
      "500ml/18fl oz chicken stock (or 250ml/9fl oz leftover gravy and 250ml/9fl oz stock)",
      "1 heaped tsp wholegrain mustard",
      "600g/1lb 5oz leftover turkey meat, cut into bite-sized pieces",
      "250g/9oz cooked ham, cut into bite-sized pieces",
      "2 tbsp roughly chopped tarragon",
      "200ml/7fl oz single cream",
      "1 free-range egg, beaten for egg wash",
      "salt and white pepper "
    ],
    "method": [
      "For the pastry, mix the flour and salt together in a bowl. Rub in the chilled butter using your fingertips. Gradually add enough cold water to form a dough (about 150-180ml/5-6fl oz).",
      "Lightly dust the work surface with flour and roll the dough into a rectangle. Grate 60g/2¼oz of the frozen butter over the bottom two thirds of the dough. Fold down the top third and fold up the top third as if folding a letter. Turn by 90 degrees and roll out again. Repeat, adding the remaining frozen butter and fold as before. Rest in the fridge for 30 minutes before using. ",
      "For the filling, melt the butter in a large frying pan over a medium heat and add the leeks to the pan with the orange juice, zest and sherry. Cover and cook gently for 6 minutes, stirring occasionally until the leeks are just tender. Remove the lid and increase the heat, reduce the volume of liquid until you are left with a few spoonfuls of buttery liquid. Sprinkle the flour over the leeks and stir to mix evenly. Gradually stir in the stock and simmer for 5 minutes until the sauce has thickened slightly.  Add the mustard, turkey and ham and stir. Finally add the tarragon and cream. Season to taste with a little white pepper and salt.",
      "Preheat the oven to 200C/180C Fan/Gas 6.  ",
      "Pour the pie filling and sauce into a 1.2-1.5 litre/2-2½ pint pie dish dish and allow to cool. If you have a pie funnel, put it in the middle of the filling.",
      "Roll out the pastry on a lightly floured work surface to about 5mm thick. Cut a 2cm/¾in strip of pastry. Brush the rim of the pie dish with egg wash, then place the pastry strip onto the rim and brush it with more egg wash. ",
      "To make the pie lid, cut the remaining pastry a little larger than the dish and lift it into place (use the rolling pin to help you). Make a steam hole to expose the funnel (if using). Press the edges to seal then trim away any excess. Re-roll any trimmings and use them to make decorations. Brush the pastry with egg wash, arrange any decorations on top of the pie and brush these with egg too.",
      "Bake for 35-40 minutes until the pastry is risen and golden-brown. Allow to cool slightly before serving. "
    ],
    "url": "www_bbc_com_food_recipes_leftover_turkey_and_ham_95969",
    "title": "Leftover turkey and ham pie recipe - BBC Food",
    "time": {
      "preparation": "30 mins to 1 hour30 mins to 1 hour",
      "preparationMins": 60,
      "cooking": "1 to 2 hours1 to 2 hours",
      "cookingMins": 120,
      "totalMins": 180
    },
    "serves": "Serves 6Serves 6",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/leftover_turkey_and_ham_95969_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_leg_of_lamb_in_hay_with_43057": {
    "ingredients": [
      "1 x 2.7kg/5lb10oz leg of lamb",
      "1 small handful lavender, preferably freshly picked",
      "½ bag hay",
      "50g/2oz butter, softened, plus an extra knob for the broccoli ",
      "10 King Edward potatoes, peeled and cut into 2 or 3 pieces",
      "75g/2¾oz beef dripping or vegetable oil",
      "75ml/2¾fl oz malt vinegar",
      "25g/1oz caster sugar",
      "1 large bunch fresh mint leaves, finely chopped",
      "400g/14oz purple sprouting broccoli",
      "sea salt and freshly ground black pepper"
    ],
    "method": [
      "Preheat the oven to 180C/160C Fan/Gas 4. ",
      "Pierce the leg of lamb 10-12 times all over using the point of a sharp knife, then insert the lavender sprigs into the holes.",
      "Use the hay to stuff a large, deep-sided roasting tray, one that’s large enough for the whole leg of lamb. Sprinkle over the remaining lavender leaves.",
      "Place the leg of lamb onto the hay, then rub it all over with the softened butter, and season, to taste, with salt and freshly ground black pepper. Cover the roasting tray with aluminium foil.",
      "Roast the lamb in the oven for 2-3 hours (for tender meat with a trace of pink), or until cooked to your liking, then remove it from the oven and set aside to rest for at least 30 minutes.",
      "Meanwhile, bring the potatoes to the boil in a large pan of salted water and continue to boil for 2 minutes. Drain into a colander and shake them around to fluff up the edges.",
      "When the lamb has about an hour left to cook, scrape the beef dripping into a large roasting tray, add the potatoes and season with salt flakes. Add them to the oven and roast for 25-30 minutes, or until golden-brown and crisp on their undersides, then turn them to coat them in the fat and continue to roast for a further 20-30 minutes, or until golden-brown and crisp all over.",
      "Bring the vinegar and sugar to a simmer in a non-reactive saucepan, then remove the pan from the heat and stir in the chopped mint. Season with a pinch of salt. ",
      "Just before serving, cook the broccoli until just tender in a pan of salted, boiling water (about 2-3 minutes). Drain and season, to taste, with salt and freshly ground black pepper and a knob of butter.",
      "To serve, transfer the lamb to a serving platter and carve into slices. Serve with the roast potatoes and purple sprouting broccoli alongside, and drizzle over the mint sauce."
    ],
    "url": "www_bbc_com_food_recipes_leg_of_lamb_in_hay_with_43057",
    "title": "Leg of lamb in hay with lavender recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "over 2 hoursover 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "Serves 6-8Serves 6-8",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_legume_canaps_26578": {
    "ingredients": [
      "35g/1¼oz plain flour",
      "25g/1oz butter, cut into small pieces",
      "1 large free-range egg, beaten",
      "pinch sugar",
      "pinch salt",
      "5 sheets gelatine",
      "150g/5½oz tomato ketchup",
      "120g/4½oz smoked trout",
      "100g/3½oz unsalted butter, softened",
      "½ tbsp creamed horseradish",
      "40g/1½oz soured cream ",
      "handful fresh parsley, chopped",
      "handful fresh dill, chopped",
      "fresh lemon juice, to taste",
      "salt and freshly ground black pepper",
      "bunch fresh basil, to decorate ",
      "250g/9oz plain flour",
      "2 tsp smoked paprika",
      "¼ tsp sugar",
      "1 tsp salt",
      "125g/4½oz unsalted butter, cut into small pieces",
      "1 free-range egg",
      "1 free-range egg yolk",
      "pinch smoked paprika",
      "pinch ground turmeric",
      "drop orange food colouring",
      "1 x 400g/14oz can chickpeas",
      "50ml/2fl oz light tahini",
      "1 lemon, juice only",
      "2 garlic cloves, crushed",
      "1 tsp ground cumin",
      "handful fresh coriander, chopped",
      "salt and freshly ground black pepper",
      "pinch smoked paprika",
      "fresh dill, to garnish",
      "freshly ground black pepper",
      "few pinches grated nutmeg",
      "handful chives",
      "handful dill",
      "400g/14oz cauliflower",
      "100g/3½oz garlic and herb cream cheese",
      "1½ tsp salt",
      "½ tsp Dijon mustard",
      "300g/10½oz self-raising flour, plus extra for flouring",
      "½ tsp salt ",
      "½ tsp pepper",
      "100g/3½oz unsalted butter, cut into small pieces",
      "handful chives, finely chopped",
      "100g/3½oz Comté, grated (alternatively use Gruyère)",
      "150ml/5fl oz full-fat milk",
      "4 Little Gem lettuces ",
      "pinch grated nutmeg"
    ],
    "method": [
      "For the choux pastry 'tomatoes', preheat the oven to 190C/375F/Gas 5 and line a baking tray with non-stick baking parchment. Use a pastry cutter to mark 12 circles that are 3.5cm/1½in in diameter, with space between them of the same width. ",
      "Take a sheet of baking parchment and crease it in the middle then open out flat. Sift the flour into the centre of the crease and set aside. (This is to make it easy to add to the pan in the next step.)",
      "Put 60ml/2fl oz of cold water and the butter into a small saucepan and heat gently, stirring until the butter has melted. Slowly bring to the boil and then immediately remove the pan from the heat. Tip the sifted flour into the pan all in one go and beat vigorously with a wooden spoon until the mixture forms a ball of paste. Allow to cool slightly, then beat in the beaten egg to form a smooth glossy paste. ",
      "Place a piping bag fitted with a round nozzle into the neck of a tall glass and spoon the paste into it. Lightly spray the prepared baking tray with water and pipe evenly sized balls (3.5cm/1½in) onto the marked circles on the prepared baking parchment.",
      "Bake in the oven for approximately 10 minutes, or until the choux pastry is golden-brown, crisp and risen. Remove from the oven. Reduce the temperature to 160C/325F/Gas 3 and pierce the base of each bun with a cocktail stick. Return to the oven to dry out for a few minutes and then transfer to a wire rack to cool completely. ",
      "For the tomato glaze, soften the sheets of gelatine in a bowl of cold water for about five minutes. Measure the tomato ketchup into a small saucepan and, once the gelatine sheets have softened, squeeze off the excess water and add to the pan. ",
      "Stir over a low heat until a smooth mixture forms, then strain into a bowl through a fine sieve and set aside. ",
      "For the smoked trout pâté, place the smoked trout and butter in a food processor and blend until smooth. Add the creamed horseradish, soured cream and chopped herbs and blend again. Add the lemon juice and season to taste with salt and pepper. Spoon the pâté into a piping bag fitted with a small plain nozzle and fill each choux bun with the pâté by inserting the nozzle into the holes in the bases.  ",
      "Coat each choux bun with tomato glaze by carefully spooning it over the top. Place a small sprig of basil on top of each (to resemble a tomato leaf) and leave to set. ",
      "For the 'Chantenay carrots', place the flour, paprika, sugar and salt in a bowl. Using your fingertips, rub in the butter until the mixture resembles fine breadcrumbs. Make a well in the centre of the mixture, add the egg and bring the pastry together. Gradually add a tablespoon of cold water while working the pastry with your hands. ",
      "Transfer to a lightly floured work surface and gently knead to form a ball. Wrap in cling film and place in the fridge to rest for at least 45 minutes, or ideally 1-2 hours.",
      "For the glaze, beat together all the ingredients in a bowl.",
      "Preheat the oven to 190C/375F/Gas 5 and line a baking tray with non-stick baking parchment.",
      "Take the chilled pastry from the fridge, remove the cling film and divide the pastry into three. On to a lightly floured work surface, roll each piece into a circle, then divide each circle into four quarters. Carefully wrap each quarter around a pastry horn mould and brush with the prepared glaze. Use a fork to create a carrot texture over the pastry and place each 'carrot' on the lined baking tray. Bake for approximately eight minutes, or until lightly golden-brown and crisp. When cool enough to handle, remove the pastry horn moulds, brush with the glaze and set aside to cool completely.",
      "For the cumin and coriander hummus, drain and rinse the chickpeas. Place the tahini and lemon juice in a food processor and blend for one minute. Scrape down the sides and blend again for half a minute. Add the garlic and cumin and blend again. Add the drained chickpeas and blend again. Add the chopped coriander and blend once again. Season to taste with salt and pepper and transfer the mixture to a bowl. Chill in the fridge for 10-15 minutes. ",
      "To make the cauliflower purée, preheat the oven to 110C/225F/Gas ¼.",
      "Place some water in a large saucepan with a little black pepper, a pinch of grated nutmeg and the chives and dill. Steam the cauliflower over the flavoured water until cooked. Place the cooked cauliflower in a roasting tray and bake in the preheated oven until dry. Transfer to a bowl and set aside to cool. ",
      "For the cheese scones, preheat the oven to 190C/375F/Gas 5 and line a baking tray with non-stick baking parchment.",
      "Sift the flour, salt and pepper into a large bowl. Use your fingertips to rub in the butter until the mixture resembles fine breadcrumbs. Mix in the chopped chives and grated cheese. Gradually add the milk until the mixture comes together to form a dough. Turn out onto a lightly floured work surface and very gently knead to create a smooth, soft dough. Gently roll out the dough and cut into rounds with a 3.5cm/1½in round pastry cutter. ",
      "Place the scones on the prepared baking tray and bake for approximately 10 minutes, or until risen, lightly golden-brown and crisp. Remove from the oven and leave to cool. Once cool, cut the top off each scone.",
      "For the cauliflower purée, blend the cooked cauliflower using a stick blender or food processor. Add the garlic and herb cream cheese, salt, Dijon mustard and a pinch of grated nutmeg and black pepper. Spoon the purée into another piping bag fitted with a star nozzle and pipe a little of the mixture on the top of each scone.",
      "Remove some leaves from the Little Gem lettuces and, using a fluted pastry cutter, cut through the leaves to create circles which will represent the leaves of a cauliflower. Place a lettuce circle on top of each scone and press gently to help it stick to the purée. Pipe more purée on top of the lettuce (to resemble the florets of a cauliflower) and finish with a fine grating of nutmeg.",
      "Just before serving, spoon the hummus into a piping bag and pipe into the cooled pastry carrots. Sprinkle with the smoked paprika and arrange some fresh dill on top to look like carrot tops."
    ],
    "url": "www_bbc_com_food_recipes_legume_canaps_26578",
    "title": "Legume canapés recipe - BBC Food",
    "time": {
      "preparation": "over 2 hoursover 2 hours",
      "preparationMins": 120,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 180
    },
    "serves": "Serves 36 canapésServes 36 canapés",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemonadegranita_70981": {
    "ingredients": [
      "175g/6oz caster sugar",
      "6 lemons, juice and grated rind",
      "1 lemon grass stalk, roughly flattened with a rolling pin",
      "450ml/¾ pint soda water"
    ],
    "method": [
      "Place the sugar, lemon rind and juice, lemongrass stalk in a pan with 150ml/¼ pint water. ",
      "Heat gently, stirring until the sugar dissolves then simmer gently for five minutes then allow to cool. ",
      "Strain the liquid into a rigid container then stir in the soda water.",
      "Transfer to the freezer for at least two hours, whisking every 20 minutes to stop crystals forming.",
      "Serve in glasses."
    ],
    "url": "www_bbc_com_food_recipes_lemonadegranita_70981",
    "title": "Lemonade granita recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Makes 6Makes 6",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon-and-herb_stuffed_91538": {
    "ingredients": [
      "500g/1lb 2oz reserved lamb bones (see below)",
      "splash olive oil",
      "½ medium onion, peeled, cut into quarters",
      "2 celery sticks, trimmed, cut into short lengths",
      "1 medium carrot, peeled, cut into short lengths",
      "4 sprigs fresh thyme",
      "1 fresh bay leaf",
      "1 litre/1¾ pints cold water",
      "1 tsp fine sea salt",
      "1 heaped tbsp plain flour",
      "1 tbsp redcurrant jelly",
      "few sprigs fresh mint",
      "3 tbsp extra virgin olive oil",
      "75-100g/2½-3½oz slightly stale white bread, crusts removed, bread cut into 1cm cubes",
      "1 medium leek, washed, trimmed, finely sliced",
      "½ medium onion, peeled, finely sliced",
      "4 garlic cloves, peeled, crushed to a paste",
      "2 tbsp baby capers, drained",
      "1 small lemon (preferably unwaxed), finely grated zest only",
      "5 heaped tbsp chopped fresh mint",
      "3 heaped tbsp chopped fresh parsley",
      "1 tsp sea salt flakes",
      "freshly ground black pepper",
      "3 tbsp finely chopped fresh mint leaves, plus extra small whole mint leaves, to serve",
      "2 tsp caster sugar",
      "2 tbsp white wine vinegar",
      "splash extra virgin olive oil",
      "2kg/4lb 8oz bone-out lamb shoulder (ask your butcher for the bone), fat and sinew trimmed",
      "sea salt flakes",
      "freshly ground black pepper",
      "2 tsp extra virgin olive oil",
      "2 tbsp olive oil, plus extra for greasing",
      "1 large onion, peeled, finely sliced",
      "3-4 sprigs fresh thyme, plus extra to garnish",
      "3 garlic cloves, peeled, finely sliced",
      "1.2 kg/2lb 4oz floury potatoes, such as Maris Piper, peeled, thinly sliced to the thickness of a £1 coin",
      "400ml/14fl oz chicken or vegetable stock",
      "sea salt flakes",
      "freshly ground black pepper"
    ],
    "method": [
      "For the lamb jus, first make some lamb stock. Put the lamb bones into a large saucepan with a little oil and fry over a medium to high heat for 8-10 minutes, until lightly browned all over. Add the onion, celery, carrot, thyme and bay leaf to the pan.",
      "Pour over the water and bring the mixture to the boil. Reduce the heat until the stock is simmering, then continue to simmer for 45 minutes, skimming the foam from the surface of the liquid at regular intervals.",
      "Remove the stock from the heat and strain through a fine sieve into a clean jug or bowl; set aside to cool. Once cooled, spoon off any fat that has risen to the surface of the liquid.",
      "While the stock is simmering, make the stuffing. Heat two tbsp of the oil in a large non-stick frying pan over a low to medium heat. Add the bread cubes, in batches if necessary, and fry for 3-4 minutes, or until golden-brown. Transfer the fried bread cubes to a large mixing bowl.",
      "Add the remaining oil to the frying pan and add the leek, onion and garlic. Fry for 2-3 minutes, stirring regularly, until softened but not browned. Transfer the vegetables to the bowl containing the bread.",
      "Stir the capers, lemon zest, mint and parsley into the bread and vegetables until well combined, then season, to taste, with salt and freshly ground black pepper. Set aside to cool.",
      "For the mint sauce, mix the chopped mint leaves and sugar in a small bowl, then crush using the back of a spoon for 1-2 minutes to extract the flavour from the mint. Stir in the white wine vinegar and a dash of olive oil until well combined. Set aside.",
      "For the lamb, place the lamb onto a chopping bard, skin-side down. Cover the lamb with a large sheet of cling film, then flatten the meat into a large, neat rectangle shape, about 3cm/1½in in thickness, using a rolling pin or meat mallet. Season all over with salt and freshly ground black pepper.",
      "With the longest sides of the lamb rectangle facing you, spoon the stuffing mixture horizontally across the middle of the lamb rectangle (from one short side to the other). Wrap the two long sides of the lamb rectangle around the stuffing to fully enclose it. Truss the lamb securely at 3cm/1½in intervals in several places using cooking string. (Tie the two ends first, then the middle, then fill in the gaps. That way the stuffing doesn't get squeezed out.)",
      "Weigh the trussed lamb joint and make a note of the weight, then place the lamb into a roasting tin. (At this stage, the lamb can be chilled for several hours; remove from the fridge and bring back to room temperature before roasting.)",
      "For the boulangère potatoes, heat the oil in a large, non-stick frying pan over a medium heat. Add the onion and thyme sprigs and fry, stirring occasionally, for 8-10 minutes, until the onion has softened and browned slightly. Add the garlic and continue to fry for 2-3 minutes, then season, to taste, with salt and freshly ground black pepper.",
      "Grease a 20cm x 30cm/8in x 12in roasting tin or ovenproof dish with a little oil.",
      "Arrange a layer of potato slices to cover the base of the dish. Sprinkle over one-third of the fried onions. Continue layering the potato slices and onion mixture, ending with a layer of potatoes. ",
      "Pour over the stock until it just reaches the top layer of potatoes. Season again with freshly ground black pepper and garnish with a few sprigs of thyme.",
      "To cook the lamb and potatoes, preheat the oven to 200C/400F/Gas 6. Rub the trussed lamb joint all over with the oil and season well with salt and freshly ground black pepper. Roast the lamb in the centre of the oven, and the potatoes at the bottom of the oven. For the lamb, allow 20 minutes of cooking time per 500g/1lb 2oz of weight. (The full cooking time should be approximately 1hour 20minutes).",
      "When the lamb has cooked to your liking, remove from the oven and set aside on a chopping board. Cover with a piece of aluminium foil and a couple of clean tea towels to keep warm, then set aside to rest. Reserve the roasting tray.",
      "Meanwhile, continue cooking the potatoes at the top of the oven for a further 10-15 minutes, or until browned on top.",
      "To make the lamb jus, spoon as much fat as possible from the top of the juices left in the roasting tray, then place the tray over a medium heat and whisk the flour into the juices. Cook for 10-15 seconds.",
      "Gradually add 300ml/10½fl oz of the reserved lamb stock to the flour mixture, whisking after each addition until the mixture is smooth and well combined.",
      "Stir in the redcurrant jelly and the mint sprig and bring the mixture to a gentle simmer. Continue to simmer for 10 minutes, stirring occasionally, then season, to taste. Stir in any juices released from the resting meat, then strain the jus into a warmed jug.",
      "To serve, trim the ends off the roast lamb parcel, then remove the string. Carve the stuffed lamb shoulder into thick slices. Spoon a portion of boulangère potatoes into the centre of each of six warmed plates. Place a few slices of stuffed lamb alongside each and drizzle over the lamb jus and a little mint sauce. Garnish with a few small whole mint leaves."
    ],
    "url": "www_bbc_com_food_recipes_lemon-and-herb_stuffed_91538",
    "title": "Lemon-and-herb stuffed shoulder of lamb recipe - BBC Food",
    "time": {
      "preparation": "1-2 hours1-2 hours",
      "preparationMins": 120,
      "cooking": "1 to 2 hours1 to 2 hours",
      "cookingMins": 120,
      "totalMins": 240
    },
    "serves": "Serves 6Serves 6",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon-and-herb_stuffed_91538_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemonanddillmarinate_84941": {
    "ingredients": [
      "100g/3½oz salmon fillet, skin removed",
      "1 tsp caster sugar",
      "½ lemon, juice only",
      "small handful fresh dill, finely chopped",
      "drizzle olive oil",
      "small handful each fresh chives, parsley, basil, mint, chopped",
      "squeeze lemon juice",
      "1 tbsp extra virgin olive oil"
    ],
    "method": [
      "Put all the salmon ingredients into a bowl and stir to coat to salmon well. Cover with cling film and leave to  marinate for ten minutes. Slice thinly.",
      "To make the herb salad, put the herbs into a large bowl and squeeze over the lemon juice and olive oil. Mix until  the herbs are well coated.",
      "To serve, put the herb salad on a plate and top with the slices of marinated salmon."
    ],
    "url": "www_bbc_com_food_recipes_lemonanddillmarinate_84941",
    "title": "Lemon and dill-marinated salmon with herb salad recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "no cooking requiredno cooking required",
      "cookingMins": 0,
      "totalMins": 30
    },
    "serves": "Serves 1Serves 1",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemonandgarlicroaste_85530": {
    "ingredients": [
      "1 chicken breast",
      "1 garlic clove, chopped",
      "50g/1¾oz cheddar cheese, grated",
      "2 tsp fresh thyme leaves",
      "1 lemon, juice and zest only",
      "2 tbsp olive oil",
      "salt and freshly ground black pepper",
      "150g/5½oz butternut squash, peeled and chopped into 1cm/½in cubes",
      "2 smoked garlic cloves, peeled",
      "200ml/7fl oz milk",
      "salt and freshly ground black pepper ",
      "85g/3oz cheddar cheese, grated"
    ],
    "method": [
      "Preheat the oven to 180C/350F/Gas 4.",
      "For the lemon and garlic-roasted chicken, cut two slashes into the chicken breast. Tuck the garlic and cheese into the pocket under the mini-fillet, cutting to make it larger if necessary.",
      "Place the thyme leaves, lemon juice and zest and olive oil into a bowl, season with salt and freshly ground black pepper and mix well.",
      "Place the chicken into the bowl and leave to marinate for ten minutes.",
      "Heat a griddle pan and griddle the chicken for 3-4 minutes on each side. Transfer to a baking sheet and roast in the oven for 12-14 minutes, or until completely cooked through.",
      "Meanwhile, for the cheesy butternut mash, place the squash, garlic and milk into a large pan. Bring to the boil, reduce the heat and simmer for 10-12 minutes, or until the squash is tender. Mash with a potato masher, season well with salt and freshly ground black pepper and stir in the grated cheese. ",
      "To serve, place the mash onto a plate, top with the chicken and pour over the chicken cooking juices."
    ],
    "url": "www_bbc_com_food_recipes_lemonandgarlicroaste_85530",
    "title": "Lemon and garlic-roasted chicken with cheesy butternut mash recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 1Serves 1",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemonandlimepavlova_91318": {
    "ingredients": [
      "150g/5½oz caster sugar",
      "3 free-range egg whites, whisked in a clean bowl until stiff peaks form when the whisk is removed",
      "½ tsp sherry vinegar",
      "2 lemons, juice and zest",
      "3 limes, juice and zest",
      "175g/6oz caster sugar",
      "3 free-range eggs, plus 5 free-range egg yolks",
      "150g/5oz butter, softened",
      "200g/7oz double cream, whipped until soft peaks form when the whisk is removed ",
      "12 passion fruit, pulp only, to serve"
    ],
    "method": [
      "Preheat the oven to 180C/350F/Gas 4. Line a baking tray with greaseproof paper.",
      "For the meringue, whisk the sugar, a tablespoon at a time, into the stiffened egg whites, until the mixture is smooth and glossy.",
      "Gently fold in the sherry vinegar.",
      "Spoon the meringue mixture onto the prepared baking tray to form a circle about 20cm/8in in diameter. Spoon the remaining meringue in dollops around the edge of the meringue, forming swirls and peaks as you go. ",
      "Transfer the meringue to the oven and immediately reduce the temperature to 150C/300F/Gas 2. Bake for 45-50 minutes, or until the meringue has hardened on the outside, but is still soft and chewy in the middle. ",
      "Meanwhile, for the filling, place the lemon juice and zest, lime juice and zest, caster sugar, eggs, egg yolks and 75g/2¾oz of the butter into a heavy-based pan. Whisk over a medium heat until the sugar has dissolved and the mixture is smooth and thick enough to coat the back of a spoon. ",
      "Add the remaining butter, stirring continuously. Continue to stir until all of the butter has melted and the mixture has thickened considerably. ",
      "Remove the mixture from the heat and whisk a little, then set aside until completely cool.",
      "To serve, place the meringue into the centre of a serving platter. Spoon the lemon and lime filling mixture into the centre, then top with the whipped cream and passion fruit pulp."
    ],
    "url": "www_bbc_com_food_recipes_lemonandlimepavlova_91318",
    "title": "Lemon and lime pavlova recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Serves 4Serves 4",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemonandlimepavlova_91318_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemonandorangechines_79829": {
    "ingredients": [
      "1 tbsp oil",
      "knob fresh ginger, peeled and sliced",
      "170g/6oz beef, thinly sliced",
      "3 lemon leaves, shredded (or subsitute lime leaves)",
      "2 tsp sesame oil",
      "2 tsp sesame seeds",
      "2 tbsp lemon, zest only",
      "honey, to drizzle"
    ],
    "method": [
      "Heat the oil in a small wok over a high heat, until smoking, and add the ginger and beef. Stir fry for two minutes, to brown.",
      "Turn the heat down slightly, add the remaining ingredients and stir fry for a further two minutes before transferring to a bowl and serving."
    ],
    "url": "www_bbc_com_food_recipes_lemonandorangechines_79829",
    "title": "Lemon and orange Chinese-style beef recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "less than 10 minsless than 10 mins",
      "cookingMins": 10,
      "totalMins": 40
    },
    "serves": "Serves 1Serves 1",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemonandpolentacakew_83693": {
    "ingredients": [
      "1 tbsp olive oil",
      "2 lemons, thinly sliced",
      "450g/1lb butter",
      "450g/1lb caster sugar",
      "6 free-range eggs",
      "150g/5¼oz ground almonds",
      "500g/1lb 1½oz quick cook polenta",
      "2 lemons, zest and juice only",
      "150g/5¼oz mascarpone",
      "200ml/7¼fl oz double cream",
      "45ml/1½fl oz lemon vodka",
      "30g/1¼oz icing sugar",
      "½ lemon, juice only",
      "sprig of mint",
      "lemon zest"
    ],
    "method": [
      "Preheat the oven to 180C/350F/Gas 4.",
      "Line a 30cm/9in deep cake tin with baking parchment.",
      "Heat a frying pan until hot then add the oil and lemon slices.",
      "Fry for 1-2 minutes until just caramelised.",
      "Remove and place caramelised side down in a pattern on the baking parchment in the tin.",
      "Place the butter and sugar into a large bowl and whisk together until light and fluffy.",
      "Add the eggs one at a time, mixing well.",
      "Fold in the ground almonds, polenta, lemon juice and zest and stir to combine.",
      "Pour the mixture over the lemon slices and spread evenly into the tin.",
      "Place in the oven for 25-30 minutes until just risen and golden.",
      "Allow to cool before turning out onto a plate, lemon slices uppermost.",
      "To make the lemon cream, place the mascarpone into a bowl and beat to soften.",
      "Pour in the double cream, lemon vodka, icing sugar and lemon juice.",
      "Whisk until mixture forms soft peaks.",
      "Serve a wedge of cake with a dollop of cream, a sprig of mint and sprinkle of lemon zest."
    ],
    "url": "www_bbc_com_food_recipes_lemonandpolentacakew_83693",
    "title": "Lemon and polenta cake with lemon vodka cream recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Serves 8-10Serves 8-10",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemonandrosemarybulg_89458": {
    "ingredients": [
      "150g/5½oz bulgar wheat",
      "½ vegetable stock cube",
      "boiling water",
      "1 lemon, zest and juice",
      "2 tbsp chopped fresh rosemary",
      "2 tbsp olive oil",
      "3 spring onions, sliced",
      "handful mixed salad leaves, to garnish"
    ],
    "method": [
      "Place the bulgar wheat into a small pan and crumble the stock cube over it.",
      "Add boiling water to reach 1cm/½in above the bulgar wheat and stock. Cover with a lid and simmer over a medium heat for 12-15 minutes, or until the bulgar wheat is tender and has absorbed the water. ",
      "Fluff the wheat with a fork and add the remaining ingredients, mixing well until combined. ",
      "Press the bulgar wheat salad into a small heatproof bowl so that the wheat moulds to the bowl, and cover with a plate. ",
      "To serve, turn out the salad onto the serving plate and garnish with the mixed salad leaves."
    ],
    "url": "www_bbc_com_food_recipes_lemonandrosemarybulg_89458",
    "title": "Lemon and rosemary bulgar wheat salad recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 1Serves 1",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemonandrosemarymack_88380": {
    "ingredients": [
      "1 tbsp olive oil",
      "25g/1oz butter",
      "1 mackerel fillet, cut in half, skin scored with a sharp knife",
      "1 sprig fresh rosemary, chopped",
      "salt and freshly ground black pepper",
      "½ lemon, juice only",
      "100g/3½oz Kalamata olives, pits removed",
      "1 garlic clove, chopped",
      "2 tbsp olive oil",
      "fresh basil leaves, to garnish"
    ],
    "method": [
      "For the mackerel, heat the olive oil and butter in a frying pan. Add the mackerel and sprinkle with rosemary, salt and freshly ground black pepper. Fry for two minutes on each side, or until cooked through. Squeeze over the lemon juice and remove from the heat.",
      "For the dressing, place the olives, garlic and olive oil into a mini blender and process until smooth.",
      "To serve, place the mackerel onto a serving plate. Pour over the dressing and garnish with fresh basil leaves."
    ],
    "url": "www_bbc_com_food_recipes_lemonandrosemarymack_88380",
    "title": "Lemon and rosemary mackerel with olive dressing recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "less than 10 minsless than 10 mins",
      "cookingMins": 10,
      "totalMins": 40
    },
    "serves": "Serves 1Serves 1",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemonandthymechicken_70823": {
    "ingredients": [
      "150ml/5fl oz white wine ",
      "1 lemon, juice only",
      "4 boneless chicken breasts ",
      "plain flour, for dusting ",
      "120ml/4fl oz olive oil ",
      "2 small onions, finely sliced ",
      "1 lemon, zest and pith removed, thinly sliced, plus a few lemon slices to garnish ",
      "16 branches of fresh thyme, plus a few sprigs to garnish",
      "10 fresh sage leaves ",
      "salt ",
      "freshly ground black pepper",
      "1 clove of garlic",
      "1 red chilli, de-seeded and finely chopped",
      "200g/7oz green beans",
      "1 lemon, juice only"
    ],
    "method": [
      "In a small bowl, mix together the wine and lemon juice, then set aside. ",
      "Season the chicken breasts with salt and pepper and rub well in.",
      "Lightly dust them with some flour, shaking off any excess. With the palm of your hand, flatten the breasts slightly.",
      "Heat the olive oil in a large pan. Add the chicken and seal on both sides (some chicken breasts contain water and may spit while cooking. To prevent this, cover with a lid).",
      "Once they are well-sealed and golden brown, remove the chicken breasts from the pan and set aside. ",
      "Lower the heat, add the onions, season with salt and pepper and sweat until the onions are soft. ",
      "Add the lemon slices, thyme and sage leaves and mix well.",
      "Return the chicken to the pan, cover and cook over a gentle heat for three minutes. Raise the heat (but be careful not to burn the onions and lemon).",
      "Add the wine and lemon juice mixture, then cover and cook for 10-15 seconds, until the mixture is bubbling. ",
      "Remove the lid and simmer until the liquid has evaporated slightly. You will see the sauce thickening.",
      "Taste and adjust the seasoning if necessary. ",
      "Arrange the chicken breasts on a large plate or on individual serving plates and pour the sauce over.",
      "Garnish with lemon slices and sprigs of thyme.   \t",
      "To prepare the chilli beans, cook until tender, then drain and toss in the garlic, lemon juice and chopped chilli."
    ],
    "url": "www_bbc_com_food_recipes_lemonandthymechicken_70823",
    "title": "Lemon and thyme chicken with chilli beans recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 4Serves 4",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemonandthymesweetpo_85374": {
    "ingredients": [
      "1 tbsp olive oil",
      "1 sweet potato, peeled and sliced into 1cm/½in thick rounds",
      "3 tbsp water",
      "sprig fresh thyme, leaves only",
      "salt and freshly ground black pepper",
      "½ lemon, juice only",
      "lemon wedge, to serve"
    ],
    "method": [
      "Heat the oil in a small frying pan and gently fry the sweet potato slices, turning frequently, until lightly golden on both sides.",
      "Add the water and thyme leaves and season with salt and freshly ground black pepper. Cover and simmer for 6-8 minutes, or until tender. Squeeze in the lemon juice and stir.",
      "To serve, place the sweet potato fondant onto a plate and garnish with a lemon wedge."
    ],
    "url": "www_bbc_com_food_recipes_lemonandthymesweetpo_85374",
    "title": "Lemon and thyme sweet potato fondant recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 2Serves 2",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemoncheesecake_65665": {
    "ingredients": [
      "10 digestive biscuits",
      "75g/3oz butter, melted",
      "1 tbsp clear honey",
      "700g/1½ lb mascarpone cheese",
      "2 lemon, juice and zest",
      "200g/7oz caster sugar, plus more to taste",
      "4 tbsp icing sugar",
      "mint, to garnish",
      "450g frozen summer fruits, defrosted",
      "icing sugar, to taste"
    ],
    "method": [
      "Brush the bottom of a 23cm/9in springform cake tin with some of the melted butter and place a round of greaseproof paper in the base. ",
      "Crush the biscuits and tip them into a bowl, add the melted butter and honey and stir until well combined.",
      "Tip the mixture into the bottom of the cake tin. Using the back of a spoon, gently push the crumbs from the centre outward, until smooth and level. This will form the base of the cheesecake.  Chill in the fridge while making the filling.",
      "For the filling, mix the mascarpone cheese, lemon juice and zest and caster sugar together in a bowl until well combined. Do not mix the mixture too much as this will cause it to split. Taste the mixture and add more sugar, to taste.",
      "Spoon the mixture into the tin on top of the chilled biscuit mixture and chill in the fridge for at least 2 hours. ",
      "When ready to serve, either run a hot cloth or blowtorch round the outside of the tin and ease out the cheesecake. ",
      "For the sauce, blend most of the fruits with some icing sugar (to taste) in a food processor until smooth. Pass the sauce through a sieve.",
      "Place the cheesecake onto a plate, decorate the top with the sprigs of fresh mint and spoon the sauce around the side. Decorate with the remaining berries."
    ],
    "url": "www_bbc_com_food_recipes_lemoncheesecake_65665",
    "title": "Lemon no bake cheesecake recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "no cooking requiredno cooking required",
      "cookingMins": 0,
      "totalMins": 30
    },
    "serves": "Serves 8-10Serves 8-10",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemoncheesecake_65665_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemonchickencasserol_90144": {
    "ingredients": [
      "2 tbsp honey",
      "1 lemon, zest and juice only, plus 1 lemon, sliced into thin rounds",
      "2kg/4lb 4oz free-range chicken, cut into 8 pieces",
      "salt and freshly ground black pepper",
      "125g/5oz butter",
      "1 tbsp olive oil",
      "4 garlic cloves, left whole, lightly crushed",
      "500ml/17fl oz hot chicken stock",
      "2 sprigs fresh thyme",
      "250g/9oz baby leaf spinach"
    ],
    "method": [
      "Preheat the oven to 200/400F/Gas 6.",
      "Place the honey, lemon zest and lemon juice into a bowl and whisk until well combined. Add the chicken pieces and turn until they are completely coated in the mixture. Season well with salt and freshly ground black pepper and set aside for at least 10 minutes to marinate.",
      "Heat 40g/1½oz of the butter and half of the olive oil in a pan over a medium heat. When the butter is foaming, add half of the marinated chicken pieces and fry for 5-6 minutes, turning occasionally, until golden-brown. Set the chicken pieces aside on a warm plate.",
      "Repeat the process with another 40g/1½oz of butter, the remaining oil and the remaining chicken pieces. When the chicken pieces are golden-brown, set them aside.",
      "Add the garlic cloves, lemon slices and residual marinade juices to the pan and stir well, scraping any burned bits off the bottom of the pan with a wooden spoon.",
      "Return the cooked chicken pieces to the pan, then add the hot chicken stock and the thyme sprigs and stir well. Bring the mixture to the boil, then place into the oven to cook for 30-35 minutes, or until the chicken is tender and cooked through. Remove the chicken pieces from the pan and set aside on a warm plate.",
      "Continue to simmer the lemon sauce over a high heat for a further 5-10 minutes, or until the liquid has reduced to the consistency of thin syrup.",
      "Strain the sauce through a fine sieve, pressing the garlic pulp through the sieve using the back of a wooden spoon. Season the sieved liquid, to taste, with salt and freshly ground black pepper and set aside.",
      "Heat the remaining butter in a frying pan over a medium heat. When the butter is foaming, add the spinach and fry, stirring regularly, for 3-4 minutes, or until just wilted.",
      "To serve, place a portion of the wilted spinach into the centre of each plate. Place two pieces of chicken on top of each portion of spinach. Spoon over the lemon sauce and serve immediately."
    ],
    "url": "www_bbc_com_food_recipes_lemonchickencasserol_90144",
    "title": "Lemon chicken casserole recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Serves 4Serves 4",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemonchickenstuffedw_88628": {
    "ingredients": [
      "1 chicken breast, cut into three pieces",
      "5 sun-dried tomatoes, chopped",
      "75g/2¾oz Stilton with apricots, crumbled",
      "salt and freshly ground black pepper",
      "1 tbsp olive oil",
      "1 lemon, juice and zest only",
      "100g/3½oz spinach leaves, finely sliced",
      "½ lemon, juice only",
      "2 tbsp olive oil",
      "salt and freshly ground black pepper",
      "1 tbsp olive oil",
      "½ onion, finely chopped",
      "2 garlic cloves, finely chopped ",
      "1 orange pepper, cut into strips",
      "½ tsp chilli flakes",
      "1 tbsp caster sugar",
      "1 tbsp white wine vinegar",
      "1 orange, juice only",
      "1 lemon, halved"
    ],
    "method": [
      "Preheat the oven to 180C/350F/Gas 4.",
      "For the stuffed lemon chicken, lay out the three pieces of chicken breast on a sheet of cling film. Cover with another sheet of cling film and flatten the chicken with a rolling pin or meat mallet.",
      "Remove the cling film. Pile the chopped tomatoes and cheese into the centre of each chicken piece. Season with salt and freshly ground black pepper, then roll up the chicken around the stuffing, securing with a cocktail stick. ",
      "Heat the oil in an ovenproof frying pan and sear the stuffed chicken on all sides until golden-brown, about 3-4 minutes. Sprinkle over the lemon zest and squeeze over the juice. Transfer to the oven and roast for about 10-12 minutes, or until completely cooked through.",
      "For the citrus spinach, place the spinach into a bowl with the lemon juice, oil, salt and freshly ground black pepper and stir well.",
      "For the pepper sauce, heat the oil in a pan and gently fry the onion, garlic and orange pepper for 4-5 minutes.",
      "Add the chilli flakes, sugar, white wine vinegar and orange juice and simmer for 6-7 minutes, or until the sauce is reduced and sticky and the peppers are soft.",
      "To serve, heat a frying pan until hot and place the lemon halves, cut-side down, in the pan. Leave for 4-5 minutes, until charred.",
      "Place a bed of citrus spinach on a serving plate and top with the stuffed chicken (remove the cocktail sticks). Arrange the chargrilled lemon halves to one side and the pepper sauce in a small bowl on the other side."
    ],
    "url": "www_bbc_com_food_recipes_lemonchickenstuffedw_88628",
    "title": "Lemon chicken stuffed with sun-dried tomatoes and apricot cheese recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 1Serves 1",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemonchickenwithsqua_82107": {
    "ingredients": [
      "1 chicken breast, skinned and flattened with a meat mallet",
      "2 tsp plain flour, seasoned with salt and freshly ground black pepper",
      "1 tbsp butter, melted",
      "½ lemon ",
      "1 tbsp chopped fresh parsley, to serve",
      "lemon wedges, to serve",
      "½ butternut squash, peeled and chopped",
      "50ml/2fl oz double cream",
      "salt and freshly ground black pepper",
      "1 tbsp butter",
      "1 tbsp olive oil",
      "3 spring onions, finely chopped",
      "125g/4½oz curly kale, chopped",
      "3 tbsp white wine",
      "1 tsp dried chilli flakes",
      "salt and freshly ground black pepper"
    ],
    "method": [
      "To make the lemon chicken, roll the chicken in the seasoned flour. ",
      "Melt the butter in a frying pan, add the floured chicken, squeeze over half the juice from the lemon and cook for 2-3 minutes. ",
      "Turn over, squeeze over the rest of the lemon and cook for 2-3 minutes or until the chicken is cooked through. Remove from the pan and keep warm.",
      "To make the butternut squash mash, boil the squash in salted water until soft. ",
      "Drain and blend in a food processor with the double cream, salt and freshly ground black pepper. ",
      "Melt the butter in a frying pan, add the blended butternut squash and sauté for 1-2 minutes.",
      "To make the spicy curly kale, heat the olive oil in a sauté pan and add the spring onions. ",
      "Cook gently until softened slightly, add the curly kale and cook for another minute, stirring frequently. ",
      "Add the white wine, chilli flakes, salt and freshly ground black pepper and leave to cook for 5 minutes or until all the liquid has been absorbed.",
      "To serve, place a pile of butternut squash mash onto a large plate, top with the lemon chicken and spoon the spicy curly kale onto the side. Sprinkle with chopped parsley and serve with wedges of lemon."
    ],
    "url": "www_bbc_com_food_recipes_lemonchickenwithsqua_82107",
    "title": "Lemon chicken with squash mash and spicy stir-fried curly kale recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 1Serves 1",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemonchicken_11654": {
    "ingredients": [
      "450g/1lb chicken breasts, no skin or bone - cut into strips",
      "1 egg white",
      "2 tsp cornflour",
      "good pinch salt",
      "sesame oil",
      "250ml/8fl oz groundnut oil",
      "3 lemons, juice and zest",
      "85ml/2fl oz chicken stock",
      "1 tbsp sugar",
      "1 tbsp light soy sauce",
      "splash of dry sherry (optional)",
      "1 clove garlic, crushed",
      "1 red chilli, finely chopped",
      "1 tsp cornflour mixed with 1 tbsp water",
      "small bunch spring onions, shredded",
      "salt and pepper, to taste"
    ],
    "method": [
      "Combine the egg white, cornflour, salt, a little sesame oil and chicken in a bowl - stir to make sure the chicken is well coated.  Leave for about 20 minutes.",
      "Heat a wok until very hot, add some groundnut oil and heat until smoking.  Remove from the heat and add the chicken - stir quickly to stop it from sticking and cook until the chicken turns white.  Drain the chicken over a heatproof bowl, set the chicken to one side, allow the oil to cool and discard.",
      "Wipe the wok clean and make the sauce. Add the stock, lemon juice and zest, sugar, soy and dry sherry together with the garlic and chilli. Bring to the boil and whisk in the cornflour or arrowroot mixture. Simmer gently for a few moments and then add the chicken. Stir fry to make sure the chicken is well coated and heated through properly.  ",
      "Add a little sesame oil as final seasoning and serve scattered with spring onions."
    ],
    "url": "www_bbc_com_food_recipes_lemonchicken_11654",
    "title": "Chinese lemon chicken recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 4Serves 4",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemonchicken_11654_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemonchicken_89043": {
    "ingredients": [
      "2 chicken breasts, skin removed, cut into strips",
      "3-4 tbsp cornflour, seasoned with salt and freshly ground black pepper",
      "1 tbsp vegetable oil",
      "small bunch spring onions, cut into 2cm/1in pieces ",
      "1 clove garlic, finely sliced",
      "25g/1oz fresh root ginger, finely sliced",
      "1 lemon, juice and finely sliced rind only",
      "1 tbsp light soy sauce",
      "85ml/3fl oz chicken stock",
      "dash dry sherry",
      "freshly ground black pepper"
    ],
    "method": [
      "Roll the chicken strips in the seasoned cornflour and shake off the excess.",
      "Heat the vegetable oil in a frying pan, add the chicken and fry until the chicken is beginning to turn golden-brown. Add the spring onions, garlic, ginger and sliced lemon rind.   ",
      "Squeeze the juice of half a lemon into the pan. Add the soy sauce and chicken stock and a dash of dry sherry. Stir and leave to simmer for 5-6 minutes, or until the chicken is cooked through. Season with freshly ground black pepper. Stir well and serve."
    ],
    "url": "www_bbc_com_food_recipes_lemonchicken_89043",
    "title": "Easy lemon chicken recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 2Serves 2",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemonchicken_91444": {
    "ingredients": [
      "150ml/5½fl oz chicken stock",
      "2 lemons, zest and juice",
      "1 tbsp dry sherry",
      "1 garlic clove, left whole",
      "4 x 150g/5½oz chicken breasts, skin removed",
      "250ml/9fl oz chicken stock",
      "4 tbsp caster sugar",
      "4 lemons, zest and juice",
      "1 tbsp cornflour, mixed to a paste with a little water",
      "salt and freshly ground black pepper",
      "75g/2¾oz butter",
      "200g/7oz ready-made egg-fried rice ",
      "4 spring onions, trimmed, finely chopped"
    ],
    "method": [
      "For the chicken, mix together the chicken stock, lemon zest and juice, sherry and garlic clove in a large casserole. Bring to the boil, then reduce the heat until the mixture is just simmering.",
      "Add the chicken breasts and cover the casserole with a lid. Cook for 20-25 minutes, or until cooked through. Set aside to cool slightly. ",
      "For the lemon sauce, bring the chicken stock, sugar and lemon zest and juice to the boil in a pan, then continue to cook for 4-5 minutes.",
      "Whisk in the cornflour paste until the mixture is smooth. Season, to taste, with salt and freshly ground black pepper.",
      "Heat the butter in a frying pan over a medium heat. Add the cooled chicken breasts and fry for 2-3 minutes on each side, or until golden-brown on both sides. ",
      "To serve, place one chicken breast onto each of four serving plates. Pour over the lemon sauce. Spoon a portion of egg-fried rice alongside. Sprinkle over a little spring onion."
    ],
    "url": "www_bbc_com_food_recipes_lemonchicken_91444",
    "title": "Lemon chicken recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Serves 4Serves 4",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemoncurdandchampagn_81036": {
    "ingredients": [
      "8 ginger biscuits",
      "100ml/3½fl oz champagne or sparkling wine",
      "284ml/10fl oz double cream",
      "4 tbsp icing sugar",
      "8 tbsp lemon curd",
      "2 tbsp flaked almonds, toasted",
      "fresh strawberries"
    ],
    "method": [
      "Crumble the biscuits into the bottom of a glass dish and moisten with half of the champagne or sparkling wine.",
      "Begin whipping the cream with the sugar and when it reaches soft peaks, fold in the remaining champagne and swirl in the lemon curd, leaving a marbling of yellow through the cream.",
      "Spoon the mixture into the glass dish and scatter with the toasted almonds and strawberries."
    ],
    "url": "www_bbc_com_food_recipes_lemoncurdandchampagn_81036",
    "title": "Lemon curd and champagne syllabub recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "no cooking requiredno cooking required",
      "cookingMins": 0,
      "totalMins": 30
    },
    "serves": "Serves 4Serves 4",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemoncurdmeringuetar_90798": {
    "ingredients": [
      "300g/10oz sweet shortcrust pastry",
      "plain flour, for dusting ",
      "4 lemons, zest and juice only",
      "4 free-range eggs, beaten",
      "350g/12oz caster sugar",
      "110g/4oz butter",
      "2 free-range egg whites, whisked until soft peaks form when the whisk is removed",
      "150g/5oz caster sugar",
      "50ml/2fl oz crème de mure",
      "75g/3oz caster sugar",
      "250g/9oz blackberries",
      "4 sprigs fresh mint, to serve"
    ],
    "method": [
      "Preheat the oven to 200C/400F/Gas 6.",
      "For the lemon curd tarts, on a lightly floured work surface, roll out the pastry to a 0.5cm/¼in thickness. Cut out four 12cm/5in discs from the pastry and line each of four 10cm/4in shallow tart cases with one of the pastry discs. Chill in the fridge for 30 minutes.",
      "Meanwhile, in a bowl, beat together the lemon zest and juice, eggs and caster sugar until well combined. ",
      "Transfer the mixture to a saucepan and bring to a simmer over a medium heat, then add the butter and whisk until well combined.",
      "Continue to simmer for 4-5 minutes, stirring constantly, until the mixture has thickened, then pass the mixture through a fine sieve into a clean bowl. Set the sieved lemon curd mixture aside to cool.",
      "When the tart cases have chilled, line each with a disc of greaseproof paper or aluminium foil and fill with rice or baking beans. Place the four tart cases onto a baking tray and bake in the oven for 12-15 minutes.",
      "Remove the greaseproof paper and baking beans and return the tart cases to the oven for a further 4-5 minutes. Remove from the oven and set aside to cool slightly.",
      "When the tart cases have cooled, divide the lemon curd mixture equally among the pastry cases.",
      "For the meringue topping, sprinkle the caster sugar onto a baking tray and bake in the oven for 4-5 minutes, or until the sugar is hot but has not melted.",
      "In a large bowl, gradually add the hot sugar, a third at a time, to the whisked egg whites, whisking constantly, until stiff peaks form when the whisk is removed and the mixture is glossy.",
      "Spoon the whisked egg mixture into a piping bag.",
      "Starting from the middle and working outwards, pipe spirals of the meringue mixture onto all four tarts until it covers the lemon curd.",
      "Using a mini blow torch, heat the meringue until pale golden-brown. (Alternatively, preheat the grill to its highest setting and heat the meringue for 2-3 minutes, or until pale golden-brown.)",
      "For the blackberry compote, in a pan, bring the caster sugar and crème de mure to a simmer.",
      "Continue to simmer for 1-2 minutes, then add the blackberries and simmer for a further 2-3 minutes, or until the blackberries are tender and the mixture has just thickened.",
      "To serve, place a tart onto each of four serving plates. Spoon a little blackberry compote alongside each tart. Garnish each with a sprig of mint."
    ],
    "url": "www_bbc_com_food_recipes_lemoncurdmeringuetar_90798",
    "title": "Lemon curd meringue tart with blackberry compôte recipe - BBC Food",
    "time": {
      "preparation": "30 mins to 1 hour30 mins to 1 hour",
      "preparationMins": 60,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 120
    },
    "serves": "Serves 4Serves 4",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemoncurdpancakes_67267": {
    "ingredients": [
      "4 tbsp ricotta",
      "4 tbsp lemon curd",
      "caster sugar, to dust",
      "knob of butter",
      "4 crêpes"
    ],
    "method": [
      "Preheat the grill to a medium setting.",
      "Place 1 tablespoon of ricotta cheese and 1 tablespoon of lemon curd in the center of each of four crêpes.",
      "Fold up to make triangular packets open at the top.",
      "Place these in an ovenproof dish and spinkle on a little caster sugar. Dot with butter and cook under a medium grill, until the butter melts and the sugar crisps. Serve at once."
    ],
    "url": "www_bbc_com_food_recipes_lemoncurdpancakes_67267",
    "title": "Lemon curd pancakes recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "less than 10 minsless than 10 mins",
      "cookingMins": 10,
      "totalMins": 40
    },
    "serves": "Makes 4Makes 4",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemoncurdtart_67268": {
    "ingredients": [
      "1 packet ready-rolled puff pastry",
      "egg wash",
      "lemon curd"
    ],
    "method": [
      "Preheat the oven to 200C/400F/Gas 6.",
      "Take a packet of ready rolled puff pastry and cut in half (reserve the other half for another recipe). Using one half score a line about 2.5cm/1in inside the edge all round the pastry. ",
      "Using a fork prick the pastry inside the line all over.",
      "Brush the pastry outside the line with egg wash and then bake the pie case in the hot oven  for 15-20 minutes until well coloured.",
      "Allow to cool, then spread over the lemon curd."
    ],
    "url": "www_bbc_com_food_recipes_lemoncurdtart_67268",
    "title": "Lemon curd tart recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 6Serves 6",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemondrizzlecake_91004": {
    "ingredients": [
      "4 lemons, juice only",
      "75g/2¾oz caster sugar",
      "200g/7oz caster sugar",
      "200g/7oz unsalted butter, plus extra for greasing",
      "2 lemons, zest only",
      "3 free-range eggs, beaten",
      "200g/7oz self-raising flour, plus extra for dusting",
      "2 free-range egg yolks",
      "75g/2¾oz caster sugar",
      "50g/1¾oz unsalted butter",
      "2 lemons, juice and zest ",
      "100g/3½oz mascarpone"
    ],
    "method": [
      "Preheat the oven to 180C/350F/Gas 4. Grease a 20cm/8in springform cake tin with butter, then add a small amount of flour, turn the cake tin to coat the sides and bottom and shake out any excess.",
      "For the lemon drizzle, in a bowl, mix together the lemon juice and sugar until the mixture is well combined and the sugar has melted. Set aside.",
      "For the sponge, beat the sugar, butter and lemon zest in a mixing bowl until pale and fluffy, using an electric whisk. ",
      "Gradually add the eggs, whisking after each addition until the egg is completely incorporated into the mixture before adding the next. Carefully fold in the flour using a metal spoon.",
      "Pour the cake batter into the prepared cake tin and bake in the oven for 30-40 minutes, or until the sponge has risen and is cooked through. (The sponge is cooked through when a skewer inserted into the centre of the cake comes out clean.) ",
      "As soon as the cake is cooked, remove it from the springform cake tin and prick the top all over with a cocktail stick. Pour over the lemon drizzle mixture to soak the sponge, then set aside to cool on a wire rack.",
      "For the filling, whisk the egg yolks and sugar together in a pan over a low to medium heat until the sugar has melted. ",
      "Add the butter, lemon juice and zest, and continue to cook, whisking continuously, for 4-5 minutes, or until the mixture has thickened and is smooth and well combined. Set aside to cool completely. ",
      "Using a metal spoon, carefully fold the mascarpone into the cooled lemon curd mixture to create a marbled effect. ",
      "When the sponge has cooled, cut the cake in half horizontally to create two thinner cakes. Spread the lemon filling all over the lower half of the cake, then place the top half (the half that was pricked and soaked in the lemon drizzle) on top."
    ],
    "url": "www_bbc_com_food_recipes_lemondrizzlecake_91004",
    "title": "Lemon cake recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Serves 8-12Serves 8-12",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemondrizzlecake_91004_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemondrizzlemuffins_10460": {
    "ingredients": [
      "2 eggs, beaten",
      "85g/3oz caster sugar",
      "240ml/8fl oz milk",
      "100ml/3½fl oz vegetable oil",
      "300g/10oz plain flour",
      "3 tsp baking powder",
      "½ tsp salt",
      "4 lemons, zest only",
      "50g/2oz icing sugar",
      "1 lemon, juice only",
      "sprigs lemon thyme, to garnish (optional)"
    ],
    "method": [
      "Preheat the oven to 200C/180C Fan/Gas 6. Line a muffin tin with paper cases. Mix the egg, sugar, milk and oil in a large bowl. Sift in the flour, baking powder, salt and then add the lemon. Roughly mix.",
      "Spoon the mixture into the pre-prepared muffin cases.",
      "Bake for 30-35 minutes until well risen and golden. Cool on a wire rack.",
      "Make the lemon drizzle topping by mixing together the sugar and lemon juice.",
      "Spoon the lemon drizzle mixture over the cooled muffins. If desired, decorate the muffins with sprigs of lemon thyme."
    ],
    "url": "www_bbc_com_food_recipes_lemondrizzlemuffins_10460",
    "title": "Lemon drizzle cupcakes recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Makes 8-10 cupcakesMakes 8-10 cupcakes",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemondrizzlemuffins_10460_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemongrassparfaitwit_92905": {
    "ingredients": [
      "450ml/16fl oz double cream",
      "3 lemongrass stalks, cut lengthways, crushed lightly",
      "3 free-range eggs, separated",
      "150g/5oz caster sugar",
      "200g/7oz caster sugar",
      "50ml/2fl oz runny honey",
      "1 tbsp liquid glucose",
      "50ml/2fl oz water",
      "¾ tsp bicarbonate of soda",
      "vegetable oil, for greasing",
      "6 apple bananas, peeled and split lengthways (you can substitute with small unripe bananas)",
      "50g/2oz butter",
      "75g/3oz light soft brown sugar",
      "1 lemongrass stalk, cut lengthways, crushed lightly",
      "150ml/5fl oz double cream"
    ],
    "method": [
      "For the lemongrass parfait, place 150ml/5fl oz of the double cream into a small saucepan with the lemongrass and bring to a simmer. Set aside to infuse for at least one hour. Once infused, blend the mixture in a food processor to a fine purée. Pass the mixture through a fine sieve and chill in the fridge until cold.",
      "Meanwhile, bring a little water to the boil in a pan, then reduce the heat until the water is simmering. Suspend a heatproof bowl over the water (do not allow the base of the bowl to touch the water). Whisk the egg yolks and 75g/3oz of the sugar together in the bowl until pale and fluffy.",
      "Continue cooking, whisking continuously, for 5-6 minutes, or until the mixture thickens. ",
      "Remove the egg and sugar mixture from the heat and whisk in the cold lemongrass mixture. Whisk until the mixture has cooked and is pale and fluffy. Chill in the fridge for 1-2 hours until cold.",
      "Whisk the egg whites in a bowl, until soft peaks form when the whisk is removed. Slowly whisk in the remaining sugar until the egg whites are glossy.",
      "Fold the meringue mixture into the lemongrass mixture.",
      "Whisk the remaining 300ml/10½oz of double cream in a bowl until stiff peaks form when the whisk is removed. Fold into the lemongrass mixture.",
      "Place six small chefs' rings onto a baking tray lined with greasproof paper and pour the lemongrass mixture into the rings. Tap the side of the rings gently to remove any air, then chill in the freezer for two hours, or until just solid.",
      "For the honeycomb, place the sugar, honey, liquid glucose and water into a saucepan and bring to the boil. Continue to cook until the temperature reaches 160C (use a sugar thermometer to check this), remove from the heat and whisk in the bicarbonate of soda. ",
      "Pour the mixture onto a baking tray lined with greasproof paper. Set aside until the mixture becomes hard, then break into very small pieces using a toffee hammer.",
      "For the toffee apple bananas, heat a frying pan until hot. Add the bananas, cut-side down, and fry for 1-2 minutes, or until caramelised. Remove from the pan and set aside. Add the butter to the pan and heat until the butter foams, then add the brown sugar and cook until the mixture is a caramel colour.",
      "Add the lemongrass and the cream, bring to the boil, then reduce the heat until the mixture is simmering and simmer for 2-3 minutes, or until golden-brown. Return the bananas to the pan and heat through. discard the lemongrass.",
      "To serve, dip the top and bottom of each parfait into the honeycomb pieces.",
      "Using a warm cloth or a chefs' blowtorch, heat the sides of each chefs' ring to loosen the parfait and turn them out onto the centre of six serving plates. Place a couple of pieces of banana on the side of each parfait then spoon the lemongrass toffee sauce over the top."
    ],
    "url": "www_bbc_com_food_recipes_lemongrassparfaitwit_92905",
    "title": "Lemongrass parfait with honeycomb and lemongrass toffee apple bananas recipe - BBC Food",
    "time": {
      "preparation": "overnightovernight",
      "preparationMins": 720,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 780
    },
    "serves": "Serves 6Serves 6",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemongrass_and_coconut_49054": {
    "ingredients": [
      "600ml/20fl oz double cream",
      "2 lemongrass stems, chopped",
      "75g/3oz caster sugar",
      "3 leaves gelatine, soaked in water",
      "50ml/2fl oz coconut milk ",
      "75ml/3fl oz coconut liqueur",
      "1 mango, peeled and roughly chopped",
      "3 eggs, whites only",
      "150g/5oz caster sugar",
      "25g/1oz desiccated coconut, toasted "
    ],
    "method": [
      "For the panna cotta, heat 400ml/14fl oz of the cream with the lemongrass and sugar in a saucepan.",
      "Bring to a boil, stirring occasionally until all the sugar has dissolved, then reduce the heat and simmer until the volume of the liquid has reduced by half.",
      "Remove from the heat and allow to cool. Once cooled, pour the lemongrass cream through a fine sieve into a bowl.",
      "Heat the coconut milk in a separate saucepan until just simmering, then remove from the heat.",
      "Drain the gelatine leaves and add to the warm coconut milk. Stir until dissolved then pour through a sieve into the lemongrass cream. Allow to cool.",
      "Whisk the remaining cream and coconut liqueur in a bowl  until soft peaks are formed when the whisk is removed. Fold into the cooled cream until totally incorporated and pour into four ramekins or moulds. Set asid in the fridge for at least two hours until set.",
      "Meanwhile, blend the mango pieces to a fine purée in a small blender. Pass the mango purée through a sieve into a bowl. Set aside until serving.",
      "For the coconut meringue, preheat the oven to 100C/200F/Gas ¼. ",
      "Place the egg whites into a clean glass bowl and whisk until soft peaks form when the whisk is removed.",
      "Whisk in the caster sugar a spoonful at a time until the mixture is glossy and stiff peaks form when the whisk is removed.",
      "Line a baking tray with parchment paper, or use a silicone mat, and place eight spoonfuls of meringue mixture onto it. Scatter the toasted coconut over the top.",
      "Bake in the oven and for 1 ½ hours.",
      "Remove the meringues from the oven and set aside to completely cool.",
      "To serve, dip the panna cotta into a bowl of hot water briefly or slide a knife around the outside edge carefully. Spoon the mango purée onto the plate. Turn the panna cotta out onto the purée and set the meringue alongside."
    ],
    "url": "www_bbc_com_food_recipes_lemongrass_and_coconut_49054",
    "title": "Lemongrass and coconut panna cotta with coconut meringue and mango recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "over 2 hoursover 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "Serves 4Serves 4",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemongrass_and_ginger_63752": {
    "ingredients": [
      "50g/1¾oz unsalted butter",
      "2 shallots, finely chopped",
      "2 lemongrass stalks, tough outer leaves discarded, soft core finely chopped",
      "2 garlic cloves, finely chopped",
      "10cm/4in piece fresh root ginger, peeled, finely chopped",
      "1-2 red chillies (depending on their heat), finely sliced",
      "200ml/7oz white wine",
      "330ml/11fl oz coconut water",
      "160ml/5½fl oz coconut cream",
      "2kg/4lb 8oz mussels, rinsed, scrubbed, beards removed (discard any mussels that do not close tightly when tapped firmly)",
      "2 tbsp olive oil",
      "1 loaf sourdough bread, thickly sliced",
      "2 tbsp roughly chopped fresh coriander leaves",
      "salt and freshly ground black pepper"
    ],
    "method": [
      "Melt the butter in a heavy-based, lidded pan over a medium heat. Add the shallots, lemongrass, garlic, ginger and chilli(es) and fry for 4-5 minutes, or until softened but not coloured.",
      "Increase the heat to high, then pour in the wine, coconut water and coconut cream and bring to the boil. Add the mussels and cover the pan with the lid. Cook for 4-5 minutes, or until the mussels have opened (discard any mussels that do not open during cooking).",
      "Meanwhile, heat a griddle pan over a high heat. When the pan is hot, drizzle the olive oil over the bread slices and grill the bread for 30 seconds on each side, or until chargrill marks appear on both sides.",
      "When the mussels have cooked, stir in the coriander leaves, then season, to taste, with salt and freshly ground black pepper.",
      "To serve, spoon the mussels, and the cooking liquor, into four bowls. Serve the bread alongside."
    ],
    "url": "www_bbc_com_food_recipes_lemongrass_and_ginger_63752",
    "title": "Lemongrass and ginger mussels recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 4Serves 4",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemongrass_and_ginger_63752_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemongrass_chicken_and_25172": {
    "ingredients": [
      "4 chicken thighs, skinless and boneless",
      "4 tbsp chopped lemongrass (very finely chop the bottom part of the lemongrass)",
      "2 tbsp vegetable oil",
      "1 tsp fish sauce",
      "35g/1¼oz dark palm sugar",
      "2 tbsp fish sauce",
      "1 Japanese long aubergine",
      "10g/⅓oz finely chopped shallot",
      "1 tbsp chopped spring onion (green part only)",
      "1 shallot, sliced into rings",
      "sea salt",
      "75g/2½oz pickling liqueur (equal quantities of caster sugar and water, flavoured with a smashed garlic clove)",
      "75g/2½oz Vietnamese chilli paste",
      "2 lime leaves, thinly sliced ",
      "jasmine rice, to serve"
    ],
    "method": [
      "For the chicken thighs, put the chicken in a bowl and add half the lemongrass and oil, and all the fish sauce. Leave to marinade for 20 minutes, or longer if convenient.",
      "Preheat the oven to 200C/400F/Gas 6.",
      "For the fish caramel sauce, heat a flameproof casserole. Add a tablespoon of water and the palm sugar. Cook over a low heat until the sugar has dissolved and the mixture has a syrup-like consistency.",
      "Set aside to cool for two minutes, then add the fish sauce and marinated chicken. Return to the heat and cook for 5-8 minutes. Transfer to the oven to finish. ",
      "For the smokey aubergine, heat a deep-fat fryer to 180C/350F. (CAUTION: hot oil can be dangerous. Do not leave unattended.)",
      "Pierce the aubergine all over with a fork and place over an open flame until it is blistered and burnt all over and tender inside. Set aside to cool a little.",
      "Meanwhile, for the spring onion vinaigrette place all the ingredients in a pan with 460ml/16fl oz water. Heat gently.",
      "For the smoky aubergine, add the finely chopped shallot and spring onions to the spring onion vinaigrette.",
      "Place the shallot rings in the deep fat fryer and deep fry until crisp. Drain and place onto a plate lined with kitchen roll to drain.",
      "To finish, top and tail the aubergine then slice it down the middle lengthways. Scoop out the tender flesh from the burnt skin and divide between serving plates. Use scissors to cut it into bite-sized pieces.",
      "Take the spring onions out of the vinaigrette and drain them, reserving the vinaigrette for dressing.",
      "Garnish with the blanched spring onions, crisp shallots and lime leaves. Dress with the vinaigrette. Serve the chicken in the casserole with jasmine rice."
    ],
    "url": "www_bbc_com_food_recipes_lemongrass_chicken_and_25172",
    "title": "Lemongrass chicken and aubergine  recipe - BBC Food",
    "time": {
      "preparation": "30 mins to 1 hour30 mins to 1 hour",
      "preparationMins": 60,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 120
    },
    "serves": "Serves 2Serves 2",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemongrass_poussin_with_17288": {
    "ingredients": [
      "2 lemongrass stalks, outer leaves removed, inner core finely chopped",
      "2 tbsp roughly chopped fresh coriander leaves",
      "4 garlic cloves, finely chopped",
      "2 red chillies, finely chopped",
      "5cm/2in piece fresh root ginger, peeled and grated",
      "2 limes, juice only",
      "300ml/11fl oz vegetable oil",
      "4 poussins",
      "1 free-range egg yolk",
      "2 tsp Dijon mustard",
      "2 tsp walnut vinegar",
      "sea salt and freshly ground black pepper",
      "1 small red cabbage, root removed, leaves very finely sliced"
    ],
    "method": [
      "Soak a large, unvarnished wooden stick suitable for cooking in cold water, preferably overnight. ",
      "Light the barbecue and allow the flames to flare up and die down, until the coals are glowing red and starting to turn white.",
      "In a bowl, mix together the lemongrass, coriander, garlic, chillies, ginger and lime juice until well combined. Stir in 50ml/2fl oz of the vegetable oil, then add the poussin and turn to coat them in the marinade, scooping some inside each, too. ",
      "When the barbecue is ready, slide the poussins onto the stick, securing them with string. ",
      "Set the stick about 30cm/12in above the barbecue coals and cook for 30-35 minutes (depending on their size), turning every so often, until the poussins are completely cooked through and no trace of pink remains when the thigh meat is pierced in its thickest part with a skewer.",
      "To make the dressingwhisk the egg yolk, Dijon mustard, walnut vinegar and 250ml/9fl oz water together in a bowl until combined. Gradually whisk in the remaining vegetable oil, whisking all the time, until emulsified. Season, to taste, with salt and freshly ground black pepper.",
      "Place the red cabbage into a large bowl, then pour over 100ml/3½fl oz of the dressing and mix well. ",
      "Serve the poussins whole with a pile of the red-cabbage salad alongside. "
    ],
    "url": "www_bbc_com_food_recipes_lemongrass_poussin_with_17288",
    "title": "Lemongrass poussin with red-cabbage salad recipe - BBC Food",
    "time": {
      "preparation": "overnightovernight",
      "preparationMins": 720,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 780
    },
    "serves": "Serves 4Serves 4",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemongratindauphinoi_88899": {
    "ingredients": [
      "200ml/7fl oz double cream",
      "150ml/5fl oz milk",
      "1 lemon, zest only",
      "salt and freshly ground black pepper",
      "1 potato, peeled and sliced finely on a mandoline",
      "3 baby carrots, peeled, cut in half lengthways"
    ],
    "method": [
      "Preheat the oven to 180C/350F/Gas 4.",
      "Heat the cream and milk in a medium sized saucepan over a low heat and bring to a simmer.",
      "Add the lemon zest and season with salt and freshly ground black pepper.",
      "Add the sliced potato and halved baby carrots and bring to the boil. Transfer to an ovenproof dish and place into the oven to cook for 15-20 minutes, or until cooked and golden-brown on top."
    ],
    "url": "www_bbc_com_food_recipes_lemongratindauphinoi_88899",
    "title": "Potato and carrot gratin recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 1Serves 1",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemonlimeandorangepo_86188": {
    "ingredients": [
      "450g/1lb unsalted butter, plus extra for greasing ",
      "450g/1lb caster sugar",
      "450g/1lb ground almonds",
      "6 free-range eggs",
      "dash vanilla essence",
      "½ lime, juice only",
      "½ lemon, juice only",
      "squeeze orange juice",
      "2 lemons, zest only",
      "1 orange, zest only",
      "1 lime, zest only ",
      "225g/8oz polenta",
      "pinch salt",
      "1 heaped tsp baking powder",
      "flour, for dusting",
      "100g/3½oz unsalted butter",
      "150g/5oz light brown sugar",
      "1 tsp orange blossom water",
      "2 oranges, juice only",
      "mascarpone cheese, to serve"
    ],
    "method": [
      "Preheat the oven to 180C/355F/Gas 4.",
      "Beat the butter and sugar together in a bowl until pale and fluffy.",
      "Add the almonds and mix together well.",
      "Add the eggs, one at a time, beating to combine well before adding the next egg.",
      "Add the vanilla essence and the fruit juices and zests and mix well.",
      "Add the polenta, salt and baking powder and stir well to combine.",
      "Spoon the cake mixture into a 30cm/12in greased and floured cake tin and transfer to the oven to bake for 45-55 minutes, or until golden and firm. If the top begins to brown too soon, cover with baking paper to protect the top from burning while the rest of the cake cooks. Remove from the oven and allow to cool.",
      "For the sauce, place the butter and sugar into a pan over high heat and cook until they melt and begin to caramelise.",
      "Add the orange blossom water and orange juice and stir well. Simmer for four minutes, until combined.",
      "To serve, slice a piece of cake and place onto a plate. Add a dollop of mascarpone and drizzle the sauce around."
    ],
    "url": "www_bbc_com_food_recipes_lemonlimeandorangepo_86188",
    "title": "Lemon, lime and orange polenta cake with orange caramel sauce recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "1 to 2 hours1 to 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "Serves 10-12Serves 10-12",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_and_blueberry_11428": {
    "ingredients": [
      "100g/4oz butter",
      "250g/9oz self-raising flour",
      "1 tsp bicarbonate of soda",
      "100g/3½oz golden caster sugar, plus 2 tsp for sprinkling",
      "100g/3½oz blueberries",
      "1 lemon, zest only",
      "2 free-range eggs",
      "150ml/5fl oz low-fat natural yogurt",
      "2 tbsp milk",
      "12 tsp lemon curd"
    ],
    "method": [
      "Preheat the oven to 200C/400F/Gas 6. Line a 12-hole deep muffin tin with paper cases.",
      "Melt the butter in a small pan over a low heat then set aside to cool for a few minutes.",
      "Sift the flour and bicarbonate of soda into a large bowl and stir in the sugar, blueberries and lemon zest. Make a well in the centre.",
      "Beat the eggs with a large whisk until smooth then beat in the yogurt, milk and melted butter until well combined.  Stir into the flour mixture with a large metal spoon until very lightly mixed.",
      "Divide the batter between the muffin cases. Place a teaspoon of the lemon curd on top of each one and sprinkle with the remaining sugar. Bake for 20 minutes or until well risen and golden-brown. Serve warm or allow to cool on a wire rack. (The lemon curd will be very hot, so don’t eat as soon as they come out of the oven.)"
    ],
    "url": "www_bbc_com_food_recipes_lemon_and_blueberry_11428",
    "title": "Lemon and blueberry muffins recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Makes 12Makes 12",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_blueberry_11428_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_and_blueberry_74594": {
    "ingredients": [
      "85g/3oz ground almonds ",
      "120g/4oz icing sugar ",
      "2 free-range egg whites",
      "pinch salt",
      "50g/1¾oz caster sugar",
      "purple food colouring gel",
      "50g/1¾oz melted butter, plus extra for greasing ",
      "50g/1¾oz plain flour, plus extra for dusting",
      "1 free-range egg ",
      "50g/1¾oz caster sugar",
      "½ lemon, zest and juice ",
      "⅓ tsp baking powder",
      "100ml/3½fl oz limoncello liquor",
      "75ml/2½fl oz lemon juice",
      "75g/2½oz caster sugar",
      "250g/9oz blueberries ",
      "1 heaped tsp agar-agar flakes",
      "few drops lemon juice",
      "5-7 tsp granulated sugar",
      "1 tsp citric acid",
      "few drops purple food colouring",
      "100ml/3½fl oz double cream, whipped to soft peaks"
    ],
    "method": [
      "To make the macaroon shells, preheat the oven to 150C/300F/Gas 2 and line a baking tray with a sheet of silicone paper.  Mark out rounds of 4cm/1.5in diameter on the reverse side of the paper with a pencil and set to one side.  ",
      "Pulse the almonds with the icing sugar in a food processor and then pass through a sieve to get rid of any larger bits of almond.  Put the egg whites with a pinch of salt in a free-standing food mixer with a whisk attachment and whisk until frothy, then gradually add the caster sugar a little a time, whisking in between each addition, until the whites are glossy and have firm peaks when the whisk is removed.  ",
      "Towards the end of the whisking, add a few drops of food colour and then add the egg whites to the icing sugar and almonds.  Mix until combined and so that the mixture falls off a spatula in ribbons.  Put the mixture into a piping bag which has a small round nozzle attached, no bigger than 1cm/½in in diameter.  Pipe the mixture onto the tray in the circles and leave to set for around 15 minutes. ",
      "Bake the macaroon shells for 12-15 minutes, until the shells peel off the paper easily. Leave them to cool on a wire rack.",
      "For the lemon sponges, increase the oven temperature to 200C/180C (fan)/Gas 6.  Grease the silicone moulds with melted butter, then dust with flour and set to one side.",
      "Whisk together the egg with the sugar in a bowl until pale and frothy. Add the butter, flour, lemon zest and juice and baking powder and mix well until combined.  Rest the batter for 20-30 minutes before pouring into the moulds and baking for 12-15 minutes.  ",
      "Remove from the moulds and cool on a wire rack for 10 minutes.  Dip each sponge into the limoncello and set to one side.",
      "For the lemon sugar syrup, place the lemon juice and sugar in a small saucepan and bring to a boil for 4-5 minutes, or until thickened and syrupy.  Remove from the heat and set to one side until cool.",
      "To make the blueberry gel, place the blueberries into a food processor and blend to a purée.  Sieve the purée into a saucepan to remove the skins and pips.  Sprinkle the agar-agar flakes over the purée and place on the heat without stirring.  ",
      "Once the mixture has heated through, stir and keep on the heat for 3-5 minutes. Pour into a cling film-lined cake tin and put into the fridge until set - around 30 minutes.  Once set, break the jelly into pieces and put into the food processor with a few drops of lemon juice and blend until smooth and is a gel consistency.  Transfer into a piping bag and keep cool until needed. ",
      "For the sherbet, mix together five teaspoons of the sugar, the citric acid and food colouring until the colour is even throughout.  Taste to ensure that the sherbet is not too sour and add more sugar, to taste.",
      "To assemble, brush a little of the lemon sugar syrup on the edges only of the sponges and then roll the edges in the sherbet.  Scoop out a little hole in the top of the sponge, making sure not to go too deep and cut through the bottom of the sponge.  Pipe a small blob of the blueberry gel in the hole.  Place the whipped cream in another piping bag and pipe a small blob of cream on each sponge making sure to hide the hole and its contents.  ",
      "Sandwich together the macaroons with the remaining gel and place a macaroon, on its side, on top of each sponge cake over the blob of whipped cream."
    ],
    "url": "www_bbc_com_food_recipes_lemon_and_blueberry_74594",
    "title": "Lemon and blueberry bursts recipe - BBC Food",
    "time": {
      "preparation": "30 mins to 1 hour30 mins to 1 hour",
      "preparationMins": 60,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 120
    },
    "serves": "Makes 12Makes 12",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_and_blueberry_82699": {
    "ingredients": [
      "400g/14oz granulated sugar",
      "100ml/3½fl oz clear honey ",
      "50ml/2fl oz liquid glucose  ",
      "2 large egg whites, at room temperature",
      "pinch of salt",
      "50g/1¾oz candied lemon peel, chopped",
      "75g/2½oz flaked almonds, toasted",
      "75g/2½oz dried blueberries ",
      "40g/1½oz white chocolate chips ",
      "handful of fresh blueberries, to scatter over the top"
    ],
    "method": [
      "Line a 17cm/7in square tin with baking parchment and line the base with rice paper.",
      "Put the sugar, honey and liquid glucose in a large, deep heavy-bottomed pan with 125ml/4½fl oz of cold water. Heat gently to dissolve the sugar (about 15 minutes). Put a sugar thermometer in the pan and bring the mixture to the boil. Allow it to bubble until the temperature reaches 125C/257F. (CAUTION: boiling sugar is extremely hot. Handle very carefully and do not leave unattended.)",
      "At this point, put the egg whites in the bowl of a freestanding mixer and whisk until stiff peaks form, taking care not to overbeat. Fill your sink with 10cm/4in of cold water.",
      "Continue to cook the syrup until the thermometer reaches 149C/300F – it should be a dark caramel colour. Dip the base of the pan in the cold water to stop the caramel cooking. ",
      "Slowly pour the caramel mixture into the food mixer taking care not to let it touch the beaters as it might splash you. It will froth up to the top of the mixing bowl. Add a pinch of salt and mix on a moderate speed for 5-8 minutes to incorporate all the syrup. The nougat is ready when it is light, fluffy and an off-white colour. ",
      "Working quickly, fold in the candied peel, most of the almonds and the dried blueberries, then pour the mixture into the prepared tin and spread it evenly in the tin using a wet knife. Sprinkle over the white chocolate chips with the remaining almonds and the fresh blueberries and leave to cool. Leave to set for a few hours before cutting into squares."
    ],
    "url": "www_bbc_com_food_recipes_lemon_and_blueberry_82699",
    "title": "Lemon and blueberry nougat recipe - BBC Food",
    "time": {
      "preparation": "overnightovernight",
      "preparationMins": 720,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 750
    },
    "serves": "Makes 25 pieces of nougatMakes 25 pieces of nougat",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_blueberry_82699_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_and_elderflower_15737": {
    "ingredients": [
      "450g/1lb unsalted butter, at room temperature",
      "450g/1lb caster sugar",
      "pinch salt",
      "4 unwaxed lemons, zest only",
      "8 large free-range eggs",
      "300g/10½oz self-raising flour, sifted ",
      "20g/¾oz ground almonds",
      "4 tbsp elderflower cordial ",
      "fresh flowers, to decorate",
      "fresh fruit, to decorate",
      "100ml/3½fl oz elderflower cordial",
      "1 unwaxed lemon, juice only",
      "250g/9oz unsalted butter, at room temperature",
      "500g/1lb 2oz icing sugar, sifted",
      "75ml/2½fl oz double cream",
      "4 tbsp elderflower cordial "
    ],
    "method": [
      "Preheat the oven to 200C/180C Fan/Gas 6. Grease and base-line three 20cm/8in loose-bottomed round cake tins with baking paper. ",
      "Put the butter, sugar, salt and lemon zest into the bowl of a stand mixer fitted with a paddle attachment and beat until pale and fluffy. Gradually beat in the eggs, one at a time, adding a spoonful of flour occasionally to prevent the mixture from splitting.",
      "Fold in the remaining flour and the ground almonds, then fold in the elderflower cordial. Divide the mixture equally between the three tins and bake for 20–25 minutes until risen and golden. To test that the cakes are cooked, insert a cocktail stick or skewer into the centre; if it comes out clean the cakes are ready.",
      "Transfer the tins to a wire rack and use a cocktail stick or small skewer to prick holes all over the surface of the sponges. Mix together the elderflower cordial and lemon juice and spoon over the sponges. Leave to soak and cool in the tins for 30 minutes, then turn out and leave to cool completely. ",
      "Meanwhile, to make the buttercream, beat the butter in a stand mixer fitted with a paddle attachment (or use an electric hand whisk) until soft. Gradually beat in the icing sugar until pale and fluffy, then beat in the cream and elderflower cordial. (Take care not to over-beat the mixture as it can split.)",
      "Put a spoonful of buttercream onto a cake stand or serving plate, then lay one of the sponges on top (if they’ve domed slightly during baking, trim with a bread knife to flatten the tops). Spread the sponge with a little of the buttercream then lay a second sponge on top. Repeat the layering process then spoon the remaining buttercream on top of the cake. Use a palette knife to spread the buttercream over the tops and sides of the cake in an even layer. Finally turn the cake whilst holding a palette knife down the side to scrape away some of the buttercream so the sponge is visible underneath. Decorate with fruit and fresh flowers and serve."
    ],
    "url": "www_bbc_com_food_recipes_lemon_and_elderflower_15737",
    "title": "Lemon and elderflower cake recipe - BBC Food",
    "time": {
      "preparation": "30 mins to 1 hour30 mins to 1 hour",
      "preparationMins": 60,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 90
    },
    "serves": "Serves 12Serves 12",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_elderflower_15737_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_and_ginger_mille_19111": {
    "ingredients": [
      "750g/1lb 10oz strong white flour",
      "pinch salt",
      "250g/9oz unsalted butter, diced",
      "250g/9oz lard, diced",
      "1 tbsp lemon juice",
      "about 450ml/16fl oz iced water",
      "3 free-range eggs, plus 4 free-range egg yolks",
      "6 lemons, juice and zest of 3 lemons",
      "115g/4oz unsalted butter, diced",
      "115g/4oz caster sugar",
      "1 x 250g/9oz jar preserved ginger in syrup",
      "300ml/10fl oz double cream",
      "300ml/10fl oz crème fraîche",
      "300g/10oz cream cheese",
      "1 lemon, zest only   ",
      "2 tsp ground ginger",
      "250ml/9fl oz sugar",
      "125ml/4¼fl oz water",
      "500g/1lb 2oz fondant icing",
      "yellow food colouring"
    ],
    "method": [
      "Preheat the oven to 220C/425F/Gas 7. Line two large baking trays with greaseproof paper. You'll also need two more large baking trays.",
      "For the pastry, sift the flour and salt into a large bowl. Stir in the butter and lard then add the lemon juice and just enough iced water to bring the pastry together. Shape the dough into a block and chill in the freezer for 10 minutes. ",
      "Roll the pastry out to a rectangle of 5mm/¼in thickness and fold into thirds. Seal the edges by pressing them together, turn the pastry through 90 degrees and roll out again. Wrap in cling film and chill in the freezer for five minutes.",
      "Repeat step 3 twice then chill in the fridge for at least 20 minutes, or until ready to use. ",
      "Roll out one quarter of the pastry on a floured work surface to a 3mm/⅛i thickness and carefully place on one of the lined baking trays. Repeat with another quarter of the pastry. Return the remaining pastry to the fridge.",
      "Prick each sheet of pastry with a fork, dust with icing sugar and return to the fridge for five minutes. Lay a piece of greaseproof paper over each sheet of pastry, cover each with a empty baking tray and bake in the oven for 10 minutes. Remove the top baking tray and parchment, dust the pastry with icing sugar and return to the oven for 10 minutes.",
      "Repeat steps 5 and 6 with the remaining pastry.",
      "When the pastry sheets are cool, cut them with a pizza slicer or a sharp knife into 10cm x 5cm/4in x 2in rectangles. You will need 36 rectangles for the finished millefeuilles (this recipe makes plenty of pastry so don’t worry if there are a few breakages when you cut it).",
      "Meanwhile, make the lemon curd. Whisk together the egg yolks and eggs in a large bowl. Place the lemon juice, zest, butter and sugar in large metal bowl, set it over a saucepan of simmering water and whisk until the butter melts and the sugar dissolves. ",
      "Gradually whisk the hot butter mixture into the eggs then pour the mixture back into the metal bowl over simmering water. Whisk constantly for 4-5 minutes, or until the curd thickens. Pour the lemon curd into a clean bowl and place clingfilm directly on the surface to prevent a skin forming. Chill until required.",
      "For the ginger filling, blend half the ginger and all of the syrup in a blender to a smooth purée. Finely chop the remaining ginger and set it aside.",
      "Using an electric mixer, beat the cream, crème fraîche and cream cheese until smooth then fold in the lemon zest, ground ginger and about four tablespoons of the ginger purée. ",
      "Gently fold 125ml/4fl oz of the lemon curd into the cream mixture and spoon into a piping bag fitted with a 1cm/½in plain nozzle. Chill until required.",
      "For the icing, place the sugar and water in a small pan, and heat until the sugar dissolves. Add the fondant icing and heat until the mixture is of a thick pouring consistency. Remove about 125ml/4fl oz of the mixture and stir in a few drops of yellow food colouring; spoon the it into a piping bag fitted with a small nozzle. Set aside to cool completely.",
      "To assemble the millefeuilles, take 12 rectangles of the pastry and lie them next to each other in two rows of six. Pour the white icing over them, spreading it carefully with a palette knife. Pipe across lines of yellow icing and drag a toothpick in the opposite direction to make the traditional feathered pattern. Let the icing set for five minutes then carefully separate the pieces of pastry.",
      "Scatter a little chopped ginger onto 12 plain pastry bases and pipe over some ginger cream filling. Top with the remaining plain pastry bases and add another layer of chopped ginger and cream. Top with an iced pastry rectangle."
    ],
    "url": "www_bbc_com_food_recipes_lemon_and_ginger_mille_19111",
    "title": "Lemon and ginger millefeuilles recipe - BBC Food",
    "time": {
      "preparation": "1-2 hours1-2 hours",
      "preparationMins": 120,
      "cooking": "1 to 2 hours1 to 2 hours",
      "cookingMins": 120,
      "totalMins": 240
    },
    "serves": "Makes 12Makes 12",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_and_ginger_prawns_60081": {
    "ingredients": [
      "6 small preserved lemons",
      "7½cm/3in piece fresh root ginger, peeled and grated",
      "1 tbsp grated fresh turmeric",
      "2 tbps olive oil",
      "1 fat garlic clove, peeled ",
      "5 tbsp clear honey",
      "black pepper",
      "2 tbsp olive oil",
      "4 extra-large prawns (about 100g/3½oz each, if possible)"
    ],
    "method": [
      "In a blender, combine all the ingredients except the prawns and blend to a purée. ",
      "Peel the prawns, but leave the tail on. Pour the marinade into a shallow bowl or a large food bag, add the prawns and make sure they are well-coated. Refrigerate for at least 20 minutes, but longer if you like.  ",
      "Heat a large griddle pan. When hot, add the prawns and cook on each side for 1-2 minutes, or until cooked through. While they are cooking keep basting all the time. Serve immediately."
    ],
    "url": "www_bbc_com_food_recipes_lemon_and_ginger_prawns_60081",
    "title": "Lemon and ginger prawns recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "less than 10 minsless than 10 mins",
      "cookingMins": 10,
      "totalMins": 40
    },
    "serves": "Serves 4Serves 4",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_and_lavender_79937": {
    "ingredients": [
      "600ml/20fl oz double cream",
      "150g/5½oz caster sugar",
      "1 tbsp edible lavender",
      "2 lemons, juice only, strained",
      "100g/3½oz soft, unsalted butter",
      "2 tsp lavender (fresh buds and leaves or edible dried lavender)",
      "50g/1¾oz caster sugar",
      "175g/6oz plain flour"
    ],
    "method": [
      "To make the posset, put the cream, sugar and lavender in a pan. Gradually bring to the boil, stirring all the time to dissolve the sugar. Reduce the heat a little and simmer for 2-3 minutes, stirring often so that the cream doesn’t stick and burn.",
      "Remove the pan from the heat and stir in the lemon juice. Leave to cool for five minutes, then pour into four glass tumblers or small dishes, or six espresso cups. Leave to cool completely then cover with cling film and chill in the fridge for at least three hours, or until set. ",
      "Remove from the fridge 20 minutes before serving.",
      "To make the biscuits, place the butter and lavender in a bowl and beat together. This helps release the flavour of the lavender. Add the caster sugar and beat until pale and fluffy. Work in the flour with a fork or wooden spoon. Don’t worry if it seems like there is too much flour at this point - it is supposed to be a fairly dry mix. Use your hands to bring the mixture together into a smooth dough.",
      "Form the mixture into a cylinder shape, about 4cm/1½in in diameter and 18cm/7in long, and wrap in greaseproof paper or cling film. Put in the fridge for at least a couple of hours, until firm.",
      "When you are ready to bake the biscuits, preheat the oven to 160C/325F/Gas 3 and line a large baking tray with parchment.",
      "Unwrap the dough and use a sharp, serrated knife to cut 5mm thick discs from the cylinder. Place these onto the lined tray, allowing room for the biscuits to spread a little when they bake. (You’ll need to bake them in batches.) Bake for about 15 minutes, or until the edges of the biscuits are just starting to turn golden-brown. Transfer to a wire rack to cool.",
      "Serve the lemon posset with the lavender biscuits. Any leftover biscuits will keep in an airtight container for a few days."
    ],
    "url": "www_bbc_com_food_recipes_lemon_and_lavender_79937",
    "title": "Lemon and lavender posset with lavender biscuits recipe - BBC Food",
    "time": {
      "preparation": "over 2 hoursover 2 hours",
      "preparationMins": 120,
      "cooking": "over 2 hoursover 2 hours",
      "cookingMins": 120,
      "totalMins": 240
    },
    "serves": "Serves 4-6Serves 4-6",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_lavender_79937_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_and_lavender_loaf_90853": {
    "ingredients": [
      "250g/9oz plain flour",
      "½ tsp baking powder",
      "½ tsp bicarbonate of soda",
      "125g/4½oz caster sugar",
      "1½ tbsp edible lavender",
      "2 unwaxed lemons, finely grated zest only",
      "2 large free-range eggs",
      "200g/7oz plain, full-fat yoghurt",
      "100g/3½oz unsalted butter, melted",
      "juice of 2 lemons, strained",
      "2 tbsp icing sugar",
      "1 tbsp granulated sugar",
      "2 tsp edible lavender"
    ],
    "method": [
      "Heat your oven to 180C/350F/Gas 4. Line a 1kg/2lb 4oz loaf tin (around 10x20cm/4x8in base measurement) with baking parchment.",
      "In a bowl, combine the flour, raising agents, sugar, lavender and lemon zest.",
      "In a jug, beat the eggs with the yoghurt and melted butter. Pour this onto the dry ingredients and, using a spatula, stir until just combined.",
      "Pour into the prepared tin and bake for 40 minutes, or until a skewer inserted into the centre of the cake comes out clean.",
      "Remove the cake from the oven and prick it deeply all over with a cocktail stick.",
      "Mix the ingredients for the drizzle together and pour over the hot cake. Sprinkle over the granulated sugar and then the lavender. Leave to cool completely in the tin before slicing."
    ],
    "url": "www_bbc_com_food_recipes_lemon_and_lavender_loaf_90853",
    "title": "Lemon and lavender loaf cake recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Serves 8Serves 8",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_lavender_loaf_90853_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_and_lime_02564": {
    "ingredients": [
      "2 oat digestive-style biscuits",
      "20g/¾oz butter, melted",
      "½  lemon, juice only",
      "½ lime, juice only",
      "1  tbsp icing sugar",
      "125g/4½ oz mascarpone"
    ],
    "method": [
      "Put the biscuits in sandwich bag and use a rolling pin to gently bash them until small crumbs.",
      "Tip the crushed biscuits into a bowl and pour in the melted butter. Stir together until well combined, then spoon the crumbs into the bottom of two small glasses and press down firmly.",
      "Mix the lemon and lime juice, mascarpone and icing sugar together in a bowl until well combined.",
      "Divide the mixture between the two glasses and chill in the fridge for two hours."
    ],
    "url": "www_bbc_com_food_recipes_lemon_and_lime_02564",
    "title": "Lemon and lime cheesecake recipe - BBC Food",
    "time": {
      "preparation": "30 mins to 1 hour30 mins to 1 hour",
      "preparationMins": 60,
      "cooking": "no cooking requiredno cooking required",
      "cookingMins": 0,
      "totalMins": 60
    },
    "serves": "Makes 2Makes 2",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_and_lime_chicken_27815": {
    "ingredients": [
      "2 skinless chicken breasts",
      "2 tbsp sesame oil",
      "2 tsp vegetable oil",
      "2 tbsp soy sauce",
      "2 garlic cloves, finely chopped",
      "½ lemon, grated zest and juice",
      "salt and freshly ground black pepper",
      "1 tbsp clear honey",
      "2 tbsp groundnut oil",
      "2-3 tsp sesame oil",
      "2 free-range eggs, lightly beaten",
      "splash soy sauce",
      "2 spring onions, finely chopped",
      "50g/2oz fresh peas or frozen peas, defrosted",
      "150g/5oz long-grain rice, cooked according to packet instructions",
      "salt and freshly ground black pepper",
      "3-4 tbsp chopped coriander",
      "lime wedges, to serve"
    ],
    "method": [
      "To butterfly the chicken breasts, lay them on a board and use a sharp knife to make a cut parallel to the chopping board three-quarters of the way through each breast. Open each chicken breast out so you have two large, thinner chicken breasts.",
      "Place them in a bowl with one tablespoon of the sesame oil, the vegetable oil, soy sauce, garlic and lemon zest and juice. Season with salt and freshly ground black pepper and mix to combine. In a separate bowl, mix the honey with the remaining sesame oil.",
      "Heat a griddle pan over a medium-high heat until smoking then lay the chicken on the griddle and cook for 2-3 minutes on each side, brushing it once or twice with the honey and sesame mixture. When it's done the chicken should be chargrilled on the outside and completely cooked through (the juices should run clear when a skewer is inserted into the thickest part of the chicken). Leave to rest for 2-3 minutes.",
      "Meanwhile, for the rice, heat a wok over a high heat then add the groundnut and one teaspoon of the sesame oil. When the oil starts to shimmer add the eggs and cook, stirring all the time, for 1-2 minutes or until they're scrambled. ",
      "Push the eggs to the side of the pan and add a little more sesame oil, the soy sauce, spring onions and peas and cook for one minute then add the rice and season with salt and freshly ground black pepper. Cook, stirring continuously, for 3-4 minutes, or until warmed through. Stir through the coriander.",
      "To serve, spoon the rice onto plates. Cut the chicken on the diagonal into thin strips and place on top of the rice. Top with a wedge of lime."
    ],
    "url": "www_bbc_com_food_recipes_lemon_and_lime_chicken_27815",
    "title": "Lemon and lime chicken with coriander-fried rice recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 2Serves 2",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_lime_chicken_27815_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_and_mascarpone_29573": {
    "ingredients": [
      "1 x 25cm/10in sweet shortcrust pastry tart shell, baked blind (you can use ready-made pastry)",
      "300g/10½oz mascarpone",
      "300g/10½oz caster sugar",
      "6 lemons, juice and zest",
      "6 free-range eggs, plus 6 free-range egg yolks",
      "175g/6oz caster sugar",
      "150ml/5½fl oz champagne",
      "200g/7oz fresh raspberries",
      "icing sugar",
      "raspberries",
      "whipped cream"
    ],
    "method": [
      "Preheat the oven to 180C/350F/Gas 4.",
      "Beat the mascarpone, caster sugar, lemon juice and zest together in a bowl until very smooth. ",
      "Beat in the eggs and egg yolks until well combined. ",
      "Pour the mixture into the tart shell and bake in the oven for 45-60 minutes, or until set.  Remove the tart from the oven and set aside to cool, then leave to chill in the fridge. ",
      "For the sauce, bring the sugar and champagne to the boil in a saucepan, then reduce the heat and simmer for 10 minutes. Remove from the heat, then add the raspberries and set aside to cool completely.",
      "Blend the sauce in a blender until smooth, then pass through a sieve. ",
      "To serve, cut a slice of the tart, sprinkle over some icing sugar and caramelise with a cook’s blowtorch (optional).",
      "Place the slice onto a serving plate and drizzle over a little sauce. Top with the raspberries and whipped cream."
    ],
    "url": "www_bbc_com_food_recipes_lemon_and_mascarpone_29573",
    "title": "Lemon and mascarpone tart recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Serves 8Serves 8",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_mascarpone_29573_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_and_pomegranate_48177": {
    "ingredients": [
      "1 large or 2 small pomegranates",
      "200g/7oz couscous",
      "250ml/9fl oz pints boiling chicken stock or water",
      "sea salt and freshly ground black pepper",
      "2 lemons, juice only",
      "6 tbsp olive oil",
      "4 tbsp chopped, fresh mint or coriander"
    ],
    "method": [
      "Cut the pomegranates in half and scoop out the seeds using a teaspoon and remove the white membrane around the seeds.",
      "Place the couscous in a bowl. Pour the boiling stock or water onto the couscous and and mix in the olive oil and lemon juice. Season with sea salt and freshly ground black pepper.  ",
      "Cover tightly with clingfilm and allow the couscous to sit in a warm place for 5-10 minutes, or until the liquid has been absorbed.  Remove the clingfilm and fluff the grains with a fork. Allow the couscous to cool completely.",
      "Stir the chopped herbs and pomegranate seeds into the couscous. Add more olive oil, salt, pepper and herbs to taste."
    ],
    "url": "www_bbc_com_food_recipes_lemon_and_pomegranate_48177",
    "title": "Lemon and pomegranate couscous recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 4Serves 4",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_pomegranate_48177_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_and_plum_meringue_51269": {
    "ingredients": [
      "butter, for greasing",
      "5 free-range egg whites",
      "400g/14oz caster sugar",
      "2 sprigs lemon verbena, leaves only, plus extra sprigs to serve",
      "8 ripe plums, stones removed, cut into quarters",
      "500ml/18fl oz double cream",
      "225g/8oz good-quality ready-made lemon curd"
    ],
    "method": [
      "Preheat the oven to 180C/160C Fan/Gas 4. ",
      "Grease a 35x25cm/14x10in Swiss roll tin with butter and line with silicone or baking paper.",
      "Whisk the egg whites in a large clean mixing bowl using an electric whisk, or in the bowl of a free-standing food mixer. Set the whisk to a high speed and whisk until soft peaks form when the whisk is removed.",
      "Gradually add 275g/9¾oz of the caster sugar, whisking until all of the sugar has been incorporated and the mixture is smooth and glossy. You should hear the machine dropping down a gear as the mixture reaches the correct consistency, and it should resemble shaving foam.",
      "Spoon the meringue into the prepared tin and smooth into an even layer using a palette knife. Sprinkle over the lemon verbena leaves. ",
      "Bake for 7-8 minutes, or until golden-brown on top, then reduce the oven temperature to 170C/150C Fan/Gas 3 and bake for a further 8-10 minutes, or until crisp.",
      "Remove the meringue from the oven and turn it out of the tin onto a clean tea towel. Peel the paper from the base of the meringue and set aside to cool.",
      "Meanwhile, place the plums, 100g/3½oz of the sugar and 100ml/3½fl oz water into a saucepan and bring the mixture to the boil. Reduce the heat until the mixture is simmering, then simmer for 8-10 minutes, or until the plums have softened but still retain their shape. ",
      "Whisk the double cream in a large bowl until very soft peaks form when the whisk is removed. Gently whisk in the remaining sugar, then fold in the lemon curd.",
      "Spread the lemon cream mixture on top of the cooled meringue all the way to the edges, leaving a 1cm/½in gap along one of the long edges. Spoon three-quarters of the cooked plums over the top. ",
      "Starting at the long end with the border, roll up the meringue using the tea towel to help you. ",
      "Carefully roll the roulade off the tea towel and onto a serving platter. Spoon the remaining plums around the roulade and garnish with the lemon verbena sprigs."
    ],
    "url": "www_bbc_com_food_recipes_lemon_and_plum_meringue_51269",
    "title": "Lemon and plum meringue roulade recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_and_poppyseed_09377": {
    "ingredients": [
      "175g/6oz ginger biscuits, crushed ",
      "150g/5oz butter, melted ",
      "1.2kg/2½lb full-fat ricotta",
      "150g/5oz caster sugar",
      "6 free-range eggs",
      "1 tsp vanilla extract",
      "250g/9oz lemon curd",
      "1 tbsp poppy seeds",
      "200g/7oz caster sugar",
      "150ml/5fl oz white wine",
      "250g/9oz raspberries, fresh or frozen ",
      "1 tbsp rose water",
      "double cream, to serve"
    ],
    "method": [
      "Preheat the oven to 175C/350F/Gas 4.",
      "Mix the ginger biscuits and melted butter in a bowl until well combined. Press into a 22cm/9in springform cake tin and chill in the fridge for 30 minutes. ",
      "For the topping, blend the ricotta, sugar, eggs and vanilla extract in a food processor until smooth.",
      "Spoon the mixture into a bowl then gently fold in the lemon curd and poppy seeds. Spoon this mixture into the cake tin on top of the chilled biscuit base.",
      "Cook the cheesecake in the oven for one hour, depending on your oven. The cheesecake is cooked when springy to the touch and just set in the middle. ",
      "For the syrup, place the sugar, 100ml/3½fl oz water and wine in a saucepan and bring gently to a simmer until all the sugar dissolves. Allow to boil for five minutes, or until thickened. ",
      "Add the raspberries and rose water to the syrup, remove the pan from the heat and set aside. Once cooled, blend the sauce in a food processor until smooth and then pass through a fine sieve. ",
      "Serve the cheesecake with the sauce and some double cream."
    ],
    "url": "www_bbc_com_food_recipes_lemon_and_poppyseed_09377",
    "title": "Lemon and poppyseed cheesecake recipe - BBC Food",
    "time": {
      "preparation": "30 mins to 1 hour30 mins to 1 hour",
      "preparationMins": 60,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 120
    },
    "serves": "Serves 12Serves 12",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_poppyseed_09377_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_and_poppy_seed_63235": {
    "ingredients": [
      "vegetable oil or cake release spray, for greasing the tin",
      "250g/9oz self-raising flour",
      "2 tsp baking powder",
      "250g/9oz butter, softened",
      "250g/9oz caster sugar",
      "50g/1¾oz ground almonds",
      "4 large free-range eggs",
      "4 unwaxed lemons, zest only (juice reserved for the drizzle)",
      "3 tbsp poppy seeds",
      "a little boiling water, to slacken the mixture if necessary",
      "8 tbsp lemon juice (from above)",
      "8 tbsp caster sugar",
      "2 tbsp limoncello (alternatively use lemon juice) ",
      "1 unwaxed lemon, thinly sliced and pips removed",
      "4-5 tbsp caster sugar ",
      "4 tbsp flaked almonds",
      "1 tbsp poppy seeds",
      "125g/4½oz icing sugar",
      "1 tbsp limoncello (alternatively use lemon juice)",
      "1 unwaxed lemon, juice only"
    ],
    "method": [
      "Preheat the oven to 180C/160C Fan/Gas 4. Grease a 25cm/10in non-stick, fluted ring cake tin with cake release spray or vegetable oil.",
      "Sift the flour and baking powder into a large bowl. Add the rest of the ingredients (except the water) and whisk until smooth using an electric hand mixer. Add about 100ml/3½fl oz hot water from the kettle to slacken the mixture to a soft dropping consistency, if necessary. Pour into the prepared tin and bake for about 35 minutes, or until the cake starts to come away from the sides. To check the cake is ready insert a skewer, if it comes out clean the cake is cooked.",
      "Meanwhile, make the drizzle. Put the lemon juice and sugar in a small saucepan and heat gently until the sugar is dissolved. Increase the heat a little and let it boil for about a minute, or until thickened and syrupy. Add the limoncello, boil for another minute and set aside.",
      "For the decoration, add the lemon slices to the drizzle syrup. Reheat the syrup and simmer for 1-2 minutes or until the lemon slices have softened.  Turn off the heat and, using tongs, carefully transfer the lemon slices to a plate lined with greaseproof paper. Leave to cool and reserve any leftover syrup.",
      "When cool enough to handle, make a cut from the centre of the lemon slices to the skin and twist the ends in the opposite direction (so they resemble a bow). Repeat with all the slices, sprinkle with caster sugar and place on a baking tray lined with non-stick paper. ",
      "When the cake is cooked, reduce the oven temperature to 100C/80C Fan/Gas ¼. ",
      "Leave the cake in the tin while you apply the drizzle. Make holes using a skewer and brush or spoon about a third of the drizzle over the cake. Allow to cool for 5 minutes then turn the cake out onto a wire rack. Make some more holes in the top of the cake (these will be covered with icing later) and brush or spoon the rest of the syrup over the whole cake. Allow to cool completely. When the cake is cool, transfer it to a serving plate or cake board.",
      "Meanwhile, put the lemon twists in the oven to dry out for 30 minutes to 1 hour, until they are chewy (rather than crisp).  ",
      "Toast the flaked almonds in a dry frying pan until golden-brown, then set aside to cool.",
      "For the icing, mix the icing sugar, limoncello and a little lemon juice until you have a thick icing. Drizzle it over the top of the cake, encouraging it to run down the sides a little. Decorate with the lemon twists, flaked almonds and poppy seeds."
    ],
    "url": "www_bbc_com_food_recipes_lemon_and_poppy_seed_63235",
    "title": "Lemon poppy seed cake recipe - BBC Food",
    "time": {
      "preparation": "30 mins to 1 hour30 mins to 1 hour",
      "preparationMins": 60,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 120
    },
    "serves": "Makes 1 x 25cm/10in ring-shaped cakeMakes 1 x 25cm/10in ring-shaped cake",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_poppy_seed_63235_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_and_rhubarb_94455": {
    "ingredients": [
      "100g/3½oz salted butter, cold, chopped roughly",
      "200g/7oz plain flour",
      "80g/2¾oz icing sugar",
      "3 free-range eggs, 2 yolks only, 1 whole for egg wash",
      "50g/1¾oz rhubarb ",
      "4 lemons, zest and juice",
      "320g/11¼oz double cream",
      "350g/12oz caster sugar",
      "10 free-range eggs, 9 whole, 1 yolk only",
      "200g/7oz rhubarb, roughly chopped",
      "100g/3½oz caster sugar",
      "1 x 8g sachet pectin"
    ],
    "method": [
      "For the pastry, rub the butter into the flour using your hands until it resembles breadcrumbs. Mix in the icing sugar, then add the two egg yolks and bring the mixture together into a dough. Wrap the pastry in cling film and chill in the fridge for 10 minutes. ",
      "Preheat the oven to 180C/350F/Gas 4.",
      "Remove the pastry from the fridge, and roll out to 2-3mm/1/8in thick. Line the tart tins and crimp the edges. Scrunch up pieces of parchment paper just larger than the tart tins, and lay them on top of the pastry. Fill with baking beans.",
      "Bake the tart cases for five minutes, then remove from the oven, and remove the parchment and baking beans. Lightly beat an egg in a bowl for the egg wash. Brush the tarts with egg wash. Bake again for another few minutes until cooked and golden-brown. Remove from the oven and set aside to cool completely. ",
      "Turn the oven down to 120C/250F/½ Gas. ",
      "For the filling, blend the 50g/1¾oz rhubarb in a food processor and squeeze the juice out. Combine this juice with all other filling ingredients and place in a heatproof bowl set over a pan of simmering water, and heat to 60C/140F (use a thermometer to measure this). ",
      "Remove from the heat and pour the filling into the cooled tart cases and then bake until the filling reaches 70C/158F on the thermometer (roughly 10 minutes).",
      "Remove the tarts from the oven and set aside to cool. ",
      "Make the rhubarb jam by combining the rhubarb, sugar and pectin in pan and bringing up to the boil. Heat to 107C/225F and then remove from the heat. Strain the jam through a sieve, and set aside to cool slightly. ",
      "Spoon a small amount of the jam on top of each tartlet, and serve. "
    ],
    "url": "www_bbc_com_food_recipes_lemon_and_rhubarb_94455",
    "title": "Lemon and rhubarb tartlets recipe - BBC Food",
    "time": {
      "preparation": "30 mins to 1 hour30 mins to 1 hour",
      "preparationMins": 60,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 90
    },
    "serves": "Makes 12Makes 12",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_and_ricotta_tart_44080": {
    "ingredients": [
      "1 x 400g/14oz ready-made puff pastry",
      "plain flour, for dusting",
      "1 lemon, finely grated zest only",
      "300g/10½oz ricotta cheese",
      "200g/7oz mascarpone cheese",
      "200g/7oz candied peel, roughly chopped",
      "125g/4½oz caster sugar",
      "6 free-range eggs, separated "
    ],
    "method": [
      "Preheat the oven to 180C/350F/Gas 4. ",
      "Roll the pastry out on a lightly floured work surface to a 3mm/⅛in thickness. Use the pastry to line a 25cm/10in pastry case. Cover with a damp cloth while you make the filling.",
      "In a large bowl, mix the ricotta, mascarpone and candied peel with 100g/3½oz of the sugar and five of the egg yolks until smooth and well combined. ",
      "Whisk the egg whites in another large, clean bowl until fluffy. Whisk in the remaining sugar and continue whisking until stiff peaks form when the whisk is removed.",
      "Using a large metal spoon, fold the whites into the ricotta mixture, then pour into the pastry-lined tart tin. ",
      "Beat the reserved egg yolk in a bowl. Fold in the overhanging pastry and brush with the egg yolk. Bake in the oven for 30 minutes, until the pastry is cooked through and the filling has a slight wobble in the centre.",
      "Set aside to cool for two hours, then sprinkle with lemon zest. "
    ],
    "url": "www_bbc_com_food_recipes_lemon_and_ricotta_tart_44080",
    "title": "Lemon and ricotta tart recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Serves 8Serves 8",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_ricotta_tart_44080_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_and_sage_stuffed_91825": {
    "ingredients": [
      "75g/2½oz unsalted butter",
      "2 onions, finely diced",
      "200g/7oz pork mince",
      "1 bunch fresh sage, finely chopped",
      "175g/6oz fresh white breadcrumbs",
      "100g/3½oz suet",
      "1 lemon, zest",
      "1.5kg/3lb 5oz boneless loin of pork, butterflied",
      "salt and freshly ground black pepper",
      "500g/1lb 2oz Maris Piper potatoes",
      "125ml/4fl oz double cream",
      "125g/4½oz unsalted butter",
      "50g/1¾oz unsalted butter",
      "1 head spring greens, core removed and sliced",
      "200ml/7fl oz pork jus or gravy"
    ],
    "method": [
      "For the stuffed loin of pork, preheat the oven to 150C/300F/Gas 2.",
      "Heat a frying pan and add 25g/10z of the butter. Once hot, add the onion and cook for a couple of minutes. Allow the onion to cool.",
      "In large bowl, mix the cooled onion, pork mince, sage, breadcrumbs, suet and lemon zest.",
      "Lay the pork loin, flesh-side up, on a chopping board.",
      "With a sharp knife, make an incision in the eye of the loin half way down running parallel to the board, cutting almost all the way through. Open the loin up and repeat a few times, cutting so that the loin opens up and it is as flat as the belly part of the pork.",
      "Season with salt and black pepper, then spoon the stuffing onto the loin and spread out along the loin, then roll up into a large sausage.",
      "Secure with cook's string at 5-6 points along the loin and then transfer to a roasting tin.",
      "Rub the rest of the butter over the top of the pork and season with plenty of sea salt.",
      "Roast in the oven for five hours. The crackling should be crisp and the pork very tender.",
      "For the mash potato, cook the potatoes in a pan of boiling salted water for 12-15 minutes, or until tender. Drain.",
      "Press the potato through a potato ricer into a saucepan. Return to the heat, then add the butter and cream and beat to a smooth purée. Season, to taste, with salt and freshly ground black pepper.",
      "For the spring greens, heat the butter in a clean pan and add the spring greens with a little water and cook until wilted.",
      "To serve, carve the pork loin and place on a serving plate. Place the mash potato next to the loin and the wilted greens next to that. Pour over some of the pork jus or gravy."
    ],
    "url": "www_bbc_com_food_recipes_lemon_and_sage_stuffed_91825",
    "title": "Lemon and sage stuffed loin of pork with wilted spring greens and mashed potato recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "over 2 hoursover 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "Serves 4Serves 4",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_and_strawberry_26775": {
    "ingredients": [
      "4 medium free-range eggs",
      "120g/4¼oz caster sugar",
      "100g/3½oz plain flour, sifted",
      "20g/¾oz unsalted butter, melted, plus extra for greasing",
      "190g/6½oz caster sugar",
      "4 unwaxed lemons, finely grated zest and juice ",
      "130g/4⅔oz unsalted butter",
      "1-2 tbsp cornflour",
      "3 large free-range eggs and 1 large free-range yolk, beaten",
      "600ml/20fl oz double cream",
      "30g/1oz icing sugar, plus extra for dusting",
      "150g/5½oz strawberries, 3 reserved for decoration, rest sliced",
      "50g/1¾oz white chocolate, chilled and grated ",
      "50g/1¾oz shelled pistachios, pulsed in a food processor to fine crumbs "
    ],
    "method": [
      "Preheat the oven to 190C/170C Fan/Gas 5. Grease and line a 30x24cm/12x9½in Swiss roll tin with baking paper.",
      "For the roulade, place a large heatproof bowl over a pan of gently simmering water. Add the eggs and sugar to the bowl and, using an electric mixer, beat for 3–4 minutes, or until doubled in size. Take off the heat and continue to beat for another 4–5 minutes on a medium to high speed.",
      "Using a large metal spoon, fold in the flour in three batches making sure it is all incorporated. Fold in the melted butter in the same way.",
      "Gently pour the mixture into the prepared tin and spread evenly using a spatula. Bake for 10 minutes or until just firm and lightly golden-brown.",
      "Dust a large baking sheet with icing sugar and carefully turn the roulade out. Carefully peel away the baking paper used to line the tin. Starting at a short end, fold the edge of the paper over the cake. Roll the cake up into the paper. Allow the roulade to cool completely while rolled.",
      "For the filling, first make a curd. In a saucepan, heat the sugar, lemon juice, lemon zest and butter over a medium heat. Stir as the butter melts and when combined stir in the cornflour. Keep stirring, using a hand whisk, for another 2–3 minutes. Take off the heat and stir in the beaten eggs. Return to a low heat and keep stirring until the curd is thickened and leaves a trail on the surface when the whisk is removed (about 15–20 minutes). Leave to cool and set. ",
      "For the cream, beat the cream and icing sugar together until soft peaks form when the whisk is removed. Transfer to the fridge to chill.",
      "Once the roulade is cool, unroll it and spread with a generous layer of whipped cream (keep any remaining cream for the decoration). Top with a layer of curd and sliced strawberries. Tightly re-roll the roulade and place on a serving plate.",
      "Spread the remaining cream over the roulade and score with a fork. Scatter with grated white chocolate and pistachio crumbs and top with the strawberries. "
    ],
    "url": "www_bbc_com_food_recipes_lemon_and_strawberry_26775",
    "title": "Lemon and strawberry roulade recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "1 to 2 hours1 to 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "Serves 8-10Serves 8-10",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_strawberry_26775_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_and_thyme_cake_15394": {
    "ingredients": [
      "200g/7oz butter",
      "200g/7oz golden caster sugar",
      "100g/3½oz plain flour",
      "1 tsp baking powder",
      "100g/3½oz ground almonds",
      "4 free-range eggs",
      "1 lemon, zest only",
      "1 tsp thyme leaves",
      "4 tbsp sugar",
      "2 large lemons, juice only",
      "½ tsp thyme leaves"
    ],
    "method": [
      "Pre-heat the oven to 160C/325F/Gas 3. Line a 900g/2lb loaf tin with baking parchment.",
      "Cream the butter with the sugar in a food mixer until pale and fluffy. In a separate bowl sift together the flour and baking powder then mix with the almonds.",
      "Lightly beat the eggs then fold them into the butter mixture in two or three sessions, beating them in thoroughly each time. If the mixture looks as if it is about to curdle, stir in some of the flour. ",
      "Grate the zest from the lemon and mix it with the thyme leaves. Pound the two together with a pestle, or some other heavy weight, and stir into the cake mixture. ",
      "Gradually mix in the flour, baking powder and almonds. ",
      "Spoon the cake mixture into the lined tin and bake for 45 minutes (if dividing the mixture into smaller tins reduce the time accordingly). ",
      "For the topping, dissolve the sugar in the juice of the lemons over a moderate heat and stir in the thyme leaves (a few flowers would be good here too). As the cake comes from the oven, spike the surface with a skewer and spoon over the syrup. ",
      "Leave to cool and serve in slices with thick yoghurt."
    ],
    "url": "www_bbc_com_food_recipes_lemon_and_thyme_cake_15394",
    "title": "Lemon and thyme cake recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Serves 6-8Serves 6-8",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_thyme_cake_15394_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_and_tarragon_51274": {
    "ingredients": [
      "200g/7oz salt",
      "150g/5½oz Demerara sugar",
      "2 fresh bay leaves",
      "3-4 sprigs thyme",
      "4 star anise",
      "2 lemons, peeled rind and juice only ",
      "1 skinless, boneless pork shoulder",
      "vegetable oil, for cooking",
      "100ml/3½fl oz white wine vinegar",
      "300ml/10½fl oz chicken stock",
      "150g/5½oz brown sugar ",
      "180ml/6fl oz white wine",
      "2 garlic cloves, grated",
      "100ml/3½fl oz honey",
      "4 fresh bay leaves, finely chopped",
      "4 tbsp chopped fresh tarragon",
      "2 large free-range egg yolks",
      "2 tbsp Dijon mustard",
      "2 tbsp white wine vinegar",
      "250ml/9fl oz vegetable oil",
      "5 tbsp walnut oil",
      "salt and cayenne pepper, to taste",
      "lemon juice, to taste",
      "100g/3½oz toasted walnuts, chopped",
      "1 carrot, grated",
      "¼ white cabbage, finely sliced",
      "1 onion, finely sliced",
      "wholemeal pitta breads, lightly toasted",
      "lettuce (optional)"
    ],
    "method": [
      "For the lemon and tarragon pulled pork, in a saucepan heat 1 litre/1¾ pints water, the salt, Demerara sugar, bay leaves, thyme, star anise and the lemon rind. Boil until the salt and sugar have dissolved then remove from the heat and leave to cool.",
      "When the brine is cold, place the pork shoulder into a container and pour over the chilled brine. Cover and place into the fridge for 24 hours. ",
      "When ready to cook the pork, preheat the oven to 140C/275F/Gas 1.",
      "Remove the pork from the marinade, pat dry and place onto a sheet of aluminium foil. Drizzle with the oil and wrap the meat in the foil, sealing the edges to form a parcel. Place in a roasting tin and transfer to the oven to slow cook for at least four hours, or until the pork is very well done and tender.",
      "Remove from the oven and leave to cool, still wrapped, for 25-30 minutes.",
      "Meanwhile, in a large pan, combine the white wine vinegar, chicken stock, brown sugar, white wine, grated garlic, honey and bay leaves and bring to the boil. Turn the heat down to a low simmer.",
      "Open the wrapped pork and, using two forks, pull the pork apart, shredding it all up. Place the pork mix into the gently simmering stock and cook for 35-40 minutes, letting the stock reduce to a sticky glaze. ",
      "Meanwhile, for the walnut mayonnaise, place the egg yolks, mustard and white wine vinegar into a food processor and blend until smooth. Slowly add the vegetable oil in a thin, steady stream while the motor is still running. ",
      "When all the vegetable oil is combined, add the walnut oil with the motor running. Blend until the mayonnaise has emulsified then season with salt, cayenne pepper and lemon juice. Stir in the walnuts.",
      "For the coleslaw, mix together the carrot, cabbage and onion with a little mayonnaise.",
      "When ready to serve, season the pork with the lemon juice, tarragon, salt and pepper. ",
      "To serve, tear apart the pitta bread apart, put in a big blob of coleslaw, add the pulled pork and lettuce (if using)."
    ],
    "url": "www_bbc_com_food_recipes_lemon_and_tarragon_51274",
    "title": "Lemon and tarragon pulled pork with pitta breads and walnut mayonnaise recipe - BBC Food",
    "time": {
      "preparation": "overnightovernight",
      "preparationMins": 720,
      "cooking": "over 2 hoursover 2 hours",
      "cookingMins": 120,
      "totalMins": 840
    },
    "serves": "Serves 6-8Serves 6-8",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_and_thyme_pork_15402": {
    "ingredients": [
      "400g/14oz new potatoes, scrubbed",
      "3 tbsp mayonnaise",
      "1 tbsp crème fraiche",
      "2 tbsp baby capers, drained",
      "50g/2oz baby gherkins, drained and sliced",
      "1 lemon, zest and 2 tsp juice",
      "salt and freshly ground black pepper",
      "1 tbsp chopped fresh flatleaf parsley",
      "2 x 180g/6oz pork loin steaks, fat trimmed",
      "salt and freshly ground black pepper",
      "1 large free-range egg",
      "2 tbsp plain flour",
      "75g/2½oz coarse dried white breadcrumbs, preferably Japanese panko breadcrumbs",
      "½ lemon, zest only, finely grated",
      "15g/½oz parmesan, finely grated",
      "1 heaped tbsp chopped fresh thyme leaves",
      "300ml/10½fl oz sunflower oil",
      "2 handfuls fresh watercress",
      "1-2 tsp extra virgin olive oil"
    ],
    "method": [
      "For the potato salad, half-fill a pan with salted water and bring to the boil. Add the potatoes and return to the boil. Cook for 15-18 minutes, or until just tender. Drain in a colander and then rinse under running water until cold.",
      "Mix the mayonnaise, crème fraiche, capers, gherkins and lemon juice in a large bowl until well combined.",
      "Cut each of the potatoes into four chunks and stir into the mayonnaise dressing with the lemon zest. Season, to taste, with salt and freshly ground black pepper. Sprinkle over the parsley.",
      "For the pork schnitzels, sandwich one of the pork loin steaks between two sheets of cling film. Flatten the steak using a rolling pin or meat mallet to an even thickness of 1cm/½in. Remove the cling film and cut the flattened steak in half lengthways. Season on both sides with salt and freshly ground black pepper. Repeat the process with the remaining pork loin steaks.",
      "Beat the egg in a bowl. Sprinkle the flour onto a plate. Mix the breadcrumbs, lemon zest, parmesan, thyme and a good pinch of salt in a shallow bowl until well combined.",
      "Dredge each piece of pork first into the flour, then dip it into the beaten egg, then dredge it in the breadcrumb mixture until completely coated. Repeat the process with the remaining pieces of pork.",
      "Heat the sunflower oil in a large frying pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: hot oil can be dangerous. Do not leave unattended.)",
      "Add two of the schnitzels to the pan and fry for 2-3 minutes on each side, or until the pork is cooked through and the coating is crisp and golden-brown. Remove from the pan using a pair of tongs and set aside to drain on a warmed plate lined with kitchen paper. Keep warm. Repeat the process with the remaining two pork schnitzels.",
      "To serve, divide the potato salad among four serving plates. Arrange a few watercress leaves alongside each portion and drizzle with a little olive oil. Lay one pork schnitzel alongside."
    ],
    "url": "www_bbc_com_food_recipes_lemon_and_thyme_pork_15402",
    "title": "Lemon and thyme pork schnitzel with potato salad recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Serves 4Serves 4",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_and_thyme_pork_15402_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_cake_29430": {
    "ingredients": [
      "5 free-range eggs",
      "300g/11oz caster sugar",
      "140ml/5fl oz double cream",
      "3 lemons, zest only",
      "1½ tbsp dark rum",
      "1 pinch salt",
      "80g/3oz unsalted butter, melted",
      "240g/8½oz plain flour",
      "½ tsp baking powder",
      "3 tbsp apricot jam, warmed in a small saucepan",
      "1 lemon, zest and juice",
      "150g/5oz icing sugar"
    ],
    "method": [
      "Preheat the oven to 180C/350F/Gas 4. Lightly butter a 26cm x 9cm x 8cm/10in x 3½in x 3in loaf tin and line it with greaseproof paper.",
      "In a large mixing bowl, whisk together the eggs, sugar, cream, lemon zest, rum, salt and butter.",
      "Sift the flour and baking powder into a separate bowl then whisk it into the egg mixture until you have a smooth batter.",
      "Pour the batter into the prepared tin and bake in the oven for 50-60 minutes, turning halfway through cooking. The cake is cooked when a knife blade inserted into the middle comes out clean.",
      "Remove the cake from the tin, turn onto a cooling rack and leave to cool for 10 minutes. This will allow the steam to escape before you glaze the cake. Leave the oven turned on.",
      "Brush the cake with the warmed apricot glaze and leave for five minutes while you make the lemon glaze.",
      "For the lemon glaze, mix together the lemon juice, zest and icing sugar.",
      "Heat the mixture in a small pan, or in the microwave, until the sugar has dissolved and you have a syrup.",
      "Brush the lemon glaze all over the cake and leave for a few minutes to set.",
      "Place the glazed cake in the oven on a baking tray, turn off the heat and leave for 3-5 minutes to dry the glaze and turn it translucent.",
      "Remove the cake from the oven and leave to cool to room temperature before serving."
    ],
    "url": "www_bbc_com_food_recipes_lemon_cake_29430",
    "title": "Lemon drizzle cake recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Serves 12Serves 12",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_cake_29430_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_cake_served_with_a_72886": {
    "ingredients": [
      "75g/2½oz unsalted butter, plus extra for greasing",
      "3 medium free range eggs",
      "2 lemons, zest and juice only",
      "200g/7oz caster sugar",
      "75g/2½oz crème fraîche",
      "150g/5½oz plain flour",
      "1 tsp baking powder",
      "75g/2½oz icing sugar",
      "1 lemon, juice only",
      "300g/10½oz rhubarb, cut in 2cm/¾in pieces",
      "1 tbsp caster sugar",
      "1 orange, juice only ",
      "4 lemons, zest and juice",
      "110g/4oz butter",
      "175g/6oz caster sugar",
      "4 free-range eggs, beaten",
      "110g/4oz mild soft goats' cheese",
      "50ml/2fl oz double cream",
      "2 tbsp icing sugar",
      "100g/3½oz candied almonds",
      "4 tbsp lemon balm leaves or baby basil leaves"
    ],
    "method": [
      "For the lemon cake, preheat the oven to 180C/170C Fan/Gas 3. Grease and line a 20cm/8in square cake tin.",
      "Melt the butter and set aside to cool slightly. Put the eggs, lemon juice and sugar in a bowl. Using an electric whisk, beat until the sugar is dissolved. Whisk in the butter and crème fraiche. Sift the flour and baking powder over the top and gently fold in. Stir in the lemon zest and spoon into the prepared tin.",
      "Bake for 45-60 minutes, or until golden-brown and risen (the cake will split along the top). Put the cake on a wire rack to cool for 10 minutes before removing from the tin. Place a tray or a piece of baking paper underneath the rack.",
      "For the glaze, whisk the icing sugar and lemon juice together in a bowl then pour over the still warm cake. Remove the tray or paper from underneath the cake and pour any excess back over the cake. Allow to cool before serving.",
      "For the roasted rhubarb, preheat the oven to 200C/180C Fan/Gas 6.",
      "Arrange the rhubarb in a single layer in a roasting tin. Sprinkle over the sugar and drizzle over the orange juice. Roast for 8-12 minutes, or until just tender.",
      "For the lemon curd, put a heatproof bowl over a pan a gently simmering water (don’t let the bowl touch the water). Put the lemon zest, juice, butter and sugar in the bowl and whisk occasionally until the sugar is completely dissolved. Beat in the eggs and whisk until thickened and cooked through. Remove from the heat and allow to cool completely. ",
      "For the sugared almonds, preheat the oven to 130C/110C Fan/Gas 1 and line a baking tray with baking paper.",
      "For the goat’s cheese cream, put all the ingredients in a bowl and mix well.",
      "To serve, cut the cake into cubes or small slices and arrange on serving plates. Dress the plate with lemon curd, roasted rhubarb, goats’ cheese cream, sugared almonds and lemon balm or baby basil leaves."
    ],
    "url": "www_bbc_com_food_recipes_lemon_cake_served_with_a_72886",
    "title": "Lemon cake with roasted rhubarb recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "over 2 hoursover 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "Serves 6Serves 6",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_cake_with_lemon_56875": {
    "ingredients": [
      "4 egg whites",
      "250g/9oz caster sugar",
      "2 lemons, thinly sliced and slices cut into quarters",
      "350g/12oz butter, softened, plus extra for greasing",
      "350g/12oz caster sugar",
      "4 lemons, zested, plus juice of 2 lemons",
      "6 free-range eggs",
      "3 tsp baking powder",
      "300g/10½oz self-raising flour",
      "4 lemons, zest and juice",
      "110g/4oz butter",
      "175g/6oz caster sugar",
      "4 free-range eggs, beaten",
      "150g/5½oz mascarpone",
      "200ml/7fl oz double cream",
      "30g/1oz icing sugar",
      "½ lemon, juice only"
    ],
    "method": [
      "For the meringues, preheat the oven to 65C/150F/Gas ¼ (or to the lowest setting on your oven) and line a baking tray with a silicone mat.",
      "Place the egg whites in a large food processor with a whisk attachment and whisk until stiff peaks form when the whisk is removed.",
      "With the motor running, gradually add the sugar until you have a glossy meringue. ",
      "Spread the meringue very thinly over the silicone lined baking tray using a palette knife. ",
      "Bake in the oven for 3-4 hours, or until completely dried out (this will take less time if your oven temperature is higher than recommended).",
      "Remove shards of the cooked meringue from the silicone mat using a palette knife and set aside.",
      "For the lemon slices, preheat the oven to 65C/150F/Gas ¼ (or to the lowest setting on your oven) and line a baking tray with a silicone mat or baking parchment.",
      "Put the lemon slices onto the trays and place in the oven for about three hours or until dried out.",
      "For the lemon cake, preheat the oven to 180C/350F/Gas 4. Grease and line a square 20cm/8in cake tin.",
      "Cream the butter and sugar together in a bowl until pale and fluffy. Add the lemon zest and juice. ",
      "Slowly beat in the eggs, one at a time, until the mixture is well combined. ",
      "Sift the baking powder and self-raising flour together in a bowl then fold into the cake mixture.",
      "Pour the cake batter into the tin and bake for 25-30 minutes or until risen and golden-brown. Remove from the oven and set aside to cool for 10 minutes. Run a round-bladed knife around the inside edge of the tin to loosen the cake. Remove the cake from the tin and set aside to cool completely on a rack.",
      "For the lemon curd, place the lemon zest, juice, butter and sugar into a bowl set over a pan of simmering water. (Don’t let the bowl touch the water).",
      "Whisk occasionally until the sugar is completely dissolved then beat in the eggs and whisk until thickened and cooked through.",
      "Remove from the heat and allow to cool completely. ",
      "For the lemon cream, place the mascarpone into a bowl and beat to soften.",
      "Pour in the double cream, icing sugar and lemon juice.",
      "Whisk until the mixture forms soft peaks when the whisk is removed.",
      "Fold the lemon curd into the lemon cream.",
      "Serve slices of the cake with a spoonful of the lemon cream and decorate with shards of meringue and a couple of lemon slices."
    ],
    "url": "www_bbc_com_food_recipes_lemon_cake_with_lemon_56875",
    "title": "Lemon cake with lemon curd, meringue and lemon cream recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "over 2 hoursover 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "Serves 4Serves 4",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_curd_68499": {
    "ingredients": [
      "4 unwaxed  lemons, zest and juice",
      "200g/7oz unrefined caster sugar",
      "100g/3½oz unsalted butter, cut into cubes",
      "3 free-range eggs, plus 1 free-range egg yolk"
    ],
    "method": [
      "Put the lemon zest and juice, the sugar and the butter into a heatproof bowl.  Sit the bowl over a pan of gently simmering water, making sure the water is not touching the bottom of the bowl.  Stir the mixture every now and again until all of the butter has melted.",
      "Lightly whisk the eggs and egg yolk and stir them into the lemon mixture. Whisk until all of the ingredients are well combined, then leave to cook for 10-13 minutes, stirring every now and again, until the mixture is creamy and thick enough to coat the back of a spoon.",
      "Remove the lemon curd from the heat and set aside to cool, stirring occasionally as it cools. Once cooled, spoon the lemon curd into sterilised jars and seal.  Keep in the fridge until ready to use."
    ],
    "url": "www_bbc_com_food_recipes_lemon_curd_68499",
    "title": "Lemon curd recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Makes one 500g/1lb 2oz (large) jar or two 250g/9oz (small) jarsMakes one 500g/1lb 2oz (large) jar or two 250g/9oz (small) jars",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_curd_68499_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_chicken_and_81996": {
    "ingredients": [
      "400g/14oz boneless skinless chicken breast, cut into strips",
      "2 tbsp light soy sauce",
      "1 tbsp honey",
      "2 tbsp cornflour",
      "2 lemons, zest and juice only",
      "75ml/2½fl oz chicken stock",
      "1 tsp groundnut oil",
      "1 tbsp dry sherry",
      "1 red chilli, finely chopped",
      "3 garlic cloves, thinly sliced",
      "2cm/¾in piece fresh root ginger, peeled and finely grated",
      "3 spring onions, thinly sliced",
      "300g/10½oz squid, cleaned and cut into strips",
      "1 tsp sesame oil",
      "1 tbsp soy sauce",
      "1 tbsp mirin ",
      "2 tbsp groundnut oil",
      "3cm/1½in piece fresh root ginger, peeled and finely chopped",
      "2 garlic cloves, finely chopped",
      "2 red chillies, finely chopped ",
      "40g/1½oz black beans, rinsed, drained and roughly chopped",
      "50-75ml/2-2½fl oz chicken stock",
      "2 tbsp dry sherry or Shaoxing rice wine",
      "3 spring onions, thinly sliced",
      "2-3 tbsp fresh coriander, roughly chopped",
      "1 tbsp groundnut oil",
      "300g/10½oz cooked and cooled basmati rice ",
      "2 spring onions, sliced",
      "2 tbsp coriander leaves, roughly chopped",
      "2 tbsp soy sauce",
      "1 tsp sesame oil"
    ],
    "method": [
      "Put the chicken in a bowl. Mix the soy sauce, honey and cornflour together in a separate bowl then pour over the chicken. Toss to coat, then set aside.",
      "Mix the lemon zest, juice and chicken stock together.",
      "Heat a wok or frying pan until hot then add the groundnut oil. Add the sherry to the chicken and stir through, then add to the hot wok and stir fry for 2 minutes until just sealed. Add the chilli, garlic and ginger and the lemon and chicken stock. Bring to the boil, stirring well. Reduce the heat to a simmer and cook for 4-5 minutes until the chicken is cooked through and the sauce thickened. ",
      "For the squid, mix the squid, sesame oil, soy and mirin together in a bowl and set aside for 5 minutes.",
      "Heat a frying pan or wok until hot, add the groundnut oil and when it’s shimmering, add the ginger, garlic and chilli. Stir fry for 2 minutes or until just softened. Add the squid and black beans and stir fry for 2-3 minutes over a high heat. Add the chicken stock, sherry, spring onion and coriander. Stir well then simmer for another couple of minutes until the squid is cooked through. Spoon into a serving bowl.",
      "For the rice, heat a frying pan or wok until hot. Add the groundnut oil and when it’s shimmering, add the rice and stir fry for 1 minute before adding the spring onions, coriander, soy and sesame oil. Stir fry for 2-3 minutes, or until piping hot through then tip into a serving bowl. ",
      "To serve, add the spring onions to the lemon chicken and mix through. Serve with the squid and rice."
    ],
    "url": "www_bbc_com_food_recipes_lemon_chicken_and_81996",
    "title": "Lemon chicken and blackbean squid with stir-fried rice recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 4Serves 4",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_curd_and_passion_24599": {
    "ingredients": [
      "8 medium free-range egg whites",
      "pinch salt ",
      "400g/14oz caster sugar",
      "2 tsp white wine vinegar",
      "4 tsp cornflour",
      "900ml/1½ pint double cream",
      "2 heaped tbsp icing sugar ",
      "10-15 ripe passion fruits, halved and seeds scooped out ",
      "4 unwaxed lemons, zest and juice only ",
      "200g/7oz caster sugar",
      "100g/3½oz unsalted butter, cubed",
      "3 medium free-range eggs, plus 1 medium free-range egg yolk",
      "1 lemon, zest only ",
      "limoncello liqueur, to serve (optional)"
    ],
    "method": [
      "Preheat the oven to 150C/140C Fan/Gas 2.",
      "Draw a 20cm/8in circle on three pieces of baking parchment and put each piece on a separate baking tray.",
      "In a very clean bowl beat the egg whites with a pinch of salt using a hand-held mixer at medium speed until soft peaks form when the whisk is removed. Increase the speed to medium-high and add the sugar a tablespoon at a time. When all the sugar is incorporated continue to whisk for a further minute.  Add the vinegar and cornflour and then beat at a high speed until the meringue is glossy and holds stiff peaks when the whisk is removed (this will take about 5 minutes). ",
      "Divide the mixture equally between the circles on the three baking trays. One of the discs will be used to top the tier, so should look especially nice!",
      "Bake until the meringues have a crisp crust and feel dry to the touch, about 1-1¼ hour (the insides will still be marshmallow-like).",
      "Switch off the oven and leave the meringues to cool down in the oven, leaving the oven door slightly open.  Leave the meringues to cool very slowly in the oven.",
      "For the filling, whip the cream and icing sugar until soft peaks form when the whisk is removed. Gently stir through the passion fruit flesh.  ",
      "For the lemon curd, put the lemon zest, lemon juice, sugar and butter in a heatproof bowl.  Sit the bowl over a pan of gently simmering water, making sure the water is not touching the bottom of the bowl.  Stir the mixture every now and again until the butter has melted.  Remove the bowl from the heat.",
      "In a separate bowl, lightly whisk the eggs and egg yolk. Gently stir them into the lemon mixture, then whisk until all the ingredients are well combined.",
      "Put the bowl back over the simmering water. Heat the lemon curd for 10-13 minutes, stirring every now and again, until the mixture is creamy and thick enough to coat the back of a spoon. Remove the lemon curd from the heat and set aside to cool, stirring occasionally. It will thicken as it cools.",
      "To assemble, top a disc of meringue with a third of the passion fruit cream and a drizzle of the lemon curd.  Repeat with the other two meringue discs to make a three-tiered stack.  Decorate the top with more lemon curd and the grated lemon zest.  Serve with a shot of limoncello, if using."
    ],
    "url": "www_bbc_com_food_recipes_lemon_curd_and_passion_24599",
    "title": "Lemon curd and passion fruit pavlova recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "over 2 hoursover 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "Makes 1 large pavlovaMakes 1 large pavlova",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_curd_and_pistachio_20948": {
    "ingredients": [
      "5 free-range egg whites",
      "280g/10oz caster sugar",
      "50g/1¾ oz shelled pistachio nuts, finely chopped",
      "icing sugar, for dusting",
      "100g/3½oz butter, softened",
      "225g/8oz caster sugar",
      "5 free-range egg yolks",
      "3 large lemons, juice and finely grated zest",
      "300ml/10fl oz double cream, lightly whipped"
    ],
    "method": [
      "Preheat the oven to 200C/180C Fan/Gas 6. Line a 23x33cm/9x13in Swiss roll tin with greased non-stick baking paper.",
      "Whisk the egg whites in a clean large bowl using an electric mixer on full speed until very stiff. Gradually add the sugar, a teaspoon at a time, and still on high speed, whisking well between each addition. Whisk until very, very stiff and glossy and all the sugar has been added.",
      "Spread the meringue mixture into the prepared tin, sprinkle with the chopped nuts. Bake for about 8 minutes until very golden-brown. Lower the oven to 160C/140C Fan/Gas 3 and bake for 15 minutes more until firm to the touch. Remove and turn upside down on a piece of non-stick baking paper. Carefully peel the paper from the base of the meringue and leave it to cool for about 10 minutes. ",
      "To make the lemon curd, put the butter into a heatproof bowl, add the sugar and whisk by hand until combined. Stir in the egg yolks. Add the lemon zest and juice and whisk until smooth. Sit the bowl over a pan of just simmering water and whisk until the mixture has thickened. This will take about 8-10 minutes. Be careful the water does not boil as this will curdle the curd.",
      "Reserve 100g/3½oz (about 6 tablespoons) of the lemon curd and set aside. Spoon the remaining lemon curd into a sterilised jar. Seal and label it. It will keep in the fridge for 2 weeks. ",
      "To fill the roulade, mix the reserved lemon curd with the whipped cream, swirling to give a marbled effect. Spread over the cooled meringue. Lightly score the meringue along one long side, slightly in from edge. Use this to help you fold and start to roll the base. Roll up the meringue tightly, using the paper to help you. Sit it on a plate with the join underneath.",
      "To serve, dust with icing sugar and decorate with Easter chicks."
    ],
    "url": "www_bbc_com_food_recipes_lemon_curd_and_pistachio_20948",
    "title": "Lemon curd and pistachio meringue roulade recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 8Serves 8",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_curd_and_pistachio_20948_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_curd_mascarpone_04597": {
    "ingredients": [
      "90g/3¼oz mascarpone",
      "1 tbsp icing sugar, to taste",
      "6 tbsp lemon curd",
      "30g/1oz toasted flaked almonds",
      "4 pancakes, to serve"
    ],
    "method": [
      "Beat the icing sugar into the mascarpone a little at a time until smooth and sweet enough to suit your tastes.",
      "Spread the lemon curd over the pancakes. Top with a dollop of mascarpone and the flaked almonds. "
    ],
    "url": "www_bbc_com_food_recipes_lemon_curd_mascarpone_04597",
    "title": "Lemon curd, mascarpone and almond pancakes recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 4Serves 4",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_curd_mascarpone_04597_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_curd_meringue_cake_09194": {
    "ingredients": [
      "8 free-range egg whites",
      "400g/7oz white caster sugar",
      "4 lemons, zest and juice",
      "110g/4oz butter",
      "175g/6oz caster sugar",
      "4 free-range eggs, beaten",
      "500ml/18floz double cream",
      "50g/1¾oz physalis (Cape gooseberries)",
      "2 passion fruit, seeds only",
      "50g/1¾oz cherries",
      "50g/1¾oz redcurrants"
    ],
    "method": [
      "For the meringue, preheat the oven to 150C/300F/Gas1.",
      "Whisk the egg whites in a bowl until soft peaks are formed when the whisk is removed.",
      "Gradually add the sugar and continue to whisk until soft peaks are formed again. Spoon into a piping bag fitted with a small plain nozzle.",
      "To make a template, draw four 20cm/8in diameter circles onto baking parchment and place on a baking sheet.",
      "Starting in the centre of each circle, pipe the meringue in a spiral to fill the circle, keeping the meringue height as low as possible.",
      "Cook in the oven for 20 minutes.",
      "Turn the oven off but leave the meringues in there for at least two hours. When crisp, remove from the oven and leave to cool.",
      "For the lemon curd, place the lemon zest, juice, butter and sugar into a bowl set over a pan of simmering water. (Don’t let the bowl touch the water).",
      "Whisk occasionally until the sugar is completely dissolved then beat in the eggs and whisk until thickened and cooked through.",
      "Remove from the heat and allow to cool completely.",
      "Whisk the double cream in a large bowl until soft peaks form when the whisk is removed, then fold in the lemon curd and mix gently.",
      "Spoon into a piping bag and snip the end off, giving a width of about 1.5cm/½in.",
      "To assemble the cake, place a meringue disc onto a serving plate.",
      "Pipe the lemon curd cream in a spiral onto the meringue to cover totally.",
      "Place another meringue disc on top and repeat with the cream.",
      "Repeat with the remaining meringue and cream, finishing with meringue on top.",
      "Decorate with the fruit and serve in wedges."
    ],
    "url": "www_bbc_com_food_recipes_lemon_curd_meringue_cake_09194",
    "title": "Lemon curd meringue cake recipe - BBC Food",
    "time": {
      "preparation": "over 2 hoursover 2 hours",
      "preparationMins": 120,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 150
    },
    "serves": "Serves 6-8Serves 6-8",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_curd_swiss_roll_49855": {
    "ingredients": [
      "110g/4oz lightly salted butter ",
      "110g/4oz caster sugar",
      "2 lemons, zest and juice ",
      "2 free-range eggs, at room temperature, beaten",
      "unsalted butter, for greasing",
      "4 free-range eggs, three whole eggs plus an egg yolk",
      "160g/5¾oz caster sugar, plus extra for rolling",
      "160g/5¾oz self-raising flour, sifted "
    ],
    "method": [
      "For the lemon curd, put the butter, sugar, lemon zest and juice into a bowl set over a saucepan of simmering water (ensure the bowl does not touch the water). Stir occasionally until the sugar is dissolved. ",
      "When the sugar is dissolved, add the beaten eggs and continue to heat, stirring occasionally, until the mixture thickens. Transfer to a bowl to cool.",
      "For the sponge, preheat the oven to 200C/400F/Gas 6. Grease and line a 26x40cm/10½x16in baking tray with baking parchment.",
      "Place a large heatproof bowl over a pan of simmering water. Add the eggs and sugar to the bowl and whisk until lukewarm (don't overheat the mixture). Remove bowl and whisk until the mixture is very thick and leaves trails when the whisk is removed. Fold in the sifted flour using a metal spoon.",
      "Spread the mixture onto the prepared baking tray and place on the middle shelf in the oven. Bake for 8-10 minutes, or until firm to the touch.",
      "Lay a large piece of greaseproof paper or a tea towel on the work surface and dust with sugar. Tip out the cake onto the dusted paper/tea towel and carefully remove the baking parchment. ",
      "Spread the, still warm, lemon curd evenly over the sponge.",
      "Position the cake with one of the short ends nearest to you. Make a cut across the width of the sponge about 1cm/½in in and about three-quarters of the way through the depth of the sponge (this will help you roll up the sponge). Tightly roll up the sponge starting at the nearest edge and using the paper/tea towel to help you. Set aside to cool.",
      "Before serving, trim the ends of the roll to create a neat finish and dust with a little extra sugar, if desired. "
    ],
    "url": "www_bbc_com_food_recipes_lemon_curd_swiss_roll_49855",
    "title": "Lemon curd Swiss roll recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Makes 1 Swiss rollMakes 1 Swiss roll",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_drizzle_cake_66665": {
    "ingredients": [
      "200g/7oz butter, softened, plus extra for greasing",
      "200g/7oz golden caster sugar",
      "3 large free-range eggs (organic if possible)",
      "50g/2oz plain flour or white spelt flour",
      "125g/4½oz ground almonds",
      "2 lemons (juice of 1 and finely grated zest of 2)",
      "1 lemon, juice only",
      "5-6 tbsp icing sugar"
    ],
    "method": [
      "Preheat the oven to 180C/350F/Gas 4. Grease the base and sides of a 20-22cm/8-8½in round cake tin and line the bottom with baking parchment.",
      "In a mixing bowl cream together the butter and sugar until light and fluffy using an electric hand whisk or wooden spoon. Slowly beat in the eggs, one at a time. When the eggs are fully incorporated, fold in the flour, then the almonds and lemon zest.",
      "Scrape the mixture into the tin and tap the sides to release any air bubbles. Bake for 35-40 minutes, or until the sponge is lightly golden-brown, coming away from the sides of the tin and a skewer inserted into the middle of the cake comes out clean. ",
      "While the cake is still hot and still in the tin, stab it with a chopstick or some such weapon all over the cake, making 15 or so holes. Drizzle the lemon juice into the holes and all over the cake then leave in the tin to cool.",
      "When you're ready to serve the cake, make the icing. To make the icing, mix the lemon juice, a little at a time, into the icing sugar to make a smooth paste. Remove the cake from the tin and smooth the icing on the top, then serve."
    ],
    "url": "www_bbc_com_food_recipes_lemon_drizzle_cake_66665",
    "title": "Lemon and almond cake recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Serves 8Serves 8",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_drizzle_cake_66665_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_curd_trifle_04769": {
    "ingredients": [
      "4 free-range eggs",
      "225g/8oz caster sugar ",
      "225g/8oz unsalted butter, melted",
      "225g/8oz self-raising flour",
      "100ml/3½fl oz vodka",
      "2 lemons, juice and zest only",
      "250g/9oz caster sugar",
      "300g/10½oz frozen raspberries ",
      "75g/2½oz caster sugar ",
      "1 vanilla pod, seeds only",
      "4 lemons, juice and zest",
      "225g/8oz unsalted butter",
      "350g/12oz caster sugar",
      "4 free-range eggs",
      "600ml/20fl oz milk",
      "600ml/20fl oz double cream",
      "1 vanilla pod, cut in half lengthways",
      "150g/5½oz sugar",
      "100g/3½oz cornflour",
      "3 free-range eggs",
      "3 free-range egg yolks",
      "50g/1¾oz unsalted butter, cubed",
      "400ml/14fl oz double cream, whipped",
      "4 tbsp crushed unsalted, shelled pistachio nuts"
    ],
    "method": [
      "Preheat the oven to 180C/160C Fan/Gas 4 and line a 15x20cm/6x8in cake tin with baking paper. Alternatively use 2 x 20cm/8in round cake tins (the shape of the tin does not matter as the cake will be broken up for the trifle).",
      "For the sponge, in a large bowl whisk the eggs and sugar on high using an electric whisk for 3 minutes, or until thick, creamy and at least doubled in size. Pour in the melted butter in a steady stream, mixing all the time. Gently fold the flour into the mixture. ",
      "Pour the mixture into the prepared tin and bake for 20-25 minutes. Remove from the oven and leave to cool in the tin slightly before transferring to a wire rack to fully cool.",
      "For the lemon syrup, in a saucepan combine all the ingredients with 100ml/3½fl oz water and bring to the boil. Once syrupy, remove from the heat and set aside to cool.",
      "For the compôte, combine all the ingredients with 150ml/¼ pint water in a saucepan. Gently simmer for about 10 minutes. Remove from the heat and set aside to cool.",
      "For the lemon curd, in a saucepan gently bring the lemon juice, zest, butter and half of the sugar to a simmer. In a bowl, combine the remaining sugar with the eggs and lightly whisk. Slowly pour the juice mixture over the eggs, whisking constantly. Pour back into the pan and place over a low heat. Stir constantly for about 5 minutes until thickened. Pass through a sieve and keep refrigerated until needed.",
      "For the custard, gently heat the milk, cream and vanilla in a saucepan until just boiling. Remove from the heat. Combine the sugar and cornflour in a mixing bowl and gradually whisk in the eggs and yolks. ",
      "Pour the warm milk mixture over the eggs, a little at a time, whisking constantly. Return to the pan and stir constantly over a low heat until thickened. Pass through a sieve and remove the vanilla pod. Cover the surface with baking paper to prevent a skin forming while the custard cools.",
      "To assemble the trifle, start by layering pieces of the sponge in the bottom of a serving dish or individual glasses. Pour over the syrup and let it soak in for about 5 minutes or so. ",
      "Add a layer of the raspberry compôte and then the lemon curd. Spoon the custard on top. Finish with the whipped cream and sprinkle over the crushed pistachios. Refrigerate until ready to serve."
    ],
    "url": "www_bbc_com_food_recipes_lemon_curd_trifle_04769",
    "title": "Lemon curd trifle  recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "1 to 2 hours1 to 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "Serves 8–10Serves 8–10",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_drizzle_traybake_01890": {
    "ingredients": [
      "225g/8oz butter or baking spread at room temperature, plus extra for greasing",
      "225g/8oz caster sugar",
      "275g/10oz self-raising flour",
      "2 level tsp baking powder",
      "4 free-range eggs",
      "4 tbsp milk",
      "2 unwaxed lemons, finely grated zest only",
      "1 heaped tbsp very finely chopped lemon verbena (optional)",
      "175g/6oz granulated sugar",
      "2 lemons, juice only"
    ],
    "method": [
      "Preheat the oven to 180C/160C Fan/Gas 4. Grease the tin with butter and line the base with baking paper.",
      "Measure all the ingredients into a large bowl and beat for 2 minutes, or until well blended. Turn the mixture into the prepared tin and level the top.",
      "Bake for 35–40 minutes, until the cake has shrunk a little from the sides of the tin and springs back when lightly touched with a fingertip in the centre of the cake. ",
      "Meanwhile, make the glaze. Mix the sugar with the lemon juice and stir to a runny consistency. ",
      "Leave the cake to cool for 5 minutes in the tin, then lift out, with the lining paper still attached, and place on wire rack set over a tray.",
      "Brush the glaze all over the surface of the warm cake and leave to set. Remove the lining paper and cut into slices to serve."
    ],
    "url": "www_bbc_com_food_recipes_lemon_drizzle_traybake_01890",
    "title": "Lemon drizzle traybake recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Makes 16 slicesMakes 16 slices",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_drizzle_traybake_01890_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_drizzle_cake_with_90476": {
    "ingredients": [
      "350g/12oz butter, softened, plus extra for greasing",
      "350g/12oz caster sugar",
      "4 lemons, zest only, plus juice of 2 lemons",
      "3 large pieces candied lemon peel , finely chopped",
      "6 free-range eggs",
      "3 tsp baking powder",
      "300g/10½oz self-raising flour",
      "50g/2oz cornflour",
      "60g/2¼oz butter",
      "225g/8oz caster sugar",
      "3 lemons, juice and zest",
      "2 free-range eggs",
      "300ml/12fl oz double cream",
      "200g/7oz icing sugar, sifted, plus extra for dusting"
    ],
    "method": [
      "Preheat the oven to 180C/350F/Gas 4. Grease and line three 20cm/8in sandwich tins.",
      "Cream the butter and sugar together in a bowl until pale and fluffy. Add the lemon zest and juice and candied peel. ",
      "Slowly beat in the eggs, one at a time, until the mixture is well combined. ",
      "Sift the baking powder, self raising flour and cornflour together in a bowl and fold into the cake mixture.",
      "Divide the cake batter among the sandwich tins and bake for 25-30 minutes or until risen and golden-brown. Remove from the oven and set aside to cool for 10 minutes. Run a round-bladed knife around the inside edge of the tins to loosen the cakes. Remove the cakes from the tins and set aside to cool completely on a rack.",
      "While the cakes are cooking, make the lemon curd. Heat the butter, sugar and lemon juice and zest in a bowl set over a pan of simmering water, stirring occasionally until the butter has melted and the sugar has dissolved. (Do not allow the base of the bowl to touch the surface of the water.) Remove from the heat.",
      "Meanwhile, beat the eggs in a separate bowl. Slowly whisk the melted butter mixture into the beaten eggs until well combined.",
      "Set the bowl over the pan of simmering water and cook, whisking constantly, for 2-3 minutes or until the mixture thickens enough to coat the back of a spoon. ",
      "Sieve the lemon curd into a clean bowl, then cover with cling film and set aside to cool.",
      "For the filling, whip the cream and icing sugar together in a bowl until soft peaks form when the whisk is removed.",
      "Place one of the cakes onto a serving plate and spread with the lemon curd. Spread over some of the whipped cream and sandwich with another cake. Repeat the process with the remaining lemon curd, whipped cream and cake tiers. Dust with icing sugar."
    ],
    "url": "www_bbc_com_food_recipes_lemon_drizzle_cake_with_90476",
    "title": "Lemon cake with lemon curd and double cream recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Serves 12Serves 12",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_drizzle_cake_with_90476_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_hummus_83864": {
    "ingredients": [
      "2 x 400g/14oz can chickpeas, drained",
      "1 garlic clove, crushed",
      "5 tbsp extra virgin olive oil",
      "2 lemons, zest and juice only",
      "3 tbsp Greek yoghurt",
      "a good pinch ground cumin",
      "plenty of ground black pepper and salt"
    ],
    "method": [
      "Place all the ingredients in a food processor with two tablespoons of hot water and blend until smooth. ",
      "Season, to taste, and serve chilled."
    ],
    "url": "www_bbc_com_food_recipes_lemon_hummus_83864",
    "title": "Lemon hummus  recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "no cooking requiredno cooking required",
      "cookingMins": 0,
      "totalMins": 30
    },
    "serves": "Serves 8 as part of a sharing platterServes 8 as part of a sharing platter",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_hummus_83864_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_herb_and_paprika_35932": {
    "ingredients": [
      "1 whole chicken (1.5–1.8kg/3lb 5oz–4lb)",
      "1tsp salt",
      "1 tsp black peppercorns",
      "½ tsp finely  chopped fresh rosemary",
      "½ tsp finely chopped fresh chives",
      "1 tsp sweet smoked paprika",
      "1 lemon, zest and juice",
      "2 tbsp olive oil"
    ],
    "method": [
      "To spatchcock the chicken, turn it breast-side down with the legs towards you. Using very sturdy kitchen scissors or poultry shears, cut down one side of the parson’s nose and the backbone.Turn the chicken around and cut along the other side of the backbone, back to the parson’s nose. Remove this piece and discard. Flip the chicken breast-side up again and press down firmly on the breast bone to flatten it out. ",
      "Mix together the salt, peppercorns, herbs, paprika and lemon zest in a small bowl and whisk in the oil. Rub this mixture all over the chicken.",
      "Put the chicken in a bowl or a plastic bag and pour over the lemon juice. Place in the fridge to marinate overnight or for at least 1 hour. ",
      "Remove the chicken from the fridge 1 hour before you are ready to cook it.",
      "Put the chicken in the hot oven and reduce the temperature to 200C/Fan 180C/Gas 6. Roast for 35–40 minutes until cooked through and the juices run clear. Alternatively, cook the chicken on a barbecue, turning regularly until cooked through. ",
      "To oven cook, preheat the oven to its highest setting and put the chicken in a large roasting tray. "
    ],
    "url": "www_bbc_com_food_recipes_lemon_herb_and_paprika_35932",
    "title": "Lemon, herb and paprika spatchcocked chicken recipe - BBC Food",
    "time": {
      "preparation": "overnightovernight",
      "preparationMins": 720,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 780
    },
    "serves": "Serves 4–6Serves 4–6",
    "isVegetarian": false,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_iced_buns_24468": {
    "ingredients": [
      "250g/9oz strong white flour, sifted",
      "250g/9oz plain flour, sifted",
      "125ml/4fl oz warm water",
      "125m/4fl oz warm milk",
      "1 x 7g/¼oz sachet fact-action dried yeast",
      "2 tsp fine sea salt",
      "50g/2oz caster sugar",
      "1 lemon, zest only",
      "1 free-range egg, beaten",
      "50g/2oz butter, cut into cubes",
      "vegetable oil, for greasing",
      "50g/2oz icing sugar, sifted",
      "½ lemon, juice only"
    ],
    "method": [
      "Place the flours, water, milk, yeast, salt, sugar and lemon zest into a large bowl and mix with a fork until combined. Add the beaten egg and butter and continue to mix until the mixture comes together as a sticky dough.",
      "Tip the dough onto a lightly floured work surface and knead for five minutes, or until the dough is smooth and elastic.",
      "Lightly oil a bowl with a little of the vegetable oil.",
      "Place the dough into the bowl and turn until it is covered in the oil. Cover the bowl with cling film and set aside in a warm place for one hour, or until the dough has doubled in size. ",
      "Lightly grease two baking trays.",
      "Knock the dough back to its original size and turn it out onto a lightly floured work surface. Divide the dough into eight portions, shape them into rounds and place onto the baking trays. Ensure the rolls are well spaced. Cover with a tea towel and set aside to prove for 30 minutes. ",
      "Preheat the oven to 220C/425F/Gas 7. ",
      "Bake the buns in the oven for 20-25 minutes or until well risen and golden-brown. Remove the buns from the oven and set aside to cool on a wire rack.",
      "Meanwhile for the icing, mix the icing sugar and lemon juice together in a bowl until smooth. ",
      "Once the buns have completely cooled, spread the icing on top of them and set aside until the icing has hardened."
    ],
    "url": "www_bbc_com_food_recipes_lemon_iced_buns_24468",
    "title": "Lemon iced buns recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "1 to 2 hours1 to 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "Makes 8 bunsMakes 8 buns",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_madeira_cake_with_15109": {
    "ingredients": [
      "1 unwaxed lemon",
      "200g/7oz granulated sugar",
      "100g/3½oz caster sugar",
      "175g/6oz softened butter",
      "175g/6oz caster sugar",
      "225g/8oz self-raising flour",
      "50g/1¾oz ground almonds",
      "4 large free-range eggs",
      "1 large unwaxed lemon, finely grated zest only"
    ],
    "method": [
      "For the candied peel, cut the lemon into 8 wedges, then cut out the flesh, leaving a 5mm thickness of peel and pith. Cut each wedge into 4 strips.",
      "Pour 300ml/10fl oz water into a small pan, add the granulated sugar and heat, stirring until the sugar has dissolved.  Add the lemon zest and simmer uncovered for 30-45 minutes, until the lemon peel is soft and translucent. ",
      "Drain in a wire sieve and leave to cool. Spread the peel out on a baking sheet lined with parchment and sprinkle with caster sugar. Place in the oven on the lowest setting (approximately 110C/90C Fan/Gas ¼) for 1 hour until dry. ",
      "For the cake, preheat the oven to 180C/160C Fan/Gas 4. Grease a 18cm/7in deep round cake tin and line the base and sides with baking parchment.",
      "Put the butter, sugar, flour, ground almonds, eggs and lemon zest into a large bowl. Using an electric mixer, beat for 1 minute to mix thoroughly. Turn into the prepared tin and level the surface.",
      "Bake for 35 minutes. Decorate with 3 pieces of candied peel and bake for a further 20-25 minutes, until a skewer inserted into the centre, comes out clean. Leave in the tin for 15 minutes to cool before turning out onto a wire rack to cool completely.  "
    ],
    "url": "www_bbc_com_food_recipes_lemon_madeira_cake_with_15109",
    "title": "Lemon Madeira cake with candied peel recipe - BBC Food",
    "time": {
      "preparation": "30 mins to 1 hour30 mins to 1 hour",
      "preparationMins": 60,
      "cooking": "over 2 hoursover 2 hours",
      "cookingMins": 120,
      "totalMins": 180
    },
    "serves": "Makes 1 x 18cm/7in cakeMakes 1 x 18cm/7in cake",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_madeira_cake_with_15109_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_meringue_cupcakes_41613": {
    "ingredients": [
      "100g/3½oz baking spread",
      "150g/5½oz self-raising flour",
      "150g/5½oz caster sugar",
      "3 tbsp full-fat milk",
      "2 free-range eggs",
      "1 unwaxed lemon, finely grated zest only",
      "7g freeze-dried strawberries (available in large supermarkets), to decorate",
      "lemon curd",
      "2 free-range egg whites",
      "100g/3½oz caster sugar"
    ],
    "method": [
      "Preheat the oven to 180C/160C Fan/Gas 4. Line a 12-hole muffin tray with cases.",
      "Put the sponge ingredients into a bowl and whisk using an electric hand whisk until light and fluffy. Spoon the mixture evenly between the cases. Bake for 18–20 minutes or until golden-brown, risen and springy to the touch. Set aside to cool completely. ",
      "Cut a deep circle in the centre of each cake (about the width of a £2 coin) and pull out a walnut size of sponge to leave a hole. Spoon 1 teaspoon lemon curd into each hole, making sure the curd is level with the top.",
      "To make the meringue, whisk the egg whites in a large bowl with an electric hand whisk until stiff. Gradually add the sugar as you continue whisking on full speed, until you have a stiff glossy mixture. Spread or pipe on the top of each cupcake and sit back in their tins.  ",
      "Use a chef’s blowtorch to brown the meringues or slide the tray under the grill. Watch carefully and remove when golden-brown. ",
      "Sprinkle with the freeze-dried strawberries."
    ],
    "url": "www_bbc_com_food_recipes_lemon_meringue_cupcakes_41613",
    "title": "Mary Berry's lemon meringue cupcakes recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Makes 12 cupcakesMakes 12 cupcakes",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_meringue_cupcakes_41613_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_meringue_ice_cream_57978": {
    "ingredients": [
      "300ml/½ pint double cream",
      "1 lemon, zest and juice",
      "1 jar good quality lemon curd",
      "50g/1¾oz meringues, broken into chunky pieces",
      "2 tbsp chopped fresh lemon balm",
      "3 passionfruit, halved, pulp and seeds scooped out",
      "sprigs of lemon balm, to garnish"
    ],
    "method": [
      "Line a 450g/1lb loaf tin with clingfilm, overlapping the sides. Whisk the cream lightly until the whisk leaves a trail, add the lemon zest and juice and half the jar of lemon curd then fold in the meringue and chopped lemon balm.",
      "Spoon the mixture into the loaf tin, cover with clingfilm and freeze for at least six hours.",
      "If the ice cream has been freezing overnight or longer, remove it from the freezer for 10-15 minutes before turning onto a plate. Lift the ice cream from the loaf tin, invert it onto a board and remove the clingfilm. Dip a sharp knife in boiling water and cut the ice cream into thick slices.",
      "Mix the other half of the lemon curd with the pulp and seeds from the passion fruit. Place a slice of ice cream on a plate and top with a spoonful of the passionfruit sauce. Decorate with sprigs of lemon balm."
    ],
    "url": "www_bbc_com_food_recipes_lemon_meringue_ice_cream_57978",
    "title": "Lemon meringue ice cream with lemon balm recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "no cooking requiredno cooking required",
      "cookingMins": 0,
      "totalMins": 30
    },
    "serves": "Serves 6Serves 6",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_meringue_ice_cream_57978_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "www_bbc_com_food_recipes_lemon_meringue_pie_01804": {
    "ingredients": [
      "250g/9oz plain flour, plus extra for dusting",
      "pinch salt",
      "125g/4½oz butter, cut into cubes",
      "1 tbsp caster sugar",
      "2 large free-range egg yolks",
      "3 tbsp cold water",
      "80g/2¾oz cornflour",
      "325g/11½oz caster sugar",
      "150ml/¼ pint lemon juice",
      "1 unwaxed lemon, finely grated zest only",
      "80g/2¾oz unsalted butter, cut into cubes",
      "4 large free-range egg yolks",
      "225g/8oz caster sugar",
      "3 large free-range egg whites "
    ],
    "method": [
      "Preheat the oven to 190C/170C Fan/Gas 5.",
      "To make the pastry, sift the flour and salt into a bowl. Rub in the butter using your fingertips until the mixture resembles fine breadcrumbs. Stir in the sugar. ",
      "Add the egg yolks and then the cold water, a little at a time, using a table knife to bring the pastry together. If the mixture is too dry to hold together, add a little more water. Do not overwork the pastry or make it too sticky or it will become tough. Shape into a disc, cover with cling film and place in the fridge for at least 10 minutes.",
      "Unwrap the pastry and roll it out on a lightly floured surface to a large circle about 3mm thick.",
      "Transfer the pastry on the rolling pin to a 23cm/9in loose-bottomed tart tin, pressing it into all the corners and allowing excess pastry to hang over the edge. Chill in the fridge for 10 minutes. ",
      "Place the lined tart tin on a baking sheet. Line the pastry case with baking paper and ceramic baking beans or dried beans. Bake for 15–20 minutes. Remove the beans and paper and bake for a further 5–8 minutes, until pale golden. Leave to cool. Trim off the excess pastry with a sharp knife.",
      "To make the filling, combine the cornflour and sugar in a saucepan, then stir in the lemon juice and 300ml/10½fl oz water until smooth. Bring to the boil, stirring frequently, until the mixture thickens. Reduce the heat, simmer gently for 1–2 minutes, then remove from the heat and immediately stir in the egg yolks. Leave to cool a little. ",
      "Stir in the lemon zest and butter and mix until combined. Pour it into the pastry case and set aside to cool completely. The mixture should be smooth, thickened and set. ",
      "To make the meringue, put the sugar and 75ml/2½fl oz water into a saucepan and gently bring to the boil, stirring until the sugar is dissolved. Cook until the sugar syrup reaches 120C on a thermometer.  ",
      "Meanwhile, put the egg whites into a free-standing mixer with a balloon whisk. When the syrup reaches 110C, start whisking until stiff peaks form when the whisk is removed. Once the syrup reaches 120C, while the mixer is whisking, pour it over the egg whites. Be careful not to pour it over the mixing attachment, which could splash it back at you. Whisk until the meringue is cool – it should be shiny and stiff. ",
      "Remove the cooled tart from the tin. Spoon the meringue over the top, making sure there are no gaps and spreading it out so it just touches the pastry (this will stop it sliding off). Use the spoon to make it smoothly swirled or to create peaks all over.  ",
      "Using a blowtorch, gently caramelise the meringue. Alternatively, you can do this under a preheated grill for a few seconds. Serve. "
    ],
    "url": "www_bbc_com_food_recipes_lemon_meringue_pie_01804",
    "title": "How to make lemon meringue pie recipe - BBC Food",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 8Serves 8",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_meringue_pie_01804_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  }
}